{"docID": 0, "source": "https://cs.wikipedia.org/wiki/Um%C4%9Bl%C3%A1_inteligence", "text": "title: umělá inteligence\nurl: https://cs.wikipedia.org/wiki/Um%C4%9Bl%C3%A1_inteligence\ntext: Na tento článek je\npřesměrováno\nheslo\nAI\n. Další významy jsou uvedeny na stránkách\nUmělá inteligence (rozcestník)\na\nAI (rozcestník)\n.\nInformatika\nObory informatiky\nProgramování\nMatematická informatika\n(\nTeoretická informatika\nTeorie složitosti\nUmělá inteligence\nTeorie grafů\nTeorie informace\n)\nInformační technologie\nBioinformatika\nChemoinformatika\nGeoinformatika\nLékařská informatika\nNeuroinformatika\nSociální informatika\nInformatici\nCharles Babbage\nAlan Turing\nDonald Knuth\ndalší…\nDějiny informatiky\nUmělá inteligence\n(\nUI\n,\nanglicky\nartificial intelligence\n– zkráceně\nAI\n) je\ninteligence\nprojevovaná\nstroji\n, zejména\npočítači\ns vhodným\nprogramovým vybavením\n, a zároveň je to obor\ninformatiky\nzabývající se tvorbou takových počítačových systémů. Ty řeší komplexní úlohy jako je rozpoznávání, diagnostika či klasifikace, např. v oblastech zpracování obrazu (ve formě\npixelů\npomocí\nkonvolučních\nneuronových sítí\n) či zpracování psaného textu či mluveného jazyka (ve formě kódu\njazykových modelů\n), nebo plánování či řízení na základě zpracování\nvelkých objemů dat\n.\n[\n1\n]\nÚzká umělá inteligence\n(\nanglicky\nnarrow artificial intelligence\n– zkráceně\nNAI\n) či „slabá AI“ odkazuje na systémy zaměřené na řešení jediné úzce vymezené úlohy. Mezi příklady NAI patří internetoví\nboti\nnebo virtuální asistenti jako např.\nGoogle Assistant\nnebo\nSiri\n.\nObecná umělá inteligence\n(\nanglicky\nartificial general intelligence\n– zkráceně\nAGI\n) či „silná AI“ odkazuje na systémy řešící úlohy stejně dobře nebo dokonce lépe než člověk a řeší je bez nutnosti předchozího učení jednotlivých úzce vymezených úloh. AGI spojující „lidské“ flexibilní myšlení a uvažování se super rychlým zpracováním dat by se mohla stát realitou podmíněnou úspěšným vývojem\nkvantových počítačů\n.\nSuperinteligence\n(\nanglicky\nartificial superinteligence\n– zkráceně\nASI\n)\nLegislativně definovat umělou inteligenci je obtížné a i jemné rozdíly v definici mohou mít zásadní dopady.\n[\n2\n]\nTermín\numělá inteligence\nse také často nadužívá jako\nbuzzword\n.\n[\n3\n]\nOblasti umělé inteligence\nStrojové učení\nPodrobnější informace naleznete v článku\nStrojové učení\n.\nStrojové učení je podoblastí umělé inteligence, zabývající se algoritmy, které umožňují počítačovému systému „učit se“. Učením v daném kontextu rozumíme takovou změnu vnitřního stavu systému, která zefektivní schopnost přizpůsobení se změnám okolního prostředí. Strojové učení má široké uplatnění. Jeho techniky se využívají pro rozpoznávání a\nkompresi\nobrazů či\nakustických\n(např.\nrozpoznávání řeči\n) nebo elektrických (např.\nEKG\n,\nEEG\n)\nsignálů\n,\nklasifikaci\nči\nsegmentaci\ndat, předvídání vývoje časových řad (např.\nburzovních indexů\n), k\nrozpoznávání psaného textu\nči k\nfiltrování\nspamu\n. V lékařství slouží k diagnostice onemocnění a v řízení\npro podporu rozhodování\n.\nNeuronové sítě\nPodrobnější informace naleznete v článku\nUmělá neuronová síť\n.\nUmělé neuronové sítě v umělé inteligenci jsou volně inspirovány odpovídajícími biologickými strukturami. Oproti nim jsou však značně zjednodušeny a používají jiné mechanismy učení, než jaké používá např. lidský mozek. Cílem totiž není věrně simulovat biologické struktury, ale především řešit praktické problémy. Jedná se o přístup ke strojovému učení, který se stal velmi úspěšným. Neuronové sítě se používají mimo jiné k rozpoznávání a\nkompresi\nobrazů či\nakustických\n(např.\nrozpoznávání řeči\n) nebo elektrických (např.\nEKG\n,\nEEG\n)\nsignálů\n,\nklasifikaci\nči\nsegmentaci\ndat, předvídání vývoje časových řad (např.\nburzovních indexů\n), k rozpoznávání psaného textu či k\nfiltrování\nspamu\n. Tvorbou biologicky věrných modelů neuronů a neuronových sítí se zabývají výpočetní neurovědy, prohlubující znalosti o fungování informačních systémů (\nnervových soustav\n) živých organismů. Například\nGrossbergova neuronová síť\nvznikla původně jako simulace fyziologického modelu rozpoznávání vzorů na\nsítnici\nlidského oka.\nRobotika\nPodrobnější informace naleznete v článku\nRobotika\n.\nRobotika je věda o robotech, jejich designu, výrobě a aplikacích.\nRobot\nmůže buď pomáhat, nebo dělat lidskou práci, popř. zajišťovat i komfort společnosti. Robotika úzce souvisí s\nelektronikou\n,\nmechanikou\na aplikovaným\nsoftwarem\n.\nPočítačové vidění\nPodrobnější informace naleznete v článku\nPočítačové vidění\n.\nJde o vidění zobecněné: Zdaleka ne jen viditelným světlem, dokonce ani vůbec ne světlem, nýbrž třeba akusticky, obecně tedy echolokací.\nve 2D:\nDetekce hran v obrazu, jejich aproximační prodloužení, ohodnocení významnosti detekovaných hran, odstranění vlivu různého jasu napříč obrazem.\nOptické rozpoznávání znaků\npro rozpoznávání tištěného textu, rozpoznávání ručně psaného textu. Schopnost rozpoznávání předmětů pootočených, skloněných, jinak barevných či dokonce vzorovaných, neúplných oříznutím nebo zašuměním.\nRozpoznávání tvarů a z nich\nusuzování\nna objekty reálného světa (dokonce i s určením pravděpodobnosti), typicky z fotografií.\nRealtime detekce tváře ve snímcích videa, nejsnáze podle předem zadaných bodů k hledání a jejich vzájemných vztahů: vzdáleností. Obecně detekce předepsaného vzoru v obraze.\nve 3D:\nOdstranění paralaxy (zkreslení ubíháním rovnoběžek), například použitím maticové transformace, jejím autonomním nalezením. Rozpoznání identity s již viděným (známým) objektem, nyní však pozorovaným z jiného úhlu.\nSamostatné zorientování se v prostoru: určení směrů souřadnicového systému okolního prostoru.\nUvědomění si vlastní polohy v okolním prostoru při (nedokonalém) sběru dat o okolí, vytváření vnitřního modelu o něm: typicky mapy. Klíčové pro autonomně se pohybující roboty: Nekonečná smyčka střídání kroků v prostoru / na mapě.\nBayesovské sítě\nPodrobnější informace naleznete v článku\nBayesovská síť\n.\nBayesovská síť je pravděpodobnostní model, který využívá grafovou reprezentaci pro zobrazení pravděpodobnostních vztahů mezi jednotlivými jevy. Využívá se pro určení\npravděpodobnosti\nurčitých jevů, přičemž vychází ze základu\nteorie pravděpodobnosti\n. Bayesovská síť je acyklický\norientovaný graf\n, kde každý uzel odpovídá jedné náhodné veličině, přičemž každý graf typicky obsahuje několik veličin/uzlů. Všechny veličiny v grafu se vztahují k neznámému jevu, přičemž každá veličina je reprezentována jedním\nuzlem\na\nvětve\n(neboli vztahy) mezi uzly zobrazují pravděpodobnostní závislost mezi vybranými veličinami. Tyto závislosti se obvykle vypočítávají na základě\nstatistických\nmetod.\nExpertní systémy\nPodrobnější informace naleznete v článku\nExpertní systém\n.\nExpertní systém je\npočítačový program\n, který má za úkol poskytovat\nexpertní\nrady, rozhodnutí nebo doporučit řešení v konkrétní situaci. Expertní systémy jsou navrženy tak, aby mohly zpracovávat nenumerické a neurčité informace a řešit tak úlohy, které nejsou řešitelné tradičními algoritmickými postupy. Expertní systém má dvě základní komponenty, které jsou na sobě relativně nezávislé.\nŘídící mechanismus\npro odvozování závěrů a\nBázi znalostí\n. V průběhu zpracovávání se k bázi znalostí přidávají dočasné informace o řešeném případu.\nDobývání znalostí\nPodrobnější informace naleznete v článku\nData mining\n.\nData mining (\ndolování z dat\nči\nvytěžování dat\n) je analytická metodologie získávání netriviálních skrytých a potenciálně užitečných informací z dat. Někdy se chápe jako analytická součást\ndobývání znalostí z databází\n(Knowledge Discovery in Databases, KDD), jindy se tato dvě označení chápou jako souznačná. Často dochází také k překryvu s termínem\ndata science\n, který bývá obvykle chápán šířeji než data mining. Data mining se používá v komerční sféře (například v marketingu při rozhodování, které klienty oslovit dopisem s nabídkou produktu), ve vědeckém výzkumu (například při analýze genetické informace) i v jiných oblastech (například při monitorování aktivit na internetu s cílem odhalit činnost potenciálních škůdců a teroristů).\nFuzzy logika\nPodrobnější informace naleznete v článku\nFuzzy logika\n.\nFuzzy\nlogika\nje podobor\nmatematické logiky\nodvozený od\nteorie fuzzy množin\n, v němž se logické\nvýroky\nohodnocují mírou pravdivosti. Liší se tak od klasické\nvýrokové logiky\n, která používá pouze dvě\nlogické hodnoty\n– nepravdu a pravdu, tj. nulu a jedničku. Fuzzy logika může operovat se všemi hodnotami z\nintervalu\n⟨0,1⟩, kterých je nekonečně mnoho. Fuzzy logika může být pro řadu reálných rozhodovacích úloh vhodnější než klasická logika, protože usnadňuje návrh složitých\nřídicích systémů\n.\nEvoluční algoritmy\nPodrobnější informace naleznete v článku\nGenetický algoritmus\n.\nEvoluční algoritmy se užívají k nalezení dostatečně kvalitního řešení optimalizačních úloh v dostatečně krátkém čase. Mezi evoluční algoritmy inspirované přírodou se zahrnuje celé spektrum optimalizačních\nheuristických\ntechnik, např.\ngenetické algoritmy\nči\nsimulované žíhání\n. Heuristiky můžeme popsat jako zkratkovitý postup prohledávání prostoru řešení bez záruky správného výsledku, nicméně jsou zbaveny celé řady neduhů konvenčních optimalizačních metod, jako např. požadavek spojitosti či diferencovatelnosti objektivní resp. vazební funkce, respektování omezujících podmínek, uvíznutí v mělkém lokálním minimu atd. Na druhou stranu však je při jejich aplikaci zapotřebí nastavení jistých volných parametrů, které je nutné „naladit“ v závislosti na konkrétním optimalizačním problému.\nMultiagentní systémy\nPodrobnější informace naleznete v článku\nMultiagentní systém\n.\nMultiagentní systém je simulované prostředí se síťovým charakterem, v němž dochází k interakci (po větvi sítě)\nagentů\n(uzlů sítě) mezi sebou a / nebo s prostředím, ve kterém se nacházejí. Tito agenti řeší společně problémy, které přesahují znalosti každého z nich. Mezi multiagentní systémy se řadí např. strategie ptačího hejna (Particle Swarm Optimization (PSO)) či strategie mravenčí kolonie (Ant Colony Optimization (ACO)).\nProhledávání stavového prostoru\nPodrobnější informace naleznete v článku\nProhledávání stavového prostoru\n.\nZvláště při vytváření algoritmů na řešení klasických her (šachů, dámy) se jeví účelné zadefinovat si množinu stavů, do kterých se můžeme ve hře dostat, přípustné tahy neboli přechody mezi stavy a počáteční a koncové pozice. Hledáme pak cestu od počátečních stavů ke koncovým stavům, které znamenají náš úspěch. Jelikož mohou být stavové prostory rozsáhlé (např. ve hře\ngo\n) a v některých případech i nekonečné, je třeba volit chytré metody ořezávání nevhodných cest a ohodnocování pozic.\nZpracování přirozeného jazyka\nPodrobnější informace naleznete v článcích\nZpracování přirozeného jazyka\n,\npočítačová lingvistika\na\nmatematická lingvistika\n.\nPočítačové\nzpracování přirozeného jazyka\n(\nNatural Language Processing\n, NLP) se zabývá analýzou, transformací či generování textů nebo mluveného slova. Aplikacemi NLP jsou např.\nstrojový překlad\n,\nautomatické zodpovídání dotazů\n(pro chatboty a podobně),\ndolování z textu\n,\nvýtah z textu\n(automatická sumarizace), automatická\nkorektura textu\n,\nextrakce informací\nz korpusů textů,\ngenerování přirozeného jazyka\n,\nrozpoznávání řeči\na\njejí syntéza\n. Kolem roku 2010 toto pole v zásadě ovládly technologie založené na\nhlubokém učení\n, jež zpravidla vykazují vyšší kvalitu než starší technologie založené např. na lingvistické analýze textu.\nVelké jazykové modely\n(LLM –\nlarge language model\n) využívají například aplikace\nChatGPT\nod\nOpenAI\n,\nClaude\nod\nAnthropic\n,\nGrok\nod\nxAI\n, nebo\nGemini\nod\nGoogle\n. Tyto programy excelují v memorování, ale mají problémy vyfiltrovat během komunikace s lidmi informace z šumu.\n[\n4\n]\nÚspěšné algoritmy\nHry\nRoku 1979 překonal počítač světového mistra ve hře\nvrhcáby\n.\n[\n5\n]\nKrálovská hra\nšachy\nbyla už od počátků informatiky předmětem analýz. Řešení problému bylo od počátku spojováno s inteligencí, avšak výhra nemusí znamenat větší inteligenci. V roce 1997 porazil systém\nDeep Blue\nod firmy\nIBM\núřadujícího mistra světa\nGarriho Kasparova\n. Deep Blue však byl spíše hybridní systém s akcelerátory výpočtů.\n[\n6\n]\nŠlo tak spíše o\nřešení hrubou silou\n. Současná AI již neprochází tolik pozic a přitom je úspěšnější.\n[\n7\n]\nChinook\nje program pro hraní anglické dámy, jehož tvůrci v červenci roku 2007 prohlásili, že nemůže prohrát. Již několik let předtím pravidelně porážel lidské oponenty. Tohoto výsledku bylo dosaženo kombinací hrubé síly při prohledávání pozic ve střední části hry a dobrou databází zahájení a koncovek.\nPočítačové programy hrající\ngo\nsi často tak dobře nevedly. Je tomu tak zřejmě proto, že je\ngoban\n(deska na go) je poměrně rozsáhlá a s každým dalším položeným kamenem stoupá komplexita rozhodování, kterou však mají lidé šanci zvládnout díky své vrozené schopnosti rozpoznávání tvarů. Ovšem nejlepší programy používající jak\nřešení hrubou silou\n(přesněji stromové\nprohledávání do hloubky\n),\n[\n8\n]\ntak intuici, jsou schopné porážet i mistry.\n[\n9\n]\n[\n10\n]\nRubikova kostka\nmůže být také efektivně řešena pomocí AI.\n[\n11\n]\nKaretní hra\nbridž\n.\n[\n12\n]\nDalší algoritmy\nAI dokáže vést letecké souboje lépe než lidští\npiloti\n.\n[\n13\n]\nAI je schopna určit riziko selhání srdce lépe než\nlékař\n.\n[\n14\n]\nAI umožňuje snadno napodobovat lidské\nhlasy\n.\n[\n15\n]\nAI s pomocí senzorů umožňuje odhalovat lhaní či jiné\nemoce\n.\n[\n16\n]\nAI dokáže lépe předpovídat chaos než rovnice.\n[\n17\n]\nAI je lepší i v krátkodobých předpovědích počasí.\n[\n18\n]\nProblematika\nProblémem je, že se AI chová jako\nčerná skříňka\n.\n[\n19\n]\n[\n20\n]\nVolá se proto po vysvětlitelné AI (XAI).\n[\n21\n]\n[\n22\n]\nAI může odstranit lidské\nkognitivní zkreslení\n.\n[\n23\n]\nMůže ovšem zavést vlastní zkreslení.\n[\n24\n]\nLidské i umělé myšlení tedy lze i podvést.\n[\n25\n]\nZáleží na způsobu výběru dat k učení.\n[\n26\n]\nUmělá inteligence tak může být například zpolitizovaná.\n[\n27\n]\nDle studie zveřejněné v časopise\nNature\nmají systémy umělé inteligence tendenci přebírat lidské předsudky a zesilovat je, což může způsobit u uživatelů AI, že budou více předpojatí.\n[\n28\n]\n[\n29\n]\nPokud se AI učí na datech od AI, tak se výsledky zhoršují.\n[\n30\n]\nAI nepozná, co je\npravda\n.\n[\n31\n]\nVe skutečnosti není inteligentní, protože logicky neuvažuje.\n[\n32\n]\nExistují výpočetní problémy, které nelze vyřešit bez ohledu na výpočetní výkon a dobu běhu, které limitují umělou inteligenci.\n[\n33\n]\nProtože technologie mohou být pro člověka nebezpečné, formulovala koncem dubna 2019\nEvropská komise\netické zásady vývoje systémů s umělou inteligencí:\nMožnost řízení a dohledu ze strany člověka\nRobustnost\na bezpečnost\nOchrana soukromí a dat (může vyřešit plně\nhomomorfní šifrování\n)\n[\n34\n]\nTransparentnost\nZákaz diskriminace a rovné zacházení\nSpolečenský a environmentální prospěch\nOdpovědnost.\n[\n35\n]\nEU zvažuje zakázat či omezit umělou inteligenci při identifikaci lidí na veřejnosti.\n[\n36\n]\nOrganizace spojených národů\npřijala roku 2024 rezoluci, která varuje před zneužíváním AI.\n[\n37\n]\nV dubnu 2024 zveřejnila společnost\nTurnitin\nstudii, v níž uvádí, že umělá inteligence vygenerovala již miliony\ndiplomových prací\n.\n[\n38\n]\nAsi 20 %\nvědeckých článků\nbylo podle studie z roku 2025 rovněž alespoň částečně generováno umělou inteligencí, podobně na tom pak byly i samotné recenze těchto článků.\n[\n39\n]\nProblém zákazu diskriminace je v tom, že diskriminace je chování, preference určitých hodnot, kategorií či parametrů, které běžně lidé volí, aniž by si toho byli vědomi. Často je toto diskriminační chování objeveno, až když se na základě dat z takového chování učí umělá inteligence. Tento problém se projevil např. v oddělení lidských zdrojů společnosti\nAmazon\n, jejichž systém vyhodnotil pohlaví jako jeden z výběrových parametrů a životopisy žen hodnotil tak, že jim dával záporné body. To bylo proto, že pro učení byla použita data, která často mapovala technické pozice, na které se častěji hlásili muži.\n[\n40\n]\nExistuje i právní problematika, protože umělá inteligence se učí i na dílech podléhající autorskému právu. V USA tak vyvstává otázka, do jaké míry je to\nfair use\n.\n[\n41\n]\nVelké jazykové modely také pracují s daty poskytnutými uživateli. Některé z nich, například ChatGPT, se snaží touto problematiku deeskalovat pomocí individuálního uživatelského nastavení.\n[\n42\n]\nSpotřeba\nenergie\nje u AI značná.\n[\n43\n]\nPřispívá tak k znečištění životního prostředí exhalacemi při výrobě elektrické energie, čímž se v USA podílí na zdravotních nákladech (rakovina, astma, další nemoci a zameškané pracovní a školní dny) odhadovaných v roce 2030 na 20 miliard dolarů ročně.\n[\n44\n]\nPřehnané spoléhání na umělou inteligenci může vést k erozi\nkritického myšlení\n.\n[\n45\n]\nUmělá inteligence v průmyslu\nV průmyslu může umělá inteligence pomáhat různými způsoby:\n[\n46\n]\nze získaných „syrových“ dat přímo ze zařízení může získávat a vizualizovat podstatné informace pro obsluhu zařízení,\ndetekovat, jak moc se zařízení může rozhodovat automaticky a jak moc potřebuje vstupy od obsluhy,\npredikovat budoucí vývoj, např. selhání pohonu, pokles kvality, na základě čehož je možné plánovat např. údržbu nebo upravit nastavení výroby,\nautomatizovat opakující se úkoly, osvobodit tak zdroje lidí k zaměření se na složitější práci.\n[\n47\n]\nregulátor\nse může naučit vlastnosti regulovaného zařízení a následně může spustit varování, když se v chování zařízení objeví nějaká anomálie.\nUmělá inteligence v kultuře\nIsaac Asimov\nvěnoval značnou část své povídkové tvorby (\nsci-fi\n) tématům robotické inteligence. Jeho povídková sbírka\nJá, robot\n(1950), stejně jako povídka\nDvěstěletý člověk\n(1976), byla zfilmována. Polský autor\nStanisław Lem\nse zabýval filozofickými aspekty inteligence u nelidí ve svých knihách\nSolaris\n(1961, zfilmována dvakrát) a\nKyberiáda\n(1965). Některé aspekty strojové inteligence rozebral Stanisław Lem v knize\nGolem XIV\n(1968) a\nArthur Charles Clarke\nv knize\n2001: Vesmírná odysea\n(1968) kde se zabýval situací, kdy se umělá inteligence obrátí proti člověku, neboť jej vyhodnotí jako překážku k úspěšnému dokončení mise, tj. své nejvyšší priority. Mezi vlivná kultovní díla patří například filmy\nBlade Runner\n(1982),\nTerminátor\n(1984),\nMatrix\n(1999). Velká část publikací současného sci-fi\nkyberpunku\nse váže k prolínání vlastností lidských a strojových a k vyrovnávání se s myšlenkou inteligentního stroje, například v knize\nNeuromancer\nWilliama Gibsona\n.\nProbíhají diskuse o užití umělé inteligence v různých odvětvích kultury. V kinematografii se umělá inteligence propisuje například do využití při omlazování herců, jako například Harrisona Forda v posledním dobrodružství\nIndiana Jonese\n. V českém postředí se jejím využití zabývají například filmaři\nGeorgij Bagdasarov\nnebo\nOndřej Nuslauer\nz\nFAMU\n.\n[\n48\n]\nUmělá inteligence může být kreativnější než 99 % lidské populace.\n[\n49\n]\nAle lidé jejím používáním kreativitu ztrácejí.\n[\n50\n]\nUmělá inteligence a náboženství\nVícerá média si například všimla bohoslužby připravené umělou inteligencí.\n[\n51\n]\n[\n52\n]\n[\n53\n]\nV rámci farářského kursu\nČeskobratrské církve evangelické\nv lednu 2024 se František Štěch věnoval umělé inteligenci jako výzvě pro život církví.\n[\n54\n]\nTeologické fórum křesťanství-islám, konané ve Stuttgartu, se roku 2024 neslo pod titulem „\nVše spočítáno?\n“ – tématem byly výzvy AI obecně,\ntranshumanismus\n, technologie a tělesnost, automatizace, robotizace a umělá inteligence.\n[\n55\n]\nV červnu roku 2024 se v bavorském\nFürthu\nkonala první\nbohoslužba\npřipravená umělou inteligencí, a to v rámci mezinárodního festivalu\nKirchentag\n.\n[\n56\n]\nArcibiskupství pražské\nhostilo v srpnu 2025 panelovou diskusi o AI, kterou připravila\nJednota staroboleslavská\n. Účastnil se i\napoštolský nuncius\nJude Thaddeus Okolo\n.\n[\n57\n]\nRizika AI\nNávrh evropského\nAktu o umělé inteligenci\nrozlišuje tyto kategorie rizik:\n[\n58\n]\nNepřijatelné riziko (hrozba pro člověka),\nVysoké riziko (negativní dopad na bezpečnost nebo základní práva),\nOmezené riziko – požadavky na transparentnost, aby uživatelé mohli činit informovaná rozhodnutí. Do této kategorie bude patřit i generativní umělá inteligence, jako je\nChatGPT\n.\nVíce než dvě třetiny expertů předpokládají více dobré než špatné důsledky AI.\n[\n59\n]\nAnalytici ovšem zvažují i možné katastrofální důsledky zavedení umělé inteligence včetně rizika brzkého zániku lidstva, jak varuje například studie\nAI 2027\nz roku 2025.\n[\n60\n]\nAI boom může potenciálně vést k vzniku\nekonomické bubliny\na následné hospodářské krizi.\n[\n61\n]\nOdkazy\nReference\n↑\nKAPLAN, Andreas.\nArtificial intelligence, business and civilization: our fate made in machines\n. Abingdon, Oxon: Routledge, 2022. 66 s.\nISBN\n9781032155319\n. (anglicky)\n↑\nOne of the Biggest Problems in Regulating AI Is Agreeing on a Definition.\ncarnegieendowment.org\n[online]. [cit. 2024-11-04].\nDostupné online\n.\n↑\nAI or BS? How to tell if a marketing tool really uses artificial intelligence.\nwww.thedrum.com\n[online]. [cit. 2024-11-04].\nDostupné online\n.\n↑\nA simple test reveals: Bot or human?.\ntechxplore.com\n[online].\nDostupné online\n.\n↑\nWALSH, Toby. Know when to fold 'em: AI beats world's top poker players.\ntechxplore.com\n[online]. 2017-01-31 [cit. 2022-12-04].\nDostupné online\n. (anglicky)\n↑\nGREENEMEIER, Larry. 20 Years after Deep Blue: How AI Has Advanced Since Conquering Chess.\nScientific American\n[online]. 2017-06-02 [cit. 2022-12-04].\nDostupné online\n. (anglicky)\n↑\nHOUSER, Pavel. AlphaZero: Obrovský triumf umělé inteligence v šachách.\nsciencemag.cz\n[online]. 2017-12-07 [cit. 2022-12-04].\nDostupné online\n.\n↑\nKASÍK, Pavel; LÁZŇOVSKÝ, Matouš. Bylo to jako hrát proti zdi: umělá inteligence nečekaně porazila mistra.\nhttp://www.idnes.cz\n[online]. 2016-02-01 [cit. 2016-03-13].\nDostupné online\n.\n↑\nROUX, Mariëtte Le. Game over? Computer beats human champ in ancient Chinese game.\nphys.org\n[online]. 2016-01-27 [cit. 2022-12-04].\nDostupné online\n. (anglicky)\n↑\nGame over! Computer wins series against Go champion (Update).\nphys.org\n[online]. 2016-03-12 [cit. 2022-12-04].\nDostupné online\n. (anglicky)\n↑\nUniversity of California. Researchers' deep learning algorithm solves Rubik's Cube faster than any human.\ntechxplore.com\n[online]. 2019-07-15 [cit. 2022-12-04].\nDostupné online\n. (anglicky)\n↑\nUmělá inteligence na turnaji porazila osm mistrů světa v bridži.\nitbiz.cz\n[online]. 2022-03-29 [cit. 2022-12-04].\nDostupné online\n.\n↑\nMIHULKA, Stanislav. Letecká bojová umělá inteligence si natřela na chleba taktické experty.\nosel.cz\n[online]. 2016-06-29 [cit. 2022-12-04].\nDostupné online\n.\n↑\nYIRKA, Bob. AI systems found to be better than doctors at gauging heart attack risk.\nmedicalxpress.com\n[online]. 2017-04-17 [cit. 2022-12-04].\nDostupné online\n. (anglicky)\n↑\nVÍTEK, Jan. Lyrebird umí zkopírovat hlas kohokoliv z minutového záznamu.\nsvethardware.cz\n[online]. 2017-04-25 [cit. 2022-12-04].\nDostupné online\n.\n↑\n'Poker face' stripped away by new-age tech.\nphys.org\n[online]. 2018-04-14 [cit. 2022-12-04].\nDostupné online\n. (anglicky)\n↑\nWOLCHOVER, Natalie. Machine Learning’s ‘Amazing’ Ability to Predict Chaos.\nquantamagazine.org\n[online]. 2018-04-18 [cit. 2022-12-04].\nDostupné online\n. (anglicky)\n↑\nMIHULKA, Stanislav. Umělá inteligence DeepMind skvěle předpovídá počasí.\nosel.cz\n[online]. 2021-10-04 [cit. 2022-12-04].\nDostupné online\n.\n↑\nCASTELVECCHI, Davide. Can we open the black box of AI?. S. 20–23.\nNature\n[online]. 2016-10. Roč. 538, čís. 7623, s. 20–23.\nDostupné online\n.\nISSN\n0028-0836\n.\ndoi\n:\n10.1038/538020a\n. (anglicky)\n↑\nLegal resource center.\nwww.thomsonreuters.com\n[online]. 2025-07-31 [cit. 2025-08-05].\nDostupné online\n. (anglicky)\n↑\nBOULTON, Clint. The hidden risk of blind trust in AI’s ‘black box’.\ncio.com\n[online]. 2017-07-06 [cit. 2022-12-04].\nDostupné online\n. (anglicky)\n↑\nTUREK, Matt.\nExplainable Artificial Intelligence (XAI)\n[online]. darpa.mil [cit. 2022-12-04].\nDostupné online\n. (anglicky)\n↑\nROWLEY, Robert. AI as a way to overcome cognitive bias in physicians.\ncio.com\n[online]. 2017-06-27 [cit. 2022-12-04].\nDostupné online\n. (anglicky)\n↑\nRIGGS, David. 5 unexpected sources of bias in artificial intelligence.\ntechcrunch.com\n[online]. 2016-12-10 [cit. 2022-12-04].\nDostupné online\n. (anglicky)\n↑\nOWANO, Nancy. Fooling the human via changes to images.\ntechxplore.com\n[online]. 2018-03-03 [cit. 2022-12-04].\nDostupné online\n. (anglicky)\n↑\nMassachusetts Institute of Technology. How to make AI less biased.\ntechxplore.com\n[online]. 2018-11-16 [cit. 2022-12-04].\nDostupné online\n. (anglicky)\n↑\nAssessing political bias in language models.\ntechxplore.com\n[online].\nDostupné online\n.\n↑\nGLICKMAN, Moshe; SHAROT, Tali. How human–AI feedback loops alter human perceptual, emotional and social judgements.\nNature Human Behaviour\n. 2024-12-18, s. 1–15.\nDostupné online\n[cit. 2024-12-18].\nISSN\n2397-3374\n.\ndoi\n:\n10.1038/s41562-024-02077-2\n. (anglicky)\n↑\nBias in AI amplifies our own biases, finds study.\ntechxplore.com\n[online]. [cit. 2024-12-18].\nDostupné online\n.\n↑\nBreaking MAD: Generative AI could break the internet.\ntechxplore.com\n[online]. [cit. 2024-07-31].\nDostupné online\n.\n↑\nAI Shouldn’t Decide What’s True.\nnautil.us\n[online]. [cit. 2023-10-29].\nDostupné online\n.\n↑\nApple researchers suggest artificial intelligence is still mostly an illusion.\ntechxplore.com\n[online]. [cit. 2024-10-16].\nDostupné online\n.\n↑\nUniversity of Cambridge. Mathematical paradoxes demonstrate the limits of AI.\ntechxplore.com\n[online]. 2022-03-17 [cit. 2022-12-04].\nDostupné online\n. (anglicky)\n↑\nEncryption breakthrough lays groundwork for privacy-preserving AI models.\ntechxplore.com\n[online]. [cit. 2025-03-27].\nDostupné online\n.\n↑\nČERNÝ, Michal. Potřebujeme pravidla pro vývoj umělé inteligence?.\nroot.cz\n[online]. 31. 5. 2019.\nDostupné online\n.\nISSN\n1212-8309\n.\n↑\nEU data watchdogs want ban on AI facial recognition.\ntechxplore.com\n[online]. 2021-06-21 [cit. 2022-12-04].\nDostupné online\n. (anglicky)\n↑\nValné shromáždění OSN jednomyslně přijalo první globální rezoluci o AI.\nwww.itbiz.cz\n[online]. [cit. 2024-03-24].\nDostupné online\n.\n↑\nKARLÍK, Tomáš. Umělé inteligence už napsaly miliony diplomových prací, univerzity hledají řešení.\nČT24\n[online].\nČeská televize\n[cit. 2024-04-11].\nDostupné online\n.\n↑\nKARLÍK, Tomáš. Někteří vědci „hackují“ AI pro lepší recenze studií.\nČT24\n[online].\nČeská televize\n[cit. 2025-07-16].\nDostupné online\n.\n↑\nČERNÝ, Michal. Chceme nediskriminující umělou inteligenci, ale sami to neumíme.\nroot.cz\n[online]. 26. 7. 2019.\nDostupné online\n.\nISSN\n1212-8309\n.\n↑\nUmělá inteligence skládá, kreslí a opisuje. A žaloby se blíží | Týdeník Hrot.\nHrot\n[online]. [cit. 2025-08-05].\nDostupné v archivu\npořízeném dne 2023-12-08.\n↑\nMemory and new controls for ChatGPT.\nChatGPT - Release Notes\n[online]. 2024-02-13 [cit. 2024-03-04].\nDostupné online\n.\n↑\nPowering AI could use as much electricity as a small country.\ntechxplore.com\n[online]. [cit. 2023-10-10].\nDostupné online\n.\n↑\nAI's power demands driving toxic air pollution, study finds.\nphys.org\n[online]. [cit. 2024-12-11].\nDostupné online\n.\n↑\nIncreased AI use linked to eroding critical thinking skills.\nphys.org\n[online]. [cit. 2025-01-13].\nDostupné online\n.\n↑\nPERKON, Dave. Artificial intelligence is smarter than you think.\nControl Design\n[online]. Jun 10, 2018.\nDostupné online\n.\n↑\nVyužití umělé intelligence: Hra ve velkém pro firmy.\nalgomyst.cz\n[online]. [cit. 2024-01-27].\nDostupné online\n.\n↑\nUmělá inteligence promění kinematografii. Bude ale větší poptávka po originalitě, myslí si filmový tvůrce.\niROZHLAS\n[online].\nČeský rozhlas\n, 2023-04-09 [cit. 2023-06-29].\nDostupné online\n.\n↑\nChatGPT scores in the top 1% for original creative thinking.\nstudyfinds.org\n[online]. [cit. 2023-09-13].\nDostupné online\n.\n↑\nStudy explores the impact of LLMs on human creativity.\ntechxplore.com\n[online]. [cit. 2024-10-30].\nDostupné online\n.\n↑\nSCHLICHTSOVÁ, Jitka.\nV Bavorsku se konala první bohoslužba připravená umělou inteligencí\n[online]. 2023-06-14 [cit. 2025-08-05].\nDostupné online\n.\n↑\nBohoslužba vedená umělou inteligencí přilákala stovky věřících\n[online]. [cit. 2025-08-05].\nDostupné online\n.\n↑\nEDWARDS, Benj. AI-powered church service in Germany draws a large crowd.\nArs Technica\n[online]. 2023-06-12 [cit. 2025-08-05].\nDostupné online\n. (anglicky)\n↑\nAnotace a medailonky\n[online]. 2024-01-26 [cit. 2025-08-05].\nDostupné online\n.\n↑\nKLAPETEK, Martin.\nTématem Teologického fóra křesťanství-islám 2024 ve Stuttgartu byla umělá inteligence\n[online]. 2024-03-06 [cit. 2025-08-05].\nDostupné online\n.\n↑\nSCHLICHTSOVÁ, Jitka.\nV Bavorsku se konala první bohoslužba připravená umělou inteligencí\n[online]. 2023-06-14 [cit. 2025-08-05].\nDostupné online\n.\n↑\nMRÁZEK, Benedikt.\nVíra v době robotů\n[online]. 2025-08-05 [cit. 2025-08-05].\nDostupné online\n.\n↑\nAkt EU o umělé inteligenci: První nařízení o AI na světe\n, červen 2023\n↑\nThe future of AI could be great—or catastrophic.\ntechxplore.com\n[online]. [cit. 2024-01-31].\nDostupné online\n.\n↑\nVyhladí lidstvo umělá inteligence? „Málo pravděpodobné, ale ne úplné sci-fi,“ obává se Koubský.\nPlus\n[online]. 2025-04-11 [cit. 2025-10-02].\nDostupné online\n.\n↑\nToday’s AI hype has echoes of a devastating technology boom and bust 100 years ago.\ntheconversation.com\n[online]. [cit. 2025-10-08].\nDostupné online\n.\nLiteratura\nZelinka Ivan: Umělá inteligence v problémech globální optimalizace\nBEN – technická literatura\n, 2002,\nISBN\n80-7300-069-5\nPlšek Bořivoj: Umělá inteligence v modelování a řízení\nBEN – technická literatura\n, 1996,\nISBN\n80-901984-4-9\nZelinka Ivan: Umělá inteligence – hrozba nebo naděje?\nBEN – technická literatura\n, 2003,\nISBN\n80-7300-068-7\nHammer Miloš: Metody umělé inteligence v diagnostice elektrických spojů,\nBEN – technická literatura\n, 2009,\nISBN\n978-80-7300-231-2\nVladimír Mařík, Olga Štěpánková, Jiří Lažanský: Umělá inteligence 1–5,\nAcademia\nKŘIVAN, Miloš.\nUmělé neuronové sítě\n. [s.l.]: Nakladatelství Oeconomica, Vysoká škola ekonomická v Praze. 77 s.\nDostupné online\n.\nISBN\n978-80-245-2420-7\n.\nČERNOCH, Viktor. Svérázná říše umělé inteligence. V textu citováni a představeni David Černý, Jiří Wiedermann, František Hakl, Tomáš Hříbek.\nA / Magazín\n.  Praha: Středisko společných činností AV ČR, 2023-09-14, roč. 7, čís. 3, s. 18-31. Rubrika Téma.\nISSN\n2788-2918\n.\nSouvisející články\nKvantový počítač\nUmělá inteligence ve videohrách\nFilozofie umělé inteligence\nHybridní inteligence\nInteligentní prostředí\nObecná umělá inteligence\nMoravcův paradox\nBlue Brain Project\nISO/IEC JTC 1/SC 42\nGrokipedia\nExterní odkazy\nObrázky, zvuky či videa k tématu\numělá inteligence\nna Wikimedia Commons\nTéma\nUmělá inteligence\nve Wikicitátech\nKniha\nUmělá inteligence: Zpracování informace lidským intelektem a počítačem\nve Wikiknihách\nUmělá inteligence\nv\nČeské terminologické databázi knihovnictví a informační vědy (TDKIV)\nOficiální web\nČeské asociace umělé inteligence\nDwarkesh Podcast věnovaný AI (anglicky)\nTransformer, novinky ze světa AI (anglicky)\nDon't Worry About the Vase, substack věnovaný AI (anglicky)\nCitováno z „\nhttps://cs.wikipedia.org/w/index.php?title=Umělá_inteligence&oldid=25392769\n“"}
{"docID": 1, "source": "https://cs.wikipedia.org/wiki/Strojov%C3%A9_u%C4%8Den%C3%AD", "text": "title: strojové učení\nurl: https://cs.wikipedia.org/wiki/Strojov%C3%A9_u%C4%8Den%C3%AD\ntext: Tento článek potřebuje úpravy.\nMůžete Wikipedii pomoci tím, že ho\nvylepšíte\n. Jak by měly články vypadat, popisují stránky\nVzhled a styl\n,\nEncyklopedický styl\na\nOdkazy\n.\nKonkrétní problémy:\nnedostatečně ozdrojováno; heslovité sekce převést na souvislejší text, případně i dokončit\nStrojové učení\nje podoblastí\numělé inteligence\n, zabývající se\nalgoritmy\na technikami, které umožňují počítačovému systému „učit se“. Učením v daném kontextu rozumíme takovou změnu vnitřního stavu systému, která zefektivní schopnost přizpůsobení se změnám okolního prostředí.\nStrojové učení má široké uplatnění. Jeho techniky se využívají pro rozpoznávání obrazů (např. ve formě\npixelů\n) či\nakustických\n(např.\nrozpoznávání řeči\n) nebo elektrických (např.\nEKG\n,\nEEG\n)\nsignálů\n, dále ke\nklasifikaci\n,\nsegmentaci\nči\nkompresi\ndat, k předvídání vývoje časových řad (např.\nburzovních indexů\n), k\nanalýze psaného textu\nči k\nfiltrování\nspamu\n. V lékařství slouží k diagnostice onemocnění a v řízení\npro podporu rozhodování\n.\nZákladní rozdělení algoritmů učení\nAlgoritmy\nstrojového učení lze podle způsobu učení rozdělit do následujících kategorií:\nUčení s učitelem\n(„supervised learning“) – pro vstupní data je určen správný výstup (třída pro klasifikaci nebo hodnota pro regresi).\nUčení bez učitele\n(„unsupervised learning“) – ke vstupním datům není známý výstup.\nKombinace učení s učitelem a bez učitele („semi-supervised learning“) – část vstupních dat je se známým výstupem, ale další data, typicky větší, jsou bez něj.\nZpětnovazebné učení\n(„reinforcement learning“), též\nučení posilováním\n.\nPodle způsobu zpracování lze algoritmy rozdělit na:\ndávkové: Všechna data se požadují před začátkem výpočtu.\ninkrementální: Dokážou se „přiučit“, tj. upravit model, pokud dostanou nová data, bez přepočítání celého modelu od začátku.\nZákladní druhy úloh\nKlasifikace\nrozděluje data do dvou nebo několika tříd (\nučení s učitelem\n)\nRegrese\nodhaduje číselné hodnoty výstupu podle vstupu (\nučení s učitelem\n)\nShlukování\nzařazuje objekty do skupin s podobnými vlastnostmi (\nučení bez učitele\n)\nDalší typy úloh jsou:\nRanking\nurčuje pořadí datových bodů, výsledkem je částečné nebo úplné setřídění\nUčení strukturovaných dat. Výstupní neboli hledaná struktura může být například sekvence, strom, graf, matice…\nAplikace jsou např. učení\nsyntaktických stromů\nve\nzpracování přirozeného jazyka\n, zarovnání několika\nsekvencí\nproteinů v\nbioinformatice\n, převod\nřeči na textový\nřetězec, tj. na\nsekvenci\nznaků, hledání vhodné molekuly reprezentované jako\ngraf\nv\nchemoinformatice\n, výstup\nzpracování obrazu\njako\nmatice\n…\nPodoblasti strojového učení\nPoužívané modely:\nRozhodovací stromy\nAlgoritmus k-nejbližších sousedů\nPodpůrné vektory, viz\nSupport vector machines\nLineární diskriminační analýza\n(\nen:Linear discriminant analysis\n)\nKvadratická diskriminační analýza\n(\nen:Quadratic discriminant analysis\n)\nNeuronové sítě\n,\nučení s učitelem\n,\nučení bez učitele\n,\nhluboké učení\nBayesovské sítě\nTechniky pro kombinaci více modelů (\nen:Meta learning\n)\nBoosting\nStacking\nBootstrap (Bagging)\nTestování přesnosti modelu:\nKřížová validace\nDiskriminační analýza\nBootstrap (Statistics)\nTerminologie\nData, body, případy, měření\nAtributy, rysy, proměnné, fíčury/features\nDruhy/typy atributů\n: kategoriální (např. „A“, „B“, „AB“ nebo „O“ pro krevní skupiny), ordinální (např. „velký“, „střední“ nebo „malý“), strukturované, hierarchické, binární, celočíselné (např. počet výskytů slova v emailu) anebo reálné (např. měření krevního tlaku)\nSoftware\nRapidMiner\n,\nKNIME\n,\nWeka\n,\nODM\n,\nShogun Toolbox\n,\nOrange\n,\nApache Mahout\na\nScikit-Learn\njsou softwarové balíky, které obsahují různé algoritmy strojového učení.\nOnline: Microsoft Azure Machine Learning (Azure ML), TensorFlow (Google)\nHardware\nOptimální hardwarová implementace provádění výpočtů umožňuje značně urychlit nalezení výsledku. Používají se různé způsoby:\nTensor Processing Unit\n(TPU)\n[\n1\n]\nod\nGoogle\njsou specializované integrované obvody ve formě čipů implementovaných v zařízení TPU (An application-specific integrated circuit (ASIC)), který optimalizuje výpočetní výkon strojového učení.\nGraphics Processing Unit\n(GPU) je systém procesorů implementovaných na grafické kartě, původně určený především pro běh počítačových her, kladoucích velké nároky na výpočetní výkon. Na rozdíl od\nCPU\nmajících k dispozici maximálně 8 nebo 16 výpočetních vláken, GPU jich může využívat až např. 2 048. Pro algoritmizaci učení se pak může užít tzv.\nCUDA\nplatforma, umožňující programovat v jazycích\nC++\nresp.\nFortran\n, která umožní díky velkému počtu dostupných výpočetních vláken vysoký stupeň\nparalelizace\nvýpočtu, čímž zvýší výpočetní výkon strojového učení.\nReference\n↑\nGoogle developers:\nMachine Learning Glossary\nSouvisející články\nData mining\nExterní odkazy\nObrázky, zvuky či videa k tématu\nstrojové učení\nna Wikimedia Commons\nCitováno z „\nhttps://cs.wikipedia.org/w/index.php?title=Strojové_učení&oldid=25304418\n“"}
{"docID": 2, "source": "https://cs.wikipedia.org/wiki/Algoritmus", "text": "title: algoritmus\nurl: https://cs.wikipedia.org/wiki/Algoritmus\ntext: Algoritmus\nje přesný návod či postup, kterým lze vyřešit daný typ úlohy. Pojem algoritmus se nejčastěji objevuje při\nprogramování\n, kdy se jím myslí teoretický princip řešení problému (oproti přesnému zápisu v konkrétním\nprogramovacím jazyce\n). Obecně se ale algoritmus může objevit v jakémkoli jiném vědeckém odvětví. Jako jistý druh algoritmu se může chápat i např. kuchařský recept. Zpravidla však na algoritmy klademe určitá omezení.\nVlastnosti algoritmů\nV užším smyslu se slovem algoritmus označují takové postupy, které splňují některé silnější požadavky:\nElementárnost\nAlgoritmus se skládá z konečného počtu jednoduchých (elementárních) kroků.\nKonečnost\n(finitnost)\nKaždý algoritmus musí skončit v\nkonečném\npočtu kroků. Tento počet kroků může být libovolně velký (podle rozsahu a hodnot vstupních údajů), ale pro každý jednotlivý vstup musí být konečný. Postupy, které tuto podmínku nesplňují, se mohou nazývat\nvýpočetní metody\n. Speciálním příkladem nekonečné výpočetní metody je\nreaktivní proces\n, který průběžně reaguje s okolním prostředím. Někteří autoři však mezi algoritmy zahrnují i takovéto postupy.\nObecnost (hromadnost, masovost, univerzálnost)\nAlgoritmus neřeší jeden konkrétní problém (např. „jak spočítat 3×7“), ale obecnou třídu obdobných problémů (např. „jak spočítat součin dvou celých čísel“), má širokou množinu možných vstupů.\nDeterminovanost\nAlgoritmus je determinovaný, pokud za stejných podmínek (pro stejné vstupy) poskytuje stejný výstup. Tato vlastnost je požadována u velké části úloh; existují však úlohy, kdy je naopak vyžadována náhodnost (například simulace\nvrhu kostkou\n,\nmíchání karet\n, generování\nhesel\na\nšifrovacích klíčů\n); na standardních počítačích je dosažení náhodnosti\nobtížné\n. Pravděpodobnostní algoritmy v sobě mají zahrnutu náhodu a nemusí být determinované.\nDeterminismus\nKaždý krok algoritmu musí být\njednoznačně\na\npřesně\ndefinován; v každé situaci musí být naprosto zřejmé, co a jak se má provést, jak má provádění algoritmu pokračovat. Protože\npřirozené jazyky\nneposkytují naprostou přesnost a jednoznačnost vyjadřování, byly pro zápis algoritmů navrženy\nprogramovací jazyky\n, ve kterých má každý příkaz jasně definovaný význam. Vyjádření výpočetní metody v programovacím jazyce se nazývá\nprogram\n. Některé algoritmy jsou sice determinované, ale nejsou deterministické (například řadící algoritmus\nrychlé řazení\ns náhodnou volbou pivota).\nVýstup\nAlgoritmus má alespoň jeden\nvýstup\n, veličinu, která je v požadovaném vztahu k zadaným vstupům, a tím tvoří odpověď na problém, který algoritmus řeší (algoritmus vede od zpracování hodnot k výstupu)\nV praxi jsou proto předmětem zájmu hlavně takové algoritmy, které jsou v nějakém smyslu\nkvalitní\n. Takové algoritmy splňují různá kritéria, měřená např. počtem kroků potřebných pro běh algoritmu, jednoduchost, efektivitu či eleganci. Problematikou efektivity algoritmů, tzn. metodami, jak z několika známých algoritmů řešících konkrétní problém vybrat ten vhodný, se zabývají odvětví\ninformatiky\nnazývané algoritmická analýza a\nteorie složitosti\n.\nMetody návrhu\nAlgoritmus se navrhuje několika možnými způsoby:\nShora dolů\n– postup řešení rozkládáme na jednodušší operace, až dospějeme k elementárním krokům.\nZdola nahoru\n– z elementárních kroků vytváříme prostředky, které nakonec umožní zvládnout požadovaný problém.\nKombinace obou\n– obvyklý postup shora dolů doplníme \"částečným krokem\" zdola nahoru tím, že se například použijí knihovny funkcí, vyšší programovací jazyk nebo systém pro vytváření programů (\nCASE\n).\nParadigmata návrhu algoritmů\nPři návrhu algoritmů se uplatňuje množství přístupů, které abstrahují od konkrétní úlohy. K nejužívanější metodám návrhu algoritmů patří:\nRozděl a panuj\nSouvisející informace naleznete také v článku\nRozděl a panuj (algoritmus)\n.\nKlasický případ aplikace postupu odshora dolů. Algoritmy typu rozděl a panuj dělí problém na menší podproblémy, na něž se\nrekurzivně\naplikují (až po triviální podproblémy, které lze vyřešit přímo), po čemž se dílčí řešení vhodným způsobem sloučí.\nZpracovává se\nmnožina\nV\nsložená z\nn\núdajů. Tato množina se rozdělí na\nk\ndisjunktních\npodmnožin\n, které se zpracují každá zvlášť. Získané dílčí výsledky se pak spojí a odvodí se z nich řešení pro celou množinu\nV\n.\nKlasickým případem je\nbinární vyhledávání\nnebo řadící algoritmus\nrychlé řazení\n.\nHladový algoritmus\nSouvisející informace naleznete také v článku\nHladový algoritmus\n.\nVelice přímočarý přístup k řešení určité třídy\noptimalizačních úloh\n.\nZpracovává se množina\nV\nsložená z\nn\núdajů. Úkolem je najít podmnožinu\nW\nmnožiny\nV\n, která vyhovuje určitým podmínkám a přitom optimalizuje předepsanou\núčelovou funkci\n. Jakákoliv množina\nW\n, vyhovující daným podmínkám, se nazývá\npřípustné řešení\n. Přípustné řešení, pro které nabývá účelová funkce optimální hodnoty, se nazývá\noptimální řešení\n.\nHladový algoritmus se skládá z kroků, které budou procházet jednotlivé prvky z\nV\n, a v každém kroku rozhodne, zda se daný prvek hodí do optimálního řešení. Prvky\nV\nbude vybírat v pořadí určeném jistou výběrovou procedurou. Výběrová procedura bude založená na nějaké optimalizační míře – funkci, která může být odvozena od účelové funkce. V každém kroku ale musíme dostat přípustné řešení. Jakmile je učiněno takové rozhodnutí, už není dále revidováno.\nPříkladem je třeba hledání nejkratší\ncesty grafu\n.\nDynamické programování\nSouvisející informace naleznete také v článku\nDynamické programování\n.\nDynamické programování se používá v případech kdy lze optimální řešení složit z řešení jednodušších problémů. Protože se požadavky na řešení jednodušších podproblémů mohou mnohokrát opakovat, je nutné zvolit správné pořadí jejich řešení a výsledky si zapamatovat pro opakované použití.\nOpírá se o\nprincip optimality\n:\nOptimální posloupnost rozhodnutí má tu vlastnost, že ať je počáteční stav a rozhodnutí jakékoliv, musí být všechna následující rozhodnutí optimální vzhledem k výsledkům rozhodnutí prvního.\nTypickým příkladem využití dynamického programování jsou\ngrafové\núlohy a jejich příslušné grafové algoritmy.\nPoužití hrubé síly\nU některých úloh nezbývá než postupně probírat všechna možná řešení – tak zvaná\nmetoda hrubé síly\n– vygenerují se všechny možné posloupnosti a pak se vybere ta nejlepší. V některých případech lze použít metody, které vynechávají popřípadě odkládají procházení možností, které zřejmě nejsou optimální.\nHledání s návratem (backtracking)\nSouvisející informace naleznete také v článku\nBacktracking\n.\nHledání s návratem založené na prohledávání\nstavového prostoru\nproblému. Též se nazývá metoda pokusů a oprav, metoda zpětného sledování, metoda\nprohledávání do hloubky\n.\nMetodu je možné použít v případě, že řešením je\nvektor\n(\nx\n1\n,...,x\nn\n), jehož jednotlivé složky vybíráme z množiny\nS\ni\n,\nx\ni\n∈\nS\ni\n. Zpravidla je třeba najít\nn-tici\n, která optimalizuje nějakou účelovou funkci\nP(x\n1\n,...,x\nn\n)\n. Mohou se ale také hledat všechny n-tice, které tuto podmínku splňují. Metoda vytváří n-tice jednu složku po druhé. Přitom používá účelovou funkci (nebo nějakou vhodnou pomocnou funkci) a pro každou nově vytvořenou složku testuje, zda by taková n-tice vůbec mohla být optimální nebo splňovat dané podmínky. Jestliže pro nějaké\nx\ni\nžádaný vektor (\nx\n1\n,...,x\ni\n) nemůže být optimální, není třeba už žádný takový vektor testovat a vezmeme další možnou hodnotu i-té složky. Pokud jsou vyčerpány všechny hodnoty i-té složky, vrátí se metoda zpět o jeden krok a zkouší další možnou hodnotu\nx\ni-1\n.\nPříkladem je třeba\nproblém osmi dam\nnebo\nchůze koně celou šachovnicí\n.\nAlgoritmická složitost\nJe třeba poznamenat, že abstraktní kritérium\nkonečnosti\nje pro praktické použití ještě příliš slabé. V praxi je třeba zajistit, aby algoritmus skončil „v rozumném“ čase. Za rozumný čas lze v praxi považovat takový čas, který nám umožní smysluplně využít výsledek.\nNapř. existuje jednoduchý algoritmus, který dokáže určit, zda v dané\nšachové\npozici může hráč na tahu vynutit vítězství a zároveň dokáže určit nejlepší možný tah. Tento algoritmus se však nedá použít, protože by na svou činnost potřeboval ohromné množství času, jakkoli je toto množství konečné. Mimoto by takový algoritmus spotřeboval ohromné množství paměti, což je další praktický zřetel, který se uplatňuje při volbě algoritmu. I když průměrná počítačová paměť stále narůstá, pro některé algoritmy jí nebude nikdy dost.\nPro vyčíslení\nvýpočetní složitosti algoritmů\nv závislosti na velikosti vstupních dat se používá\nasymptotický\nzápis závislosti výpočetního času na rozsahu úlohy (typicky na počtu vstupních údajů). Například\nO(log N)\nznamená, že počet kroků algoritmu závisí logaritmicky na velikosti vstupních dat. Pokud u takového algoritmu zdvojnásobíme rozsah vstupních údajů, doba výpočtu se zvýší o jednu jednotku času, pokud bude vstupních dat čtyřikrát více, doba výpočtu se prodlouží o dvě jednotky času, a tak dále. To je třeba případ nalezení jednoho prvku o určité hodnotě v seznamu prvků seřazeném podle hodnoty (např. nalezení jména v telefonním seznamu).\nDruhy algoritmů\nAlgoritmy můžeme klasifikovat různými způsoby. Mezi důležité druhy algoritmů patří:\nRekurzivní\nalgoritmy, které využívají (volají) samy sebe.\nPravděpodobnostní algoritmus\n(někdy též\nprobabilistické\n) provádí některá rozhodnutí náhodně či\npseudonáhodně\n.\nV případě, že máme k dispozici více počítačů, můžeme úlohu mezi ně rozdělit, což nám umožní ji vyřešit rychleji; tomuto cíli se věnují\nparalelní algoritmy\n.\nGenetický algoritmus\npracuje na základě napodobování biologických\nevolučních\nprocesů, postupným „pěstováním“ nejlepších řešení pomocí\nmutací\na\nkřížení\n. V\ngenetickém programování\nse tento postup aplikuje přímo na algoritmy (resp. programy), které jsou zde chápány jako možná řešení daného problému.\nHeuristický algoritmus\nsi za cíl neklade nalézt přesné řešení, ale pouze nějaké vhodné přiblížení; používá se v situacích, kdy dostupné zdroje (např. čas) nepostačují na využití exaktních algoritmů (nebo pokud nejsou žádné vhodné exaktní algoritmy vůbec známy).\nPřitom jeden algoritmus může patřit zároveň do více skupin; například může být zároveň rekurzivní a genetický.\nNěkteré známé algoritmy\nEratosthenovo síto\nEuklidův algoritmus\nAlgoritmus de Casteljau\nDijkstrův algoritmus\nBellmanův–Fordův algoritmus\nEtymologie\nSlovo algoritmus pochází ze jména významného\nperského\nmatematika\nžijícího v první polovině\n9. století\n(cca\n780\n–\n840\n), kterým byl\nAbū ʻAbd Allāh Muhammad ibn Mūsā al-Chwārizmī\n(\nأبو عبد الله محمد بن موسى الخوارزمي\n‎) (doslova „Otec Abdulláha, Mohamed, syn Mojžíšův, pocházející z města Chwārizm (Chórézm, dnes\nChiva\n)“; tento kraj se nachází v\nUzbekistánu\njižně od\nAralského jezera\n). Tento učenec ve svém díle prakticky vytvořil systém\narabských číslic\na základy algebry (konkrétně metody řešení\nlineárních\na\nkvadratických\nrovnic\n), jejíž název pochází přímo z titulu tohoto díla (\nKitūb al-jabr waāl-muqūbala\n). Jeho jméno bylo do\nlatiny\npřevedeno jako\nalgorismus\n, a původně znamenalo „provádění aritmetiky pomocí arabských číslic“; abacisté počítali pomocí\nabaku\n, algoristé pomocí algorismů.\nPostupem času se kvůli neznalosti původu slova jeho podoba měnila, záměnou arabského kořene s kořenem\nřeckého\nslova αριθμός (arithmos) se z algorismu stal algorithmus. (Později bylo v některých jazycích včetně češtiny\nth\nzměněno na\nt\n, v\nkatalánštině\nse vrátilo\ns\n.) Toto slovo se používalo jako označení různých matematických postupů, např. v\n18. století\noznačoval\nlatinský\ntermín\nalgorithmus infitesimalis\n„metodu výpočtů s využitím nekonečně malých veličin, vynalezenou německým matematikem\nLeibnizem\n“. Slovo\nalgoritmus\nv dnešním významu se používá až zhruba od\n20. století\n.\nHistorie: Vývoj pojmu „algoritmus“\nStarověké Řecko\nAlgoritmy byly použity ve starověkém Řecku. Například Eratosthenovo síto nebo Eukleidův algoritmus.\nPůvod\nSlovo algoritmus pochází z 9. století a je odvozeno z příjmení perského matematika\nAl-Chorezmí\n. Slovo původně odkazovalo na pravidla provádění aritmetických operací s arabskými číslicemi, ale vyvinulo se prostřednictvím překladu matematikova jména na „algoritmus“ v 18. století a zahrnuje všechny určité postupy pro řešení problémů nebo plnění úkolů.\nDiskrétní a rozeznatelné symboly\nTally-značky\n: K počítání stád, pytlů s obilím a peněz ve starověku se používaly akumulační kameny, značky vyškrábané na holích nebo záznam jednotlivých symbolů v jílu. Značky jsou obvykle v\njedničkové soustavě\n, která se používá při kódování informací pro\nTuringovy stroje\nv\nteorii automatů\n.\nMechanická zařízení s diskrétními stavy\nHodiny\n: Podle Boltera je vynález mechanických hodin jedním z klíčových vynálezů. Zejména pak jejich setrvačná část –\nLihýř\n. Přesný automat vedl okamžitě k mechanickému automatu (začátek 13. století) a nakonec k výpočetním strojům – diferenční a\nanalytický stroj\n(\nCharles Babbage\na\nAda Lovelace\n) v polovině\n19. století\n. Lovelace je připočítáno první vytvoření algoritmu, který je zpracovatelný počítačem. Babbageův analytický stroj je považován za první Turingův kompletní počítač. Charles Babbage je někdy nazýván jako historicky první programátor.\nLogické stroje 1870\n–\nJevonsovo\nlogické počítadlo a logický stroj: Technický problém byl zjednodušení logických rovnice, které bylo představeno v podobě podobné tomu, co je nyní známo jako\nKarnaughova mapa\n. Jevons (1880) popisuje první jednoduché počítadlo ze dřeva vybavené kolíky tak, aby jakákoli jeho třída kombinací šla vyzvednout mechanicky. Tento stroj je představen členům královské společnosti v roce 1870.\nTkalcovský stav\n,\nděrné štítky\n,\ntelegrafie\na\ntelefonie\n– elektromechanické relé: Bell a Newell (1971) označují, že tkalcovský stav (1801), předchůdce děrných štítků (1887) a telefonní spínací technologie vedly k vývoji prvních počítačů. V polovině 19. století telegraf, předchůdce telefonu, byl v provozu po celém světě. V roce 1910 se objevil\ndálnopis\n, který využíval mezinárodní telegrafní abecedu.\nTelefonní sítě elektromechanických relé\n– George Stibitz (1937) pracoval v Bellových laboratořích a dokončil kalkulátor, který je schopen pracovat s komplexními čísly.\nMatematika v průběhu 19. století až do poloviny 20. století\nSymboly a pravidla\n: V rychlém sledu za sebou matematika George Boole,\nGottlob Frege\na\nGiuseppe Peano\nredukovala aritmetiku do sekvence symbolů, se kterými se manipulovalo pomocí daných pravidel. Peanovo\nThe principles of arithmetic, presented by a new method\n(1888) byl první pokus o axiomatizování matematiky v symbolický jazyk.\nHeijenoort dává Fregemu (1879) tuto slávu: Fregovo dílo je možná nejdůležitější práce, která kdy bylo v logice napsána. Tato práce byla dále zjednodušena a umocněna\nAlfredem North Whiteheadem\na\nBertrandem Russellem\nv jejich Principia Mathematica (1910–1913).\nParadoxy\n: Ve stejné době se objevila řada znepokojivých elementů v literatuře, zejména\nBurali-Fortiho paradox\n(1897),\nRussellův paradox\n(1902–1903) a Richardův paradox. Výsledné úvahy vedly k\nGödelovým větám o neúplnosti\n.\nEfektivní vyčíslitelnost\n: Ve snaze vyřešit\nEntscheidungsproblem\npřesně definovaným\nHilbertem\nv roce 1928 museli matematici nejprve definovat, co se rozumí pod pojmem „efektivní metoda“ nebo „efektivní výpočet“. V rychlém sledu se objevili\nAlonzo Church\n,\nStephen Cole Kleene\na J. B. Rosser, kteří jsou známí především díky\nlambda kalkulu\n. Church pak společně s\nTuringem\nukázal, že lambda kalkul (a další výpočetní modely) má výpočetní sílu\nTuringova stroje\n, což otevřelo cestu k\nChurchově–Turingově tezi\n.\nPrávní ustanovení\nAlgoritmy nejsou obvykle patentovány. Samotná manipulace s abstraktními pojmy, čísly, či dokonce signály není v USA (dle USPTO 2006) považována za proces. Jinými slovy lze říci, že algoritmy nelze patentovat (podobně jako v kauze\nGottschalk v. Benson\n). Nicméně některá praktická využití algoritmů lze patentovat. Například v kauze\nDiamond v. Diehr\nbyl patentován jednoduchý algoritmus\nzpětné vazby\nna pomoc při vytvrzování syntetické gumy. Patentování\nsoftwaru\nje i přes to velmi kontroverzní. Některé patentované algoritmy se potýkají s negativní kritikou, a to především algoritmy sloužící ke\nkompresi dat.\nReference\nheslo\nAlgorithmus\n.\nOttův slovník naučný\nI, p. 857\nDonald Ervin Knuth\n:\nThe Art of Computer Programming\n, Vol 1–3, Addison Wesley 1998.\nISBN\n0-201-48541-9\n. Klasické dílo oboru, definitivní příručka.\nGaston H. Gonnet, Ricardo Baeza-Yates: Zdrojové texty programů v\nHandbook of Algorithms and Data Structures.\nDictionary of Algorithms and Data Structures\n. „Slovník algoritmů, technik, datových struktur, typických problémů a příslušných definic.“\nUnited States Patent and Trademark Office\n(2006),\n2106.02 **>Mathematical Algorithms: 2100 Patentability\n, Manual of Patent Examining Procedure (MPEP). Latest revision August 2006\nExterní odkazy\nObrázky, zvuky či videa k tématu\nalgoritmus\nna Wikimedia Commons\nTéma\nAlgoritmus\nve Wikicitátech\nSlovníkové heslo\nalgoritmus\nve Wikislovníku\nPrvní algoritmus napsala žena. Programovala dávno před prvním počítačem\nCitováno z „\nhttps://cs.wikipedia.org/w/index.php?title=Algoritmus&oldid=24926977\n“"}
{"docID": 3, "source": "https://cs.wikipedia.org/wiki/Obecn%C3%A1_um%C4%9Bl%C3%A1_inteligence", "text": "title: obecná umělá inteligence\nurl: https://cs.wikipedia.org/wiki/Obecn%C3%A1_um%C4%9Bl%C3%A1_inteligence\ntext: Obecná umělá inteligence\n(\nanglicky\nartificial general intelligence\n– zkráceně\nAGI\n) je typ\numělé inteligence\n(AI), která má za cíl replikovat kognitivní schopnosti člověka. Na rozdíl od úzce zaměřené AI, která je navržena pro konkrétní úkoly, má obecná AI schopnost chápat, učit se a aplikovat znalosti v širokém spektru úkolů na úrovni srovnatelné s lidskou inteligencí. Obecná AI se dokáže přizpůsobit novým situacím, řešit neznámé problémy a vykonávat různé intelektuální úkoly.\n[\n1\n]\nPo obecné umělé inteligenci může následovat tzv. umělá\nsuperinteligence\n(ASI).\nAGI by měla umět zvládat různorodé úkoly napříč spektrem: umět hrát hry, psát příběhy, řešit matematické úlohy, rozpoznávat obličeje, chápat emoce a učit se novým věcem. AGI se liší od\numělé inteligence\n(AI), která umí velmi dobře pouze jednu konkrétní věc, jako je hraní šachů nebo překládání jazyků. Jedná se tak o tzv. silnější AI, která poznává svět kolem sebe a učí se sama. O vybudování AGI se snaží například\nOpenAI\n[\n2\n]\nči\nDeepMind\nod Google.\n[\n3\n]\nGenerální ředitel společnosti\nNVIDIA\nJensen Huang\nv březnu 2024 uvedl, že obecná umělá inteligence může začít existovat již do pěti let.\n[\n4\n]\nOdkazy\nReference\n↑\nSHEVLIN, Henry; VOLD, Karina; CROSBY, Matthew. The limits of machine intelligence.\nEMBO Reports\n. 2019-10-04, roč. 20, čís. 10, s. e49177. PMID: 31531926\nPMCID: PMC6776890.\nDostupné online\n[cit. 2023-03-23].\nISSN\n1469-221X\n.\ndoi\n:\n10.15252/embr.201949177\n.\nPMID\n31531926\n.\n↑\nPlanning for AGI and beyond.\nopenai.com\n[online]. [cit. 2023-03-23].\nDostupné online\n. (anglicky)\n↑\nArtificial General Intelligence.\nvisualisingai.deepmind.com\n[online]. [cit. 2023-08-19].\nDostupné v archivu\npořízeném z\noriginálu\ndne 2023-08-19. (anglicky)\n↑\nČTK\n. Obecná umělá inteligence tu bude do pěti let, věří šéf společnosti Nvidia.\nČT24\n[online].\nČeská televize\n[cit. 2024-03-04].\nDostupné online\n.\nSouvisející články\nUmělá inteligence\nFilozofie umělé inteligence\nInteligentní prostředí\nMimozemská inteligence\nHybridní inteligence\nExterní odkazy\nhttps://web.archive.org/web/20060501205638/http://www.lira.dist.unige.it/papers.htm\nPahýl\nTento článek je příliš stručný nebo\npostrádá důležité informace\n.\nPomozte Wikipedii tím, že jej vhodně\nrozšíříte\n. Nevkládejte však\nbez oprávnění\ncizí texty.\nCitováno z „\nhttps://cs.wikipedia.org/w/index.php?title=Obecná_umělá_inteligence&oldid=25216978\n“"}
{"docID": 4, "source": "https://cs.wikipedia.org/wiki/Zpracov%C3%A1n%C3%AD_p%C5%99irozen%C3%A9ho_jazyka", "text": "title: nlp\nurl: https://cs.wikipedia.org/wiki/Zpracov%C3%A1n%C3%AD_p%C5%99irozen%C3%A9ho_jazyka\ntext: Tento článek potřebuje úpravy.\nMůžete Wikipedii pomoci tím, že ho\nvylepšíte\n. Jak by měly články vypadat, popisují stránky\nVzhled a styl\n,\nEncyklopedický styl\na\nOdkazy\n.\nKonkrétní problémy:\nčlánek je plný nepodstatnými kapitolami, ale chybí ty podstatné, viz heslo na anglické Wiki\nTento článek potřebuje aktualizaci, neboť obsahuje zastaralé informace.\nMůžete Wikipedii pomoci tím, že ho\nvylepšíte\n, aby odrážel aktuální stav a nedávné události.  Historické informace nemažte, raději je převeďte do minulého času a případně přesuňte do části článku věnované dějinám.\nPočítačové\nzpracování přirozeného jazyka\n(anglicky\nNatural language processing\n,\nNLP\n) je soubor technik na pomezí (\npočítačové\n)\nlingvistiky\n,\ninformatiky\n(\numělé inteligence\n), popř. též\nakustiky\na dalších. Věnuje se analýze či generování textů nebo mluveného slova, které vyžadují určitou (ne absolutní) míru porozumění\npřirozenému jazyku\nstrojem.\nAplikace NLP jsou např.\nstrojový překlad\n,\nodpovídání na otázky\n(\nen:Question answering\n),\ndolování z textu\n(i\nvýtah z textu\n;\nen:Automatic summarization\n) a automatická\nkorektura textu\nči chatboti.\n[\n1\n]\nMezi úkoly, které přispívají k řešení těchto problémů, patří mj.\nextrakce informací\n,\nstrojový překlad\n,\ngenerování přirozeného jazyka\n(\nen:Natural language generation\n) a\nrozpoznávání\na\nsyntéza řeči\n(text-to-speech).\nZpracování přirozeného jazyka má tři historické fáze:\nsymbolické NLP (50. až 90. léta 20. stol.)\nstatistické NLP (90. léta 20. stol. až 00. léta 21. stol.)\nneuronové NLP (počátky 2003, rozvoj po roce 2010 díky\nTomáši Mikolovi\na programu\nWord2vec\n)\nTradiční (strukturalistický) přístup\nSouvisející informace naleznete také v článku\nLingvistická analýza\n.\nPočítačové zpracování přirozeného jazyka je interdisciplinární obor. Tento obor mimo jiné zkoumá přirozený jazyk jako matematický systém. Přirozený jazyk jako hlavní nástroj lidské komunikace je za pomocí aktivní účasti uživatele transformován prostřednictvím speciálních technologií ve formální jazyk (\ninterlingua\n; logická reprezentace významu), který je vhodný pro sémantickou prezentaci. Vyjadřuje význam jednotlivých prvků přirozeného jazyka, který je počítačově zpracován. Základem je\nalgoritmus\npopis jednotlivých rovin přirozeného jazyka, který je zároveň nezávislý na konkrétním jazyku.\n[\nzdroj?\n]\nZákladem interakce člověka s počítačem je dotazovací jazyk, u kterého je odstraněna víceznačnost jednotlivých prvků na všech úrovních. S ohledem na přesnost a jednoznačnost reprezentace samotného významu je nutná existence samostatné reprezentace pro každý významový prvek přirozeného jazyka. Struktury formálního jazyka jsou na konkrétních jazycích nezávislé.\nPři zpracování jazyka bylo nutné vymezit pravidla tzv. jazykové roviny. Každá jazyková rovina je pak určena svým hlavním jazykovým prvkem nebo třídou prvků, které jsou pro konkrétní rovinu typické. Každá rovina má vstupní a výstupní reprezentaci.\nFonetická rovina: Výstupem fonetické roviny je zpracování posloupnosti fónů ve fonetické abecedě.\nFonologická rovina: Výstupem fonologické roviny je posloupnost symbolů abstraktní abecedy, použitelná na fonologické rovině.\nMorfologie: Výstupem morfologie je zpracování větné struktury.\n[\nzdroj?\n]\nSyntaktická rovina: Výstupem syntaktické roviny je větná struktura (strom s označením větných vztahů).\nSémantická rovina (tektogramatická nebo tektografická, hloubková): Výstupem sémantické roviny je větná struktura s určením větných vztahů.\nPragmatická rovina: Výstupem pragmatické roviny je logická forma textu, která může být vyhodnocena jako pravda nebo nepravda.\nAutomatické indexování textů\nPodrobnější informace naleznete v článku\nAutomatická indexace\n.\nJe to proces přiřazení selekčních obrazů dokumentům nebo dotazům. Selekčním obrazem se rozumí výraz nebo množina výrazů určitého\nselekčního jazyka\n, např. všechna podstatná jména, předem daná podstatná jména, výrazy ve tvaru „podstatné jméno – přídavné jméno“ apod.\nKlíčovým problémem automatického indexování bývá určení, která slova textu nejlépe charakterizují jeho celkový obsah.\nLingvistické problémy automatického indexování\n:\nVýznamnost\njednotlivých slov (slovní spojení) pro vystižení charakteru obsahu celého textu.\nTvarosloví\n(morfologie) přirozeného jazyka.\nSynonymie\na jí podobné sémantické vztahy mezi slovy a slovními spojeními.\nHomonymie\n(nejednoznačnost) výrazů přirozeného jazyka.\nMozaika\nTato metoda automatického indexování je vhodná především pro ty jazyky, které mají rozvinutou flexi (ohýbání slov – skloňování, časování, stupňování atd.) a mají gramatickou shodu. Těchto pozitivních výsledků bylo dosaženo mimo jiné u češtiny, slovenštiny a ruštiny. Tato metoda nedokáže zcela dobře řešit problémy synonymie, homonymie a skrytých vztahů textu. Cílem metody je přiřadit vstupnímu textu selekční obraz.\nTato metoda má dvě hlavní fáze, a to morfologicko-lexikální analýzu a syntaktickou analýzu. V těchto dvou fázích jsou z textu extrahovány terminologické jednotky.\nMorfologicko-lexikální analýza\nVyloučení nevýznamových termínů pomocí negativního slovníku.\nIdentifikace specifických slov (předložky, spojky) důležité pro syntaktickou analýzu.\nUrčení vhodných indexačních termínů za pomocí slovníku koncových segmentů. Od slova, které nebylo úspěšně zpracováno je odtržen 4znakový koncový segment, který je hledán ve slovníku koncových segmentů.\nVybranému slovu jako potenciální terminologické jednotce je přiřazena jeho elementární váha (základní hodnota).\nSyntaktická analýza\nJednotlivé indexační termíny jsou složeny do sousloví.\nNa základě předložek či spojek jsou vyhledávána spojení jmenných frází.\nÚprava vah termínů – sečtení vah jednotlivých výskytů výrazů do vaz výrazů jako takových.\nTato metoda dosáhla nejlepších výsledků zejména v disciplínách s ustálenou terminologií.\nTéž je možné automaticky indexovat tezaurus.\nAutomatické referování\nReferát\n(abstrakt) je uváděn jako jeden z možných výstupů intelektuálního procesu nazývaného informační analýza dokumentů.\nReferát je zkrácený výklad obsahu dokumentu (nebo jeho části) s hlavními věcnými údaji a závěry, který zdůrazňuje nové poznatky a umožňuje rozhodnout se o účelnosti studia původního dokumentu. Výklad obsahu musí být stručný a přesný.\nAutomatické referování extrahuje vhodný počet vět, které nejlépe vystihují, co text přináší nového.\nAutomatická korektura textů\nChyby lze rozdělit takto:\nMechanické chyby – jsou snadno odhalitelné formální chyby způsobené nedbalostí:\ndvakrát za sebou napsaný stejný slovní tvar nebo stejné interpunkční znaménko,\nnevhodná kombinace interpunkčních znamének,\nnesprávné závorky,\nmalé písmenko na začátku věty\nGramatické chyby:\nMorfologické – chybně utvořený slovní tvar, opravuje pravopisný korektor.\nSyntaktické\n– chyby v použití slov – vynechání slova, přidání nadbytečného slova, nesprávná kombinace tvarů slov, záměna slovního tvaru jiným slovním tvarem a chyby v interpunkci.\nStylistické chyby: oprava spočívá v automatické detekci často používaných víceslovných obratů, které jsou vágní (nepřispívají k jádru sdělení), zbytečně rozvláčné (je možné je nahradit jedním slovem) a redundantní (dvakrát říkají totéž).\nAlgoritmus opravy pravopisných chyb\nKaždé slovo z textu je třeba zkoušet lematizovat tak dlouho, dokud se:\nnezíská slovo ze slovníku, u kterého je ve slovníků indikován jako přípustný i ten tvar, ve kterém bylo nalezeno v textu,\nnevyčerpají všechna lematizační pravidla na toto slovo použitelná (v textu je toto slovo pak označeno jako pravděpodobně chybné.\nOdkazy\nReference\n↑\nDemokratizace písemné komunikace za účelem rozvoje vlastních schopností NLG. 21.06.2022\nLiteratura\nMATERNA, Pavel, PALA, Karel a ZLATUŠKA, Jiří. Logická analýza přirozeného jazyka. 1. vyd. Praha: Academia, 1989. 143 s. Cesta k vědění; Čís. 44.\nISBN\n80-200-0027-5\n.\nZEMAN, Daniel. Lingvistická terminologie [online]. 2012 [cit. 2013-04-10]. Dostupné z:\nhttp://ufal.mff.cuni.cz/~zeman/vyuka/podklady/\n[\nnedostupný zdroj\n]\n.\nUHRÍN, Tibor. Přirozený jazyk a umělý jazyk. Inflow: information journal [online]. 2008, roč. 1, č. 11 [cit. 2013-04-28]. Dostupný z:\nhttp://www.inflow.cz/prirozeny-jazyk-umely-jazyk\nArchivováno\n12. 6. 2010 na\nWayback Machine\n.. ISSN 1802-9736.\nPODRAZILOVÁ, Jana. Historie pragmatiky a její formování se zaměřením na teorii řečových aktů a teorii intencí. Brno, 2010. Dostupné z:\nhttp://is.muni.cz/th/179758/ff_b_b1/?lang=en\n. Bakalářská diplomová práce. Masarykova univerzita, Filozofická fakulta, Ústav jazykovědy a baltistiky. Vedoucí práce PhDr. Ondřej Šefčík, Ph.D.\nHAJIČOVÁ, Eva, PANEVOVÁ, Jarmila, SGALL, Petr. Úvod do teoretické a počítačové lingvistiky: I. svazek – Teoretická lingvistika. Praha: Karolinum, 2003. 156 s.\nISBN\n80-246-0470-1\n.\nSTROSSA, Petr. Vybrané kapitoly z počítačového zpracování přirozeného jazyka. 1. vyd. Opava: Slezská univerzita v Opavě, Filozoficko-přírodovědecká fakulta, Ústav informatiky, 1999. 277 s.\nISBN\n80-7248-041-3\n.\nHABROVSKÁ, Pavlína. Krátce o zpracování přirozeného jazyka. Inflow: information journal [online]. 2010, roč. 3, č. 9 [cit. 2013-04-24]. Dostupný:\nhttp://www.inflow.cz/kratce-o-zpracovani-prirozeneho-jazyka\nArchivováno\n4. 3. 2016 na\nWayback Machine\n.. ISSN 1802-9736.\nZHOU, Lina, ZHANG, Dongsong. NLPIR: A Theoretical Framework for Applying Natural Language Processing to Information Retrieval. Journal of the American society for Information Science and Technology. 2003, vol. 54, no. 2, s. 115-123.\nLaboratoř zpracování přirozeného jazyka. Stručný terminologický slovník počítačové lingvistiky [online]. [cit. 2014-04-29]. Dostupné z:\nhttp://nlp.fi.muni.cz/cs/terminologie\n.\nSKLENÁK, Vilém. Sémantický web [online]. [cit. 2013-04-10]. Dostupné z:\nhttps://web.archive.org/web/20050827102902/http://www.inforum.cz/inforum2003/prispevky/Sklenak_Vilem.pdf\n.\nSouvisející články\nPočítačová lingvistika\nExterní odkazy\nObrázky, zvuky či videa k tématu\nzpracování přirozeného jazyka\nna Wikimedia Commons\nPortály\n:\nJazyk\nCitováno z „\nhttps://cs.wikipedia.org/w/index.php?title=Zpracování_přirozeného_jazyka&oldid=23979624\n“"}
{"docID": 5, "source": "https://cs.wikipedia.org/wiki/Word2Vec", "text": "title: word2vec\nurl: https://cs.wikipedia.org/wiki/Word2Vec\ntext: Word2Vec\nje způsob\nzpracování přirozeného jazyka\n, kdy jsou slova reprezentována vektory.\n[\n1\n]\nBezkontextový model publikovali v roce 2013 společně výzkumníci\nTomáš Mikolov\n, Kai Chen, Greg Corrado,\nIlya Sutskever\na\nJeff Dean\n, kteří pracovali pro Google. Algoritmus word2vec využívá model\nneuronové sítě\nk učení slovních asociací z velkého\nkorpusu\ntextu. Po natrénování může takový model odhalit\nsynonyma\nnebo navrhnout další slova pro další část věty. Word2vec reprezentuje každé odlišné slovo určitým seznamem čísel, kterému se říká\nvektor\n. Vektory jsou pečlivě vybrány tak, aby zachycovaly sémantické a syntaktické vlastnosti slov; jednoduchá matematická funkce (\nkosinus\núhlu mezi vektory) tak může indikovat úroveň\nsémantické podobnosti\nmezi slovy reprezentovanými těmito vektory.\nBezkontextové modely, jako je word2vec nebo\nGloVe\n, vytvářejí pro každé slovo ve slovníku jedinečnou reprezentaci, přičemž\nBERT\nbere v úvahu kontext pro každý výskyt daného slova. Zatímco vektor pro slovo anglické slovo \"\nrun\n\" bude mít stejnou reprezentaci z word2vec pro oba jeho výskyty ve větách \"\nHe is running a company\n\" a \"\nHe is running a marathon\n\", BERT poskytne kontextové osazení, které se bude lišit v závislosti na větě. Nově se právě pro\nvnoření slov\npoužívají novější modely jako\nBERT\nči\nGPT-3\n.\n[\n2\n]\nOdkazy\nReference\nV tomto článku byl použit\npřeklad\ntextu z článku\nWord2vec\nna anglické Wikipedii.\n↑\nA Beginner's Guide to Word2Vec and Neural Word Embeddings.\nPathmind\n[online]. [cit. 2022-10-29].\nDostupné online\n. (anglicky)\n↑\nALAMMAR, Jay. The Illustrated Word2vec.\njalammar.github.io\n[online]. [cit. 2022-10-29].\nDostupné online\n.\nExterní odkazy\nObrázky, zvuky či videa k tématu\nWord2Vec\nna Wikimedia Commons\nOficiální stránka projektu\nCitováno z „\nhttps://cs.wikipedia.org/w/index.php?title=Word2Vec&oldid=24823261\n“"}
{"docID": 6, "source": "https://cs.wikipedia.org/wiki/Strojov%C3%BD_p%C5%99eklad", "text": "title: strojový překlad\nurl: https://cs.wikipedia.org/wiki/Strojov%C3%BD_p%C5%99eklad\ntext: Strojový překlad\n(angl.\nmachine translation\n) je proces automatického\npřekladu\nz jednoho\npřirozeného jazyka\ndo jiného pomocí počítače. Strojový překlad byl poprvé použit v 50. letech v USA. Úkol v oblasti\nzpracování přirozeného jazyka\na\numělé inteligence\nstále však nebyl plně vyřešen. Poslední technologií jsou neuronové strojové překlady (neuron machine translation, NMT), které se blíží k tzv. lidské paritě neboli shodě s tím, jak by bilingvní osoba přeložila daný text a zda se přeložené shoduje s NMT.\n[\n1\n]\nVýsledky jsou již dostatečně kvalitní pro použití v mnoha oblastech, kde pomáhají lidským překladatelům.\nHistorie strojového překladu\nPokusy o strojový překlad cizojazyčných textů začaly krátce po\n2. světové válce\n. Očekávalo se, že pro\npočítače\n, jejichž první prototypy byly v té době uvedeny do provozu, nebude tento úkol nijak složitý. Brzy se však ukázalo, že tento předpoklad byl zcela mylný.\nPrvní systém pro strojový překlad\nbyl veřejnosti představen\n7. ledna\n1954\nv ústředí firmy\nIBM\n. Událost přitáhla značnou pozornost médií i široké veřejnosti. Systém samotný byl ale z dnešního pohledu velmi jednoduchý, jeho slovník obsahoval pouze 250 slov a při předvádění překládal pouze 49 zvlášť vybraných vět z\nruštiny\ndo\nangličtiny\n. I přes tuto jednoduchost ale systém vzbudil dojem, že praktické nasazení strojového překladu už není daleko, což pomohlo získat dostatečné finanční prostředky na další výzkum v tomto oboru.\nHlavní motivací pro vývoj dalších podobných systémů byla eskalující\nstudená válka\n.\nUSA\nse začaly obávat náskoku tehdejšího\nSovětského svazu\nve vývoji raketové i jiné vojenské techniky a snažily se pečlivě monitorovat pokrok sovětské vědy. První systémy pro strojový překlad byly proto používány především pro překládání ruskojazyčných vědeckých a odborných publikací do angličtiny. Kvalita překladu však byla velmi nízká a takto vzniklé texty se používaly pouze pro získání základní orientace v obsahu dokumentu a rozhodování, zda stojí za to nechat dokument přeložit profesionálním překladatelem.\nV průběhu dalších desetiletí bylo do vývoje v oblasti strojového překladu investováno značné úsilí jak v komerční, tak i v akademické sféře. Dosahované pokroky byly ale po celou dobu velmi skromné a ani dnešní nejmodernější systémy nedokáží překládat na úrovni, která by byla srovnatelná s člověkem.\nMetody strojového překladu\nPravidlový strojový překlad\nNejstarším přístupem ke strojovému překladu je pravidlový přístup, obvykle označovaný jako RBMT (Rule-based Machine Translation). Pravidlový překladový systém obvykle sestává ze slovníku (který může být vytvořen ručně či poloautomaticky) a sady překladových pravidel. Tato pravidla analyzují zdrojovou větu a za pomoci slovníku ji transformují do cílového jazyka. Vývoj pravidlového systému je časově náročný (obvykle se hovoří o desítkách let potřebných pro vytvoření reálně použitelného systému) a vyžaduje práci skupiny jazykových a počítačových expertů.\nPravidlových překladových systémů, které byly nasazeny do praxe, je velice málo a existují jen pro několik málo jazykových párů, zejména angličtinu s francouzštinou (částečně díky\nKanadě\na jejím jazykovým zákonům, vyžadujícím aby mnohé dokumenty byly k dispozici v anglické i francouzské verzi). Pravidlové systémy se přesto osvědčily pro překlady textů z velmi omezené jazykové domény, v kterémžto případě je možné slovníkem a sadou pravidel téměř plně postihnout texty, které je nutné překládat. V těchto situacích pravidlový překlad často dosahuje lepší kvality než obecně úspěšnější statistický překlad. Příkladem takového systému může být METEO, kanadský systém pro překlad\npředpovědi počasí\n.\nStatistický strojový překlad\nZvyšování výpočetní síly počítačů umožnilo v 90. letech 20. století masivní nástup statistických metod do počítačové lingvistiky, což v mnoha jejích oblastech způsobilo doslova revoluci. Nejinak tomu bylo u strojového překladu. Najednou již nebylo potřeba jazykových expertů desítek let vývoje. Ukázalo se, že dostatečné množství paralelních jazykových dat a statistické modelování dokáží v krátkém čase a s nevelkými náklady překonat mnohé stávající pravidlové systémy; stejně tak stvoření překladového systému pro nový jazykový pár se prakticky stalo pouze otázkou získání dostatečného množství dat.\nZákladem\nstatistického překladového systému\n(SMT, Statistical Machine Translation) je dvojjazyčný (paralelní) korpus – sada dokumentů ve zdrojovém jazyce a jejich lidských překladů do cílového jazyka (nebo obráceně), typicky automaticky sesbíraných z internetu a dalších volně dostupných zdrojů. Z těchto dat si překladový systém extrahuje překladovou tabulku, tj. slovník obohacený o pravděpodobnosti (četnosti) jednotlivých možných překladů. Nejobvyklejším přístupem je frázový překlad, kdy překladová tabulka (zde nazývaná frázová tabulka) obsahuje nejen překlady jednotlivých slov, ale zejména krátkých frází – je tomu tak mimo jiné proto, že slova zdrojového a cílového jazyka si obvykle neodpovídají 1:1, a překlad celých víceslovných frází proto obvykle vede k lepším výsledkům.\nDruhou zásadní částí statistického překladače je jazykový model pro cílový jazyk, který má za úkol z možných překladů jednotlivých frází vybrat takovou kombinaci, která vede ke koherentní a smysluplné cílové větě. Jazykový model se vytváří na základě jednojazyčného (monolinguálního) korpusu cílového jazyka. Pokud takový není k dispozici, lze použít i cílovou stranu paralelního korpusu, ale v typickém případě je jednojazyčných dat k dispozici řádově více než dvojjazyčných.\nKomerčně nejúspěšnějším systémem se stal\nGoogle Translate\n, který během několika let nabídl překlad mezi desítkami světových jazyků, v kvalitě obvykle postačující pro základní porozumění textu, v mnoha případech dokonce již umožňující správné porozumění většině obsahu přeloženého textu. Systém je pro běžné uživatele\ndostupný zdarma online\n, pro profesionální použití je možné používat placené API.\nV akademické sféře se prosazuje open-source překladový systém Moses, který je\ndostupný zdarma na internetu\n.\nHybridní strojový překlad\nHybridní překlad se snaží kombinovat výhody pravidlových a statistických systémů. Zásadní výhodou statistického přístupu je výrazně větší pokrytí než u pravidlového. Naopak pravidlové systémy obvykle dobře postihují gramatické jevy, které se obvykle řídí danými pravidly, zatímco statistické systémy se gramatická pravidla snaží (mnohdy neúspěšně) odhadovat z dat, bez lingvistických znalostí.\nNeuronový strojový překlad\nNeuronový strojový překlad, založený na hlubokém učení, dosáhl v posledních letech rychlého pokroku.\nPřekladače založené na práci s umělou neuronovou sítí jsou běžně dostupné od roku 2017. Google nasadil v tomto roce neuronovou síť ve svém Překladači\n[\n2\n]\na vznikl též konkurenční projekt\nDeepL\n, o němž se má za to, že od roku 2022 obvykle poskytuje nejlepší výsledky strojového překladu, obvykle stále vyžadují následnou úpravu člověkem.\n[\n3\n]\n[\n4\n]\n[\n5\n]\nV porovnání s Google Překladačem též dosahuje lepších výsledků.\n[\n6\n]\nStrojový překlad v Česku\nStrojový překlad má v České republice dlouhou a bohatou tradici, vznikla zde celá řada úspěšných akademických i komerčních systémů.\nAkademické systémy\nCentrem akademického výzkumu je už po několik desetiletí Ústav formální a aplikované lingvistiky při Matematicko-fyzikální fakultě Univerzity Karlovy. V průběhu sedmdesátých a osmdesátých let zde byla pod vedením prof.\nPetra Sgalla\nvytvořena rozsáhlá teorie pro formální popis přirozeného jazyka pomocí závislostní syntaxe nazvaná funkčně-generativní popis. Na těchto teoretických základech pak na přelomu sedmdesátých a osmdesátých let minulého století vznikl pod vedením Zdeňka Kirschnera experimentální anglicko-český strojový překladač APAČ a o několik let později podobný systém pro překlad mezi češtinou a ruštinou nazvaný RUSLAN.\nKomerční systémy\nKomerční systémy pro strojový překlad přišly na český trh krátce po nástupu osobních počítačů na začátku devadesátých let a poměrně rychle si mezi uživateli získaly značnou popularitu.\nPC Translator\nPC Translator byl první a komerčně nejúspěšnější softwarový nástroj pro překlad cizojazyčných textů na českém trhu. Během 30 let distribuce (od r. 1988) měl více než 40 tisíc legálních uživatelů. Pomáhal uživateli při překladu tím, že rozdělil větu na jednotlivá slova a skupiny slov a pro každé vyhledal ve slovníku několik nejvhodnějších překladů. Výsledek zobrazil v přehledné tabulce, podle níž pak uživatel sám sestavoval finální text. Novější verze byly doplněny i o skloňování a časování, anglická verze navíc o větný parser. Překladač umožňoval překlad ze šesti jazyků (angličtina, němčina, ruština, francouzština, italština a španělština) do češtiny a slovenštiny. Autorem programu byl Ing. Rostislav Janča. Program se na českém trhu velmi rychle etabloval a v České republice stále patří mezi nejpoužívanější překladatelské nástroje. Výrobcem a distributorem programu je od roku 1997 firma Langsoft s.r.o.\nTransen\nTransen byl první překladač na českém trhu, který dokázal v přeloženém textu sám skloňovat nebo časovat česká slova. K tomuto účelu obsahoval podrobně rozpracovanou databázi českých ohýbacích vzorů a sadu základních pravidel české syntaxe. Anglická syntaxe v něm byla popsána pomocí větných šablon sestavených podle knihy \"A Guide to Patterns and Usage in English\" významného britského lingvisty A. S. Hornbyho. Klíčové součásti překladače vyvinul bratislavský programátor Jozef Baruník, původně pro překlad z angličtiny do slovenštiny. Systém byl na českém trhu nabízen v první polovině devadesátých let, ale nedosáhl většího rozšíření.\nSkik\nPřekladač Skik byl na český trh uveden v polovině devadesátých let. Dokázal provádět základní analýzu syntaxe anglické věty a uměl i skloňovat nebo časovat česká slova v přeloženém textu. Autorem překladače byl Vladimír Smetáček. Program se na českém trhu prodával přibližně deset let, poté jeho autor své komerční aktivity ukončil a vyvinuté know-how nabídl české akademické komunitě.\nEurotran\nPřekladač Eurotran přišel na český trh na konci devadesátých let a byl prvním překladačem, který byl zaměřený na překlad internetových stránek. Autorem byl Milan Šustek. Program používal překladový model založený na paralelní bezkontextové gramatice, později přidal statistický bigramový model pro vyhlazování českého textu. Díky nasazení inovativních technik byl hned od počátku nástrojem, který poskytoval v češtině nejvyšší kvalitu překladu.\n[\n7\n]\nSouvisející články\nBabelfish\nDLT\n– projekt\nDistributed Language Translation\nInterlingvální strojový překlad\nTransferový strojový překlad\nStatistický strojový překlad\nWikipedie:Strojový překlad Wikipedie\n– Projekty automatizovaného překladu Wikipedie\nReference\n↑\nWayback Machine.\nweb.archive.org\n[online]. [cit. 2023-08-17].\nDostupné v archivu\npořízeném z\noriginálu\ndne 2023-08-17.\n↑\nGoogle skokově vylepšil překlad. Umělá inteligence se zakousla do češtiny.\niDNES.cz\n[online]. 2017-04-19 [cit. 2023-08-17].\nDostupné online\n.\n↑\nKATSNELSON, Alla. Poor English skills? New AIs help researchers to write better.\nNature\n. 2022-08-29, roč. 609, čís. 7925, s. 208–209.\nDostupné online\n[cit. 2023-08-17].\ndoi\n:\n10.1038/d41586-022-02767-9\n. (anglicky)\n↑\nKORAB, Petr. DeepL: An Exceptionally Magnificent Language Translator.\nMedium\n[online]. 2022-02-18 [cit. 2023-08-17].\nDostupné online\n. (anglicky)\n↑\nDeepL outperforms Google Translate – DW – 12/05/2018.\ndw.com\n[online]. [cit. 2023-08-17].\nDostupné online\n. (anglicky)\n↑\nCOLIN.\nDeepL Translator Review: Is It Better Than Google Translate?\n[online]. 2022-05-18 [cit. 2023-08-17].\nDostupné online\n. (anglicky)\n↑\nMF DNES: Stroj živého překladatele hned tak nenahradí\n, test překladačů PC Translator, Skik a Eurotran.\nExterní odkazy\nObrázky, zvuky či videa k tématu\nstrojový překlad\nna Wikimedia Commons\nStrojový překlad\nv\nČeské terminologické databázi knihovnictví a informační vědy (TDKIV)\nOnline překladač\npomocí GNU/FDL slovníku (slovník je\nsvobodný software\n). Nejedná se přímo o překlad, ale o zobrazení významu v jiném jazyce v bublinkové nápovědě.\nInteraktivní ukázka strojového překladu\nna Ústavu formální a aplikované lingvistiky\nMFF UK\n.\nStrojový překlad Český - Angličtina\nCitováno z „\nhttps://cs.wikipedia.org/w/index.php?title=Strojový_překlad&oldid=25305562\n“"}
{"docID": 7, "source": "https://cs.wikipedia.org/wiki/ChatGPT", "text": "title: chatgpt\nurl: https://cs.wikipedia.org/wiki/ChatGPT\ntext: ChatGPT\nVývojář\nOpen AI\nPrvní vydání\n30. listopadu\n2022\nAktuální verze\nChatGPT August 7, 2025 (7. srpna)\nPlatforma\nwebový prohlížeč\nAPI\nVyvíjeno v\nPython\nTyp softwaru\ngenerative artificial intelligence chatbot\n,\ngenerative pre-trained transformer\n,\nvelký jazykový model\n, online služba a\ninternetová stránka\nLicence\nproprietární licence\nWeb\nchatgpt\n.com\nNěkterá data mohou pocházet z\ndatové položky\n.\nChatGPT\n(\nGenerative Pre-trained Transformer\n)\n[\n1\n]\nje\nchatbot\nspuštěný firmou\nOpenAI\nv listopadu 2022. ChatGPT má svoji webovou stránku, která formou textové konverzace (chatu) zpřístupňuje systém veřejnosti\n[\n2\n]\nči pomocí\nAPI\n.\n[\n3\n]\nChatGPT je\nexpertní systém\n, který implementuje prvky\numělé inteligence\npomocí technologie\nvelkých jazykových modelů\n(LLM) a\numělé neuronové sítě\n. ChatGPT může být použit v různých aplikacích, včetně chatbotů, asistentů pro zákazníky, tvorby obsahu a mnoha dalších. Jeho schopnost generovat plynulý a kontextově relevantní text mu umožňuje efektivně komunikovat s lidmi prostřednictvím psaného slova či audia.\nCharakteristika\nPříklad komunikace s ChatGPT\nPrototyp ChatGPT 3.5 byl veřejně uveden\n30. listopadu\n2022 a rychle si získal pozornost pro své podrobné a dobře formulované odpovědi v mnoha oblastech znalostí.\n[\n4\n]\nPodle slovního zadání může například psát počítačové programy,\n[\n5\n]\n[\n6\n]\n[\n7\n]\npoezii nebo obchodní korespondenci.\n[\n8\n]\nDokázal by dokonce složit přijímací zkoušky na právnickou fakultu, byť by byl mezi horšími.\n[\n9\n]\nZ toho důvodu byl již studentům některých škol zakázán, aby ho nemohli využívat k podvádění při psaní školních prací.\n[\n10\n]\n[\n11\n]\nZa významnou nevýhodu však je považována jeho nerovnoměrná faktická přesnost.\n[\n12\n]\nPo vydání ChatGPT byla firma OpenAI oceněna na 29 miliard amerických dolarů.\n[\n13\n]\nHodnocení\nInformace, které ChatGPT poskytuje, však nemusejí být vždy pravdivé, odpovídat skutečnému stavu věcí a mohou být zavádějící i zcela smyšlené.\n[\n14\n]\n[\nchybí lepší zdroj\n]\nProto je potřeba je ověřovat i z jiných informačních zdrojů. ChatGPT rovněž nemohl do května 2023 poskytnout aktuální informace, protože data, z nichž čerpá, jsou omezena rokem 2021 (stav k lednu 2023).\n[\n15\n]\n[\n16\n]\nPlatící uživatelé mohou od května 2023 využít mód, který ChatGPT umožňuje procházet\nweb\na zpracovávat současné informace.\n[\n17\n]\nChatGPT má zatím rovněž potíže se zpracováním\nmatematických\núloh. Důvodem je, že je trénován na rozpoznávání a generování textu na základě předchozích vzorků. V současné době není schopen plně řešit matematická zadání, jako by to udělal člověk, protože matematika vyžaduje logické myšlení a abstrakci.\nUmělá inteligence\n(UI) například v podobě ChatGPT má tendenci spoléhat se na naučené modely a předem dané algoritmy a není zatím schopna pochopit matematiku na hlubší úrovni jako člověk.\n[\n18\n]\n[\n19\n]\n[\n20\n]\nKe zlepšení matematických schopností mělo dojít po 30. lednu 2023, kdy byl proveden upgrade ChatGPT.\n[\n21\n]\n[\n22\n]\nV placené verzi ChatGPT lze k řešení matematických úloh využít plugin od\nWolfram Alpha\n.\n[\n23\n]\n[\n24\n]\nS užíváním ChatGPT jsou rovněž spojeny obavy o soukromí uživatelů a o bezpečí údajů, které do chatbota vkládají.\n[\n25\n]\nVe školství\nChatGPT může hrát důležitou roli ve vzdělávání. Může žáky učit kritickému uvažování, protože ne všechny informace, které jim ChatGPT poskytne, jsou pravdivé.\n[\n26\n]\nMůže rovněž posloužit pro výuku jazyků díky možnosti konverzovat na různá témata.\n[\n27\n]\n[\n28\n]\n[\n29\n]\nNa druhou stranu, jak formuloval\nNoam Chomsky\n, jde o „technologicky vyspělé\nplagiátorství\n“, které lidem umožní vyhýbat se učení.\n[\n30\n]\nNěkteré vysoké školy ve výuce zakazují používání ChatGPT a obecně dalších nástrojů, které využívají umělou inteligenci. Od 1. ledna 2023 například na\nindické\nuniverzitě\nv\nBengalúru\n. Cílem tohoto zákazu je předejít\nplagiátorství\n. Na této škole se zákaz vztahuje také na\nGitHub Co-pilot\na\nBlack Box\n.\n[\n31\n]\n[\n32\n]\nJednou z dalších škol, která omezila používání ChatGPT je\nInstitut d’études politiques de Paris\n, kde lze používat nástroje UI pod dohledem pedagoga. Za použití nástrojů UI pro tvorbu písemných nebo ústních prací hrozí studentům vyloučení ze školy.\n[\n32\n]\n[\n33\n]\nAustralské univerzity považují použití ChatGPT pro vypracování prací za podvod.\n[\n33\n]\nZároveň se snaží o zrevidování systému hodnocení, který by měl reagovat na existenci stále pokročilejších generátorů textu. Také by se zkoušky měly skládat pod dohledem a častěji psanou formou pomocí tužky a papíru. Australská národní univerzita se problému s ChatGPT rozhodla čelit větším množstvím laboratorních aktivit a prací v terénu a větším množstvím ústních zkoušek.\n[\n34\n]\nKritici poukazují na to, že bude stále těžší prokázat a odhalit texty generované pomocí UI, a to již s případným nástupem další generace\nGPT-4\n. Zároveň se očekává, že v budoucnu se systémy UI stanou součástí nástrojů, které budeme běžně používat, a legitimním cílem škol by mělo být naučit se s nimi pracovat.\n[\n34\n]\nChatGPT+\nChatGPT+ je placená verze chatbota ChatGPT. Existuje osobní, nebo firemní tarif. Poskytuje rozšířené limity na zadávání množství dotazů, delších textů, větší limity pro generaci obrázků, vkládání více souborů, a delší využití hlasového modelu. Většina funkcí ChatGPT+ jsou v omezení dostupné i v bezplatné verzi.\n[\n35\n]\nOdkazy\nReference\nV tomto článku byl použit\npřeklad\ntextu z článku\nChatGPT\nna anglické Wikipedii.\n↑\nROOSE, Kevin. The Brilliance and Weirdness of ChatGPT.\nThe New York Times\n. 2022-12-05.\nDostupné online\n[cit. 2023-01-21].\nISSN\n0362-4331\n. (anglicky)\n↑\nChatGPT: sledujeme vše k tématu.\nLupa.cz\n[online]. [cit. 2023-04-29].\nDostupné online\n.\n↑\nIntroducing ChatGPT and Whisper APIs.\nopenai.com\n[online]. [cit. 2023-03-09].\nDostupné online\n. (anglicky)\n↑\nPÁLENÍČEK, Adam. ChatGPT ukazuje víc, než si myslíte. Proč fenomenální úspěch AI děsí lidstvo.\nFinmag.cz\n[online]. [cit. 2023-01-24].\nDostupné online\n.\n↑\nMAYO, Matthew.\nChatGPT as a Python Programming Assistant\n[online]. KDnuggets, 2023-01-20 [cit. 2023-01-26].\nDostupné online\n. (anglicky)\n[\nnedostupný zdroj\n]\n↑\nSELVARAJ, Natassha.\nAutomate the Boring Stuff with GPT-4 and Python\n[online]. [cit. 2023-03-30].\nDostupné online\n. (anglicky)\n[\nnedostupný zdroj\n]\n↑\nFERRER, Josep.\n5 ChatGPT Features to Boost your Daily Work\n[online]. [cit. 2023-05-26].\nDostupné online\n. (anglicky)\n[\nnedostupný zdroj\n]\n↑\nMETZ, Axel. 6 exciting ways to use ChatGPT – from coding to poetry.\nTechRadar\n[online]. 2022-12-29 [cit. 2023-01-26].\nDostupné online\n. (anglicky)\n↑\nRobot od OpenAI složil zkoušky na právnické fakultě, může ohrozit tradiční výuku.\niDNES.cz\n[online]. 2023-01-25 [cit. 2023-01-25].\nDostupné online\n.\n↑\nFrancouzská univerzita zakázala studentům používat ChatGPT - Novinky.\nwww.novinky.cz\n[online]. [cit. 2023-01-30].\nDostupné online\n.\n↑\nKAR. Newyorské školy zasahují proti umělé inteligenci, zakázaly program ChatGPT.\nČT24\n[online]. Česká televize [cit. 2023-01-30].\nDostupné online\n.\n↑\nVINCENT, James. AI-generated answers temporarily banned on coding Q&A site Stack Overflow.\nThe Verge\n[online]. 2022-12-05 [cit. 2023-01-21].\nDostupné online\n. (anglicky)\n↑\nVARANASI, Lakshmi. ChatGPT creator OpenAI is in talks to sell shares in a tender offer that would double the startup's valuation to $29 billion.\nBusiness Insider\n[online]. [cit. 2023-01-22].\nDostupné online\n. (anglicky)\n↑\nALTMAN, Sam.\nhttps://twitter.com/sama/status/1601731295792414720\n[online]. 2022-12-11 [cit. 2023-02-09].\nDostupné online\n.\n↑\nSOUTHERN, Matt G.\nOpenAI's ChatGPT Update Brings Improved Accuracy\n[online]. 2023-01-11 [cit. 2023-02-04].\nDostupné online\n. (anglicky)\n↑\nRUBY, Daniel.\nChatGPT Statistics for 2023: Comprehensive Facts and Data\n[online]. 2022-12-29 [cit. 2023-02-04].\nDostupné online\n. (anglicky)\n↑\nChatGPT — Release Notes | OpenAI Help Center\n[online]. openai, 2023-05-12 [cit. 2023-05-18].\nDostupné online\n. (anglicky)\n↑\nHIPPEL, Paul T. von.\nChatGPT Is Not Ready to Teach Geometry (Yet)\n[online]. 2023-01-04 [cit. 2023-02-09].\nDostupné online\n. (anglicky)\n↑\nZUMBRUN, Josh.\nChatGPT Needs Some Help With Math Assignments\n[online]. [cit. 2023-02-09].\nDostupné online\n. (anglicky)\n↑\nBRYDEN, Ken.\nMath is the worst enemy of ChatGPT - Crast.net\n[online]. 2023-02-03 [cit. 2023-02-09].\nDostupné online\n.\n↑\nSOUTHERN, Matt G.\nChatGPT Update: Improved Math Capabilities\n[online]. 2023-01-31 [cit. 2023-02-09].\nDostupné online\n. (anglicky)\n↑\nChatGPT — Release Notes\n[online]. OpenAI, 2023-01-30 [cit. 2023-02-09].\nDostupné online\n. (anglicky)\n↑\nWolfram Plugin for ChatGPT\n[online]. [cit. 2023-05-18].\nDostupné online\n. (anglicky)\n↑\nChatGPT plugins\n[online]. OpenAI [cit. 2023-05-18].\nDostupné online\n. (anglicky)\n↑\nGAL, Uri. ChatGPT is a data privacy nightmare, and we ought to be concerned.\nArs Technica, The Conversation\n[online]. Ars Technica, 2023-02-08 [cit. 2023-02-11].\nDostupné online\n. (anglicky)\n↑\nUmělá inteligence ve školách. Zakazovat, nebo začít efektivně využívat?\n[online]. [cit. 2023-02-04].\nDostupné online\n.\n↑\nUčitel IT.cz\n[online]. [cit. 2023-02-04].\nDostupné online\n.\n↑\nSHEMESH, Hadar.\nThe Ultimate Guide for Using ChatGPT for English Learning\n[online]. 2023-01-24 [cit. 2023-02-04].\nDostupné online\n. (anglicky)\n↑\nMICHAELSEN, Ann S.\nUsing ChatGPT for Language Learning\n[online]. 2022-12-29 [cit. 2023-02-04].\nDostupné online\n. (anglicky)\n↑\nNoam Chomsky on ChatGPT: It's \"Basically High-Tech Plagiarism\" and \"a Way of Avoiding Learning\" | Open Culture\n[online]. [cit. 2023-02-10].\nDostupné online\n. (anglicky)\n↑\nBARDWAJ, Nidhi.\nBengaluru colleges ban ChatGPT, here’s why?\n[online].  Nové Dillí: India Today [cit. 2023-02-04].\nDostupné online\n. (anglicky)\n↑\na\nb\nKILIÁN, Karel.\nVysoké školy zakazují studentům ChatGPT. Obávají se zneužití umělé inteligence pro psaní úkolů\n[online]. Živě, 2023-02-04 [cit. 2023-02-04].\nDostupné online\n.\n↑\na\nb\nSciences Po Paris: En utilisant ChatGPT, ils risquent jusqu’à l’exclusion\n[online]. 2023-01-28 [cit. 2023-02-04].\nDostupné online\n. (francouzsky)\n↑\na\nb\nCASSIDY, Caitlin.\nAustralian universities to return to ‘pen and paper’ exams after students caught using AI to write essays\n[online]. 2023-01-10 [cit. 2023-02-04].\nDostupné online\n. (anglicky)\n↑\nOpenAI Introduces ChatGPT Plus, Starting at $20 Per Month\n[online]. 2023-02-03 [cit. 2023-02-09].\nDostupné online\n. (anglicky)\nSouvisející články\nGemini (chatbot)\nClaude\nGrok\nVirtuální asistent\nExterní odkazy\nObrázky, zvuky či videa k tématu\nChatGPT\nna Wikimedia Commons\nChatbot ChatGPT\n– komunikuje i česky\nSbírka pomůcek k efektivní práci s ChatGPT (anglicky)\nPortály\n:\nInternet\nCitováno z „\nhttps://cs.wikipedia.org/w/index.php?title=ChatGPT&oldid=25351391\n“"}
{"docID": 8, "source": "https://cs.wikipedia.org/wiki/Rys_(lingvistika)", "text": "title: rys (lingvistika)\nurl: https://cs.wikipedia.org/wiki/Rys_(lingvistika)\ntext: Rys\n, neboli příznak, je rozhodující vlastnost, pomocí které lze klasifikovat konstrukty systému.  V lingvistice se tento pojem ujal nejprve ve fonologii.\nFonologický rys\nje vlastností zvukového segmentu,\nhlásky\n.\nNikolaj Sergejevič Trubeckoj\nv díle Grundzüge der Phonologie používá rysy pro popis\nopozic\nmezi fonémy. Např. opozici mezi\nfonémy\n„/b/“ a „/m/“ tvoří rys nazálnosti, který je přítomen u „/m/“ a nepřítomen u „/b/“. Fonologický rys je distinktivní vlastností daného fonému. Jeho hlavním úkolem je odlišit daný foném ode všech ostatních fonémů v systému daného jazyka. Další funkcí fonologického rysu je poskytnout návod, jak daný foném vyslovit. Proto by měl foném mít vztah k fonetické realizaci. Každý\nfoném\nlze považovat za složený z konečného počtu rysů. Jinými slovy, fonémy jsou „balíčky distinktivních rysů“.\nNoam Chomsky\na\nMorris Halle\nv knize Sound Pattern of English (1968) převzali důsledný binarismus ( tj. každý rys může mít pro daný segment maximálně dvě hodnoty: + a – ), který navrhl\nRoman Jakobson\na přizpůsobili inventář distinktivních rysů tak, aby mohl fungovat v přepisovacích pravidlech, kterými se zápis z abstraktní morfosyntaktické roviny převádí do konkrétní fonetické podoby. Např. předložková fráze /k kostelu/ má fonetickou podobu [kekostelu] podle pravidla, které vkládá [e] mezi stejné souhlásky ve fonetickém slově s jedním přízvukem.\nPodle autorů SPE mají hodnoty distinktivních rysů definovat přirozené třídy hlásek. Přirozená třída je množina všech hlásek v daném jazyce, které sdílejí určitou hodnotu daného rysu. Např. rys zapsaný jako [+ znělost] definuje početnou třídu všech neznělých hlásek. Sem patří /p/, /t/, /k/, /s/, /f/ atd. V dalším vývoji fonologie byly navrženy jiné inventáře rysů. Některé rysy, např. [slabičnost], [přízvuk] , byly nahrazeny strukturou. Geometrická teorie rysů vedla k tomu, že přirozené třídy jsou reprezentovány nejen rysy samotnými ale i svou vzájemnou hierarchií.\nTeorie rysů byla transplantována z fonologie i do jiných lingvistických oblastí. Analogicky je možno chápat flektivní tvary slov jako balíčky morfosyntaktických rysů. Tak můžeme např. srovnávat dva tvary morfologické\nflexe\nlišící se jediným rysem: „šel jsem“ versus „šel bych“.\nMorfosyntaktické rysy\nzahrnují lexikální rysy ±N a ±V, které možnými kombinacemi svých hodnot tvoří čtyři základní slovní druhy (substantivum = [+N,-V]; sloveso = [-N,+V]; přídavné jméno = [+N,+V]; předložka = [-N,-V]). Gramatické rysy v úzkém slova smyslu jsou rysy figurující u podstatných jmen [osoba], [číslo] a [rod], nebo rysy spojené s přídavnými jmény [komparativ] [superlativ]. Početné jsou rysy spojené se slovesy jako jsou čas, způsob, slovesný rod:\n[ ± minulost], [ ± kondicionál], [± pasívum]. Jako součást své teorie\nvázání\nN. Chomsky (1981) navrhl dva rysy, kterými se modeluje vázání výrazů [± anaphoric] a [ ± pronominal].\nRozeznáváme\ninherentní\na\nselektivní\ngramatické rysy. Inherentní rysy se vyskytují jako součást lexikálních výrazů (slov) a jako takové je vybíráme spolu se slovy přímo ze\nslovníku\n. Např. české slovo „nůžky“ má inherentní gramatický rys [+ plurál], který nelze změnit. Selektivní rysy přistupují k lexikálnímu výrazu až ve větě podle řídícího výrazu (\ngramatická shoda\n) nebo podle\nfunkční kategorie\ndominující daný lexikální výraz. Řídící členy gramatických kategorií (např. ČAS) lze opět chápat jako balíčky gramatických rysů.\nPoužívání\nsémantických rysů\n, tzv.\nsemů\n, v oblasti jazykového obsahu (významu) navrhl\nLouis Hjelmslev\nv knize Prolegomena to a Theory of Language. Analýza na sémantické rysy je známa v lingvistice jako\nkomponenční analýza\n. Hjelmslev ve svém hlavním díle (kapitola 14, Varianty a invarianty) analyzuje význam „hřebec“ jako složený z rysů [+ kůň] a [+ samec] a vyjadřuje přesvědčení, že podobným způsobem lze analyzovat všechny jazykové významy. Tato naděje zůstala zatím nesplněná.\nOdkladiště\nPojem „rys“ (recesivní nebo dominantní) používají genetikové pro popis genotypu.\nCitováno z „\nhttps://cs.wikipedia.org/w/index.php?title=Rys_(lingvistika)&oldid=25473557\n“"}
{"docID": 9, "source": "https://cs.wikipedia.org/wiki/Tvaroslov%C3%AD", "text": "title: tvarosloví\nurl: https://cs.wikipedia.org/wiki/Tvaroslov%C3%AD\ntext: Tvarosloví\nneboli\nmorfologie\nje\nlingvistická\nvěda\nzabývající se\nohýbáním\n(\nskloňování\n,\nčasování\n) a pravidelným odvozováním slov pomocí\npředpon\n,\npřípon\na\nvpon\n. Je to disciplína lingvistiky, která studuje strukturu slov. Tento pojem uvedl do jazykovědy\nAugust Schleicher\nv roce\n1859\n. Lingvista zabývající se morfologií se nazývá\nmorfolog\n. Slova určitého jazyka morfolog bere jako sestavená z jednoho či více\nmorfémů\n.\nMorfologické hledisko je základem\ntypologické klasifikace jazyků\nna\nanalytické\n,\nflektivní\na\naglutinační\n.\nCharakteristika\nPro jazyky analytického typu (\nvietnamština\n) ideálně platí, že každý morfém je slovem a každé slovo je tvořeno jedním morfémem. U jazyků aglutinačních (např. turečtina) je většina slovních forem vytvořena ze snadno oddělitelných segmentů. Každý segment přitom odpovídá jednomu morfému. Jazyky flektivní, kam patří i čeština, spojují často víc než jeden morfém do jednoho segmentu,\nmorfu\n, popř. se morfémy realizují fúzí či nulovou realizací. Segmentace slova na morfémy je u flektivních jazyků tudíž často nemožná, nebo je proveditelná pouze na abstraktní rovině.\nMorfém\nje podle\nstrukturalismu\nminimální, sémanticky dále nedělitelná jednotka. Ve strukturalistickém učení o jazyce je považován za bilaterální jazykový znak, tj. jednotu označujícího (formy) a označovaného (významu).\nMorfémy\njsou v textu realizovány konkrétními jednotkami, které se nazývají\nmorfy\n. Protože různé morfy mohou realizovat v různých kontextech jeden a tentýž morfém, je morfém někdy považován za třídu\nalomorfů\n. Např. morfém\nplural\nmá v\nčeštině\nmimo jiné alomorfy -i, -ové, -y, -a.\nExterní odkazy\nObrázky, zvuky či videa k tématu\ntvarosloví\nna Wikimedia Commons\nPahýl\nTento článek je příliš stručný nebo\npostrádá důležité informace\n.\nPomozte Wikipedii tím, že jej vhodně\nrozšíříte\n. Nevkládejte však\nbez oprávnění\ncizí texty.\nPortály\n:\nJazyk\nCitováno z „\nhttps://cs.wikipedia.org/w/index.php?title=Tvarosloví&oldid=25356159\n“"}
{"docID": 10, "source": "https://cs.wikipedia.org/wiki/Um%C4%9Bl%C3%A1_neuronov%C3%A1_s%C3%AD%C5%A5", "text": "title: neuronová síť\nurl: https://cs.wikipedia.org/wiki/Um%C4%9Bl%C3%A1_neuronov%C3%A1_s%C3%AD%C5%A5\ntext: Příklad neuronové sítě: vstup, skrytá vrstva, výstup\nUmělá neuronová síť\n, anglicky\nArtificial Neural Network\nči jen\nNeural Network (ANN, NN)\n, je jeden z výpočetních modelů používaných v oblasti\numělé inteligence\n, podoblasti anglicky tzv.\nSoft Computing\n(spolu s\nevolučními algoritmy\na\nfuzzy logikou\n). Vzorem je chování neuronů v mozku, od toho je odvozen i název, v současnosti se však princip neuronových sítí od původního zamýšleného napodobení neuronů liší.\n[\n1\n]\nUmělá neuronová síť je struktura určená pro distribuované paralelní zpracování dat. Skládá se z umělých (formálních) neuronů, jejichž volným předobrazem je biologický\nneuron\n. Neurony jsou vzájemně propojeny\nsynaptickými\nvazbami a navzájem si předávají signály a transformují je pomocí aktivačních přenosových funkcí. Neuron má libovolný počet vstupů, ale pouze jeden výstup.\nVyužití\nNeuronové sítě se používají mimo jiné pro\nrozpoznávání obrazů\n[\n2\n]\n(např. ve formě\npixelů\n) či\nakustických\n(např.\nrozpoznávání řeči\n) nebo elektrických (např.\nEKG\n,\nEEG\n)\nsignálů\n[\n3\n]\n, dále ke\nklasifikaci\n,\nkompresi\nči\nsegmentaci\ndat\n[\n4\n]\n, k\npredikci\nvývoje časových řad (např.\nburzovních indexů\n), k\nanalýze psaného textu\n[\n5\n]\nči k\nfiltrování\nspamu\n. V lékařství slouží k diagnostice onemocnění či k prohlubování znalostí o fungování informačních systémů (\nnervových soustav\n) živých organismů. Například\nGrossbergova síť\n[\n6\n]\nvznikla původně jako simulace fyziologického modelu rozpoznávání vzorů na\nsítnici\nlidského oka.\nHistorie\nPrvní umělé neurony byly vytvořeny Warrenem McCullochem a Walterem Pittsem v roce 1943.\n[\n7\n]\nTyto neurony fungovaly tak, že byl jejich výstup 0 nebo 1 v závislosti na tom, jestli vážená suma vstupních signálů překročila prahovou hranici, nebo ne. Jejich teorie byla, že takový neuron v principu spočte jakoukoli aritmetickou či logickou funkci. Tehdy však nebyla vypracována žádná tréninková metoda.\nV padesátých letech přišel Frank Rosenblatt\n[\n8\n]\ns\nperceptrony\n, které doprovázela již i učící pravidla. Perceptrony využíval k rozpoznávání vzorů. Mimo to dokázal, že pokud existují váhy, které zadaný problém řeší, pak k nim učící pravidlo konverguje.\nPočáteční nadšení však uvadlo, když se zjištilo, že takovýto perceptron umí řešit pouze lineárně separovatelné úlohy. Frank Rosenblatt se sice snažil model upravit a rozšířit, ale nedařilo se mu to a tak až do osmdesátých let přestal být o perceptrony a neuronové sítě zájem.\nV 80. letech došlo k vývoji vícevrstvých perceptronových sítí s asociačními pravidly, schopných aproximovat libovolnou\nvektorovou funkci\n, díky čemuž nastala nová vlna zájmu o neuronové sítě,\n[\n9\n]\nkterý později částečně upadl kvůli neschopnosti učit sítě o větším počtu vrstev. Až okolo roku 2010 opět došlo k renesanci neuronových síti díky objevu hloubkového učení.\nNejužívanější způsob učení neuronových síti je algoritmus zpětného šíření chyby. Podle různých zdrojů\n[\n10\n]\n[\n11\n]\n[\n12\n]\nbyly základy algoritmu zpětného šíření chyby v kontextu\nteorie řízení\nodvozeny z principů\ndynamického programování\n; konkrétně se na tom podíleli Henry J. Kelley v roce 1960\n[\n13\n]\na Arthur E. Bryson v roce 1961.\n[\n14\n]\nRoku 1962 publikoval Stuart Dreyfus jednodušší odvození pomocí\nřetězového pravidla\n.\n[\n15\n]\nVladimir Vapnik cituje ve své knize o\nsupport vector machines\nčlánek z roku 1963.\n[\n16\n]\nV roce 1969 Bryson a Yu-Chi Ho algoritmus popsali jako vícestupňovou optimalizaci dynamických systémů.\nV roce 1970 Seppo Linnainmaa publikoval obecnou metodu automatického derivování (AD) diskrétních sítí vnořených\ndiferencovatelných\nfunkcí.\n[\n17\n]\n[\n18\n]\nJedná se o moderní variantu metody zpětného šíření chyby, která je efektivní i v řídkých sítích.\n[\n19\n]\n[\n20\n]\nV roce 1973 Stuart Dreyfus pomocí zpětného šíření chyby upravoval parametry řídicích systémů úměrně jejich chybovým gradientům.\n[\n21\n]\nPaul Werbos zmínil možnost uplatnění tohoto principu na umělé neuronové sítě roku 1974\n[\n22\n]\na v roce 1982 tak učinil způsobem, který se používá nyní.\n[\n23\n]\nO čtyři roky později David E. Rumelhart, Geoffrey E. Hinton a Ronald J. Williams experimentálně prokázali, že tato metoda může vést k užitečným interním reprezentacím vstupních dat v hlubších vrstvách neuronových sítí, což je základem hlubokého učení.\n[\n24\n]\nV roce 1993 byl Eric A. Wan první, kdo vyhrál pomocí backpropagace mezinárodní soutěž v modelování dat.\n[\n25\n]\nV současnosti se neuronové sítě převážně užívají v úlohách\nzpracování přirozeného jazyka\nv rámci tzv.\njazykových modelů\njako např.\nWord2Vec\nči\nTransformer\na v úlohách\npočítačového vidění\nv rámci tzv.\nkonvolučních\nneuronových sítí.\nModel umělého neuronu\nJe popsána celá řada modelů neuronů. Od těch velmi jednoduchých používajících skokové přenosové funkce (\nperceptron\n) až po velmi složité popisující každý detail chování neuronu živého organismu, jako např.\nHindmarshův–Roseův model neuronu\n[\n26\n]\n.\nModel umělého neuronu s funkcí S\nJedním z nejpoužívanějších je model popsaný McCullochem a Pittsem\n[\n7\n]\n:\ny\n=\nf\n(\n∑\ni\n=\n1\nN\n(\nw\ni\nx\ni\n)\n−\nϑ\n)\n{\\displaystyle y=f(\\sum _{i=1}^{N}(w_{i}{}x_{i}{})-\\vartheta )}\nkde:\nx\ni\n{\\displaystyle x_{i}{}}\njsou vstupy neuronu\nw\ni\n{\\displaystyle w_{i}{}}\njsou synaptické\nváhy\nϑ\n{\\displaystyle \\vartheta }\nje\npráh\ncitlivosti neuronu\nf\n{\\displaystyle f}\nje\naktivační funkce\nneuronu\ny\n{\\displaystyle y}\nje výstup neuronu\nVelikost\nvah\nw\ni\n{\\displaystyle w_{i}{}}\nvyjadřuje uložení zkušeností do\nsynapsí\nneuronu. Čím je vyšší hodnota, tím je daný vstup důležitější. V biologickém neuronu\npráh\nϑ\n{\\displaystyle \\vartheta }\noznačuje prahovou hodnotu\naktivace\nneuronu. Tzn. je-li\n∑\ni\n=\n1\nN\n(\nw\ni\nx\ni\n)\n{\\displaystyle \\sum _{i=1}^{N}(w_{i}{}x_{i}{})}\nmenší než práh, je neuron pasivní (inhibovaný) a je-li\n∑\ni\n=\n1\nN\n(\nw\ni\nx\ni\n)\n{\\displaystyle \\sum _{i=1}^{N}(w_{i}{}x_{i}{})}\nvětší než práh, je neuron aktivní (excitovaný).\nAktivační funkce neuronu\nAktivační (\npřenosová\n) funkce neuronu v umělých neuronových sítích definuje výstup neuronu při zadání sady vstupů neuronu. Nelineární aktivační funkce umožňují neuronovým sítím řešit nelineární problémy. Klasická nelineární aktivační funkce je\nsigmoida\n(logistická funkce) o parametrech strmosti (určující šířku pásma citlivosti neuronu na svůj aktivační potenciál) a prahové hodnoty (určující posunutí počátku funkce) spolu s jejími limitními tvary jako je linearita pro strmost blížící se nule resp. ostrá nelinearita (skoková funkce) pro strmost blížící se nekonečnu:\n[\n27\n]\nf\n(\nx\n)\n=\n1\n(\n1\n+\ne\n−\np\n(\nx\n−\nϑ\n)\n)\n{\\displaystyle f(x)={1 \\over (1+e^{-p(x-\\vartheta )})}}\n, tj.\nlim\np\n→\n0\nf\n(\nx\n)\n=\n1\n2\n{\\displaystyle \\lim _{p\\rightarrow 0}f(x)={1 \\over 2}}\nresp.\nlim\np\n→\n∞\nf\n(\nx\n)\n=\n0\n{\\displaystyle \\lim _{p\\rightarrow \\infty }f(x)=0}\npro\nx\n<\n0\n{\\displaystyle x<0}\na\nlim\np\n→\n∞\nf\n(\nx\n)\n=\n1\n{\\displaystyle \\lim _{p\\rightarrow \\infty }f(x)=1}\npro\nx\n>\n0\n{\\displaystyle x>0}\nAktivační funkce. V levém sloupci sigmoida spolu se svými limitními případy, v pravém sloupci možné transformace dat přiváděných na vstupní resp. výstupní neurony.\nVolbou aktivační funkce neuronů vstupní resp. výstupní vrstvy neuronové sítě můžeme určit způsob transformace dat na síť přiváděných:\nSigmoida\n:\nf\n(\nx\n)\n=\n(\n1\n+\ne\n−\np\n(\nx\n−\nϑ\n)\n)\n−\n1\n{\\displaystyle f(x)=(1+e^{-p(x-\\vartheta )})^{-1}}\n– z ad 1) a ad 2) (viz níže) plyne\np\n=\nln\n⁡\n0\n,\n95\n−\nln\n⁡\n0\n,\n05\n3\nσ\n≅\n1\nσ\n{\\displaystyle p={\\ln 0,95-\\ln 0,05 \\over 3\\sigma }\\cong {1 \\over \\sigma }}\nad 1) z\n0\n,\n95\n=\n(\n1\n+\ne\n−\n3\np\nσ\n)\n−\n1\n{\\displaystyle 0,95=(1+e^{-3p\\sigma })^{-1}}\nplyne\ne\n−\n3\np\nσ\n=\n0\n,\n05\n0\n,\n95\n{\\displaystyle e^{-3p\\sigma }={0,05 \\over 0,95}}\nad 2) z\n0\n,\n05\n=\n(\n1\n+\ne\n3\np\nσ\n)\n−\n1\n{\\displaystyle 0,05=(1+e^{3p\\sigma })^{-1}}\nplyne\ne\n3\np\nσ\n=\n0\n,\n95\n0\n,\n05\n{\\displaystyle e^{3p\\sigma }={0,95 \\over 0,05}}\nGaussova křivka\n:\ng\n(\nx\n)\n=\ne\n−\np\n(\nx\n−\nϑ\n)\n2\n{\\displaystyle g(x)=e^{-p(x-\\vartheta )^{2}}}\n– z\n0\n,\n05\n=\ne\n−\np\n6\nσ\n2\n{\\displaystyle 0,05=e^{-p6\\sigma ^{2}}}\nplyne\np\n=\n−\nln\n⁡\n0\n,\n05\n6\nσ\n2\n≅\n1\n2\nσ\n2\n{\\displaystyle p=-{\\ln 0,05 \\over 6\\sigma ^{2}}\\cong {1 \\over 2\\sigma ^{2}}}\nMexický klobouk\n:\nh\n(\nx\n)\n=\n−\nσ\n2\ng\n″\n(\nx\n)\n{\\displaystyle h(x)=-\\sigma ^{2}g''(x)}\n– uvedené transformaci resp. její nezáporné části odpovídají různá pásma citlivosti.\nParametry uvedených transformací mají následující význam:\nϑ –\nstřední hodnota\ndat přiváděných na daný neuron z trénovací množiny\nσ –\nsměrodatná odchylka\ndat přiváděných na daný neuron z trénovací množiny\nKromě uvedených aktivačních funkcí se užívají ještě jejich různé modifikace:\nIdentita\n– linearita modifikovaná posunutím středu symetrie do počátku\nHyperbolická tangenta\n– rozšíření oboru hodnot sigmoidy na interval od -1 do +1\nReLU\n– složení ostré linearity (vlevo od počátku) s identitou (vpravo od počátku)\nRadiální báze – Gaussova křivka resp. Mexický klobouk\nArchitektury sítě\nPříklady architektury neuronových sítí: rekurentní autoasociativní paměť RAM, samorganizující síť SOM, vícevrstvý perceptron MLP.\nPodle způsobů propojení neuronů existuje více různých architektur neuronových sítí, neurony se řadí do jednotlivých vrstev umístěných nad sebou:\n[\n27\n]\nDopředná neuronová síť\n:\nLineární heteroasociativní paměť\n– dvouvrstvá síť\nPerceptron\n– pouze jeden neuron\nVícevrstvý perceptron\n– libovolný počet skrytých vrstev (minimálně třívrstvá síť)\nSamoorganizující síť\n– dvouvrstvá síť\nRekurentní neuronová síť\n:\nLineární autoasociativní paměť\n– jednovrstvá síť\nNelineární autoasociativní paměť\n(Hopfieldova)\n– jednovrstvá síť\nNelineární heteroasociativní paměť\n(Bidirektní)\n– dvouvrstvá síť\nGrossbergova\nči\nART\ndvouvrstvá síť spojitého času\nUčení sítě\nCílem učení neuronové sítě je nastavit síť tak, aby dávala co nejpřesnější výsledky. V biologických sítích jsou zkušenosti uloženy v\nsynapsích\n. V umělých neuronových sítích jsou zkušenosti uloženy v jejich matematickém ekvivalentu – váhách vazeb neuronů. Učení neuronové sítě rozlišujeme na\nučení s učitelem (supervised learning)\na\nučení bez učitele (unsupervised learning)\n. Fáze učení neuronové sítě bývá nazývána\nadaptivní\n, fáze vybavování po naučení neuronové sítě bývá nazývána\naktivní\n. Adaptace vah vázajících neurony závisí na jejich stavech aktivace. V případě učení s učitelem jsou stavy výstupních neuronů sítě aktivovány na ně přiloženým vnějším stimulem (výrokem učitele), v případě učení bez učitele si stavy výstupních neuronů síť nastaví v závislosti na stavech vstupních neuronů sama, a to pomocí aktivní dynamiky sítě, tj. každý krok adaptivní dynamiky je proložen průběhem dynamiky aktivní.\n[\n27\n]\nUčení s učitelem\nPři učení s učitelem trénovací data sestávají ze vstupních objektů (vektorů jejich parametrů, tj. nezávisle proměnných) a jejich požadovaných výstupních ohodnocení, tj. závisle proměnných (obecně také ve tvaru vektorů), tj. výroků učitele o objektu. Podobně jako v biologických sítích je zde využita zpětná vazba. Neuronové síti je předložen vzor. Na základě aktuálního nastavení sítě je zjištěn aktuální výsledek. Ten porovnáme s vyžadovaným výsledkem a určíme chybu. Poté spočítáme nutnou korekci (dle typu neuronové sítě) a upravíme hodnoty vah tak, abychom snížili hodnotu chyby. Toto opakujeme až do dosažení námi stanovené povolené chyby. Poté je síť adaptována. Naučená funkce sítě pak dokáže odhadovat výstupní ohodnocení každého vstupního objektu, i neobsaženého v trénovacích datech, tj. musí umět zobecnit (generalizovat) souvislost mezi vstupy a výstupy danou příklady obsaženými v trénovacích datech. U neuronových sítí se učení s učitelem užívá\nvícevrstvého perceptronu\n.\n[\n28\n]\nPozn.: Pokud se vstupní objekty shodují s požadovanými výstupními ohodnoceními, mluvíme o tzv.\nsamoučení (self-supervised learning)\n, tj. síť (např.\nautoenkodér\n) se pak učí tzv. autoasociativní fuknkci.\nRozdíl mezi učením s učitelem (učitel označí, zda je objekt čtverec či trojúhelník) a bez učitele (síť podobné objekty nashlukuje, aniž by věděla jak se značí)\nUčení bez učitele\nNa rozdíl od učení s učitelem při učení bez učitele nejsou v trénovacích datech vstupní objekty provázané s jejich ohodnocením, tj. schází výrok učitele a učení bez učitele tedy vykazuje samoorganizaci sítě, která zachycuje vstupní vzory jako\nhustotu pravděpodobnosti\n.\n[\n29\n]\n[\n30\n]\nBěhem učení bez učitele si stavy výstupních neuronů síť nastaví sama v závislosti na stavech vstupních neuronů, nevyhodnocujeme tedy správnost výsledku, síť si vstupní vzory sama třídí přizpůsobením své konfigurace. Vzory třídí do skupin a reaguje dle jejich typického zástupce.\n[\n31\n]\nU neuronových sítí se učení bez učitele užívá u\nkompetičních\nsítí, které si výrok učitele nahrazují tzv.\nlaterální inhibicí\n.\n[\n27\n]\nPozn.: Kombinaci učení s učitelem a učení bez učitele označujeme jako\nsemi-supervised learning\n.\nMíra změn vah po jednotlivých vrstvách, daná tlumením zpětného šíření chyby, tj. první tři vrstvy se neučí prakticky vůbec, smysluplně se učí pouze poslední tři.\nHluboké učení\nHluboké učení\nje učení neuronových sítí s velkou hloubkou.\n[\n32\n]\nHloubkou sítě se myslí počet vrstev neuronů, které jsou propojeny tak, že výstup jedné vrstvy je vstupem vrstvy následující. U hlubokého učení se hloubka sítě nachází často v řádech desítek a více vrstev. Pro odhad parametrů sítě (trénování) se obvykle používá algoritmus zpětného šíření chyby. Trénování probíhá ve dvou fázích, tj. nejprve předučení sítě dopředným směrem např. pomocí\nautoenkodérů\n(samoučení) a poté doučení sítě zpětným směrem (učení s učitelem), eliminuje se tak tlumení zpětného šíření chyby. Metodologie hlubokého učení se prosadila kolem roku 2010 jako základní možnost pro řešení složitých problémů strojového učení jako je klasifikace obrazů, mluvené či psané řeči nebo překlady z jednoho přirozeného jazyka do jiného.\nModel synaptické vazby ohodnocené vahou w mezi vstupním a výstupním neuronem s úrovní aktivace x a y.\nHebbovské učení\nHebbův\n[\n33\n]\nprincip učení je způsob určování vah vzájemných orientovaných vazeb mezi umělými neurony jako ukládání úrovně aktivace vstupního neuronu vážené úrovní aktivace výstupního neuronu do váhy vazby mezi vstupním a výstupním neuronem. Váha vazby mezi oběma neurony se pak zvyšuje, pokud se oba neurony aktivují synchronně, a snižuje, pokud se aktivují asynchronně. Neurony, které jsou buď oba pozitivně aktivní současně nebo oba negativně aktivní současně, mají silné pozitivní váhy vzájemné vazby, zatímco ty, které jsou současně opačně aktivní, mají silné negativní váhy vzájemné vazby. Hebbovské učení se užívá u asociativních pamětí, jako je např.\nHopfieldova\nči\nbidirektní\nsíť. Pokud se do váhy vazby mezi vstupním a výstupním neuronem ukládá pouze úroveň aktivace vstupního resp. výstupního neuronu, jedná se o tzv.\ninstar\nresp.\noutstar\nučení.\nPřeučení\nPřeučení je stav, kdy je systém příliš přizpůsoben množině trénovacích dat, ale nemá schopnost generalizace a selhává na validační množině dat, tj. vykazuje sice minimální chybu na tréninkové množině, ale na validační množině vykazuje zcela chybné výsledky. To se může stát např. při malém rozsahu trénovací množiny nebo pokud je síť příliš mohutná (např. příliš mnoho neuronů skrytých vrstev resp. počet skrytých vrstev v síti). Řešením je zvětšení počtu prvků trénovací množiny, snížení mohutnosti sítě nebo snížení počtu  parametrů hodnoceného objektu, které v důsledku snižuje složitost učené funkce sítě. Krajním řešením je předčasné ukončení učení (průběžné sledování chyby na validační množině a konec učení ve chvíli, kdy se chyba na této množině dostane do svého minima).\nTrénovací data\nData určená pro učení neuronové sítě se skládají ze vstupních vektorů dat a v případě učení s učitelem z odpovídajících vstupních vektorů dat. Pro správné naučení neuronové sítě je obvykle potřeba dostatečně reprezentativní množství trénovacích dat. Neuronová síť aproximuje funkci, která ze vstupního vektoru vypočítá výstupní vektor a podle rozdílu od správného výstupního vektoru upraví své vnitřní parametry. Tento proces se opakuje, dokud není systém dostatečně naučen. Při učení se používají trénovací data, validační data či testovací data. Tato data mají být\ndisjunktní\n. Pomocí trénovacích dat probíhá vlastní učení, podle chování na validačních datech se kontroluje přeučování a na testovacích datech se určuje úspěšnost chování naučené sítě na nových, neznámých datech. Trénovací data se tedy dle způsobu užití dělí do tří skupin:\nTrénovací množina\nje sada dat, ve které učící algoritmus nachází určitý vztah mezi vstupy a výstupy, tj. provádí jejich\nregresní analýzu\n.\nValidační množina\nje sada dat, která se používají pro případnou úpravu parametrů učení ve snaze vyhnout se jeho přeučení. Systém je správně naučený tehdy, jestliže se shodnou úspěšností vyhodnocuje trénovací množinu i validační množinu. Pokud má vyhodnocení trénovací množiny výrazně vyšší úspěšnost, je systém přeučený.\nTestovací množina\nje sada dat, která se používají pro ověření kvality naučeného systému.\nV případě učení bez učitele se trénovací data skládají pouze ze vstupních vektorů dat obsažených v trénovací množině.\nAlgoritmus zpětného šíření chyby\nGradientní sestup - vpravo nahoře naznačeno uváznutí v lokálním minimu\nAlgoritmus zpětného šíření chyby (\nError backpropagation algorithm\n) je typická metoda učení umělých neuronových sítí. Používá se u\nvícevrstvých\nsítí při učení s učitelem, tedy pokud je na množině příkladů použitých k učení vždy znám požadovaný výsledek. Zpětné šíření chyby je založeno na metodě\ngradientního sestupu\n.\nKvalita naučení umělé neuronové sítě je popsána chybovou funkcí, nejčastěji kvadratickou chybou\n[\n27\n]\n:\nE\n=\n1\n2\n∑\nj\n=\n1\nN\n∑\ni\n=\n1\nn\n(\nz\ni\nj\n−\ny\ni\nj\n)\n2\n=\n∑\nj\n=\n1\nN\nE\nj\n{\\displaystyle E\\;=\\;{\\frac {1}{2}}\\sum \\limits _{j=1}^{N}\\sum \\limits _{i=1}^{n}(z_{ij}-y_{ij})^{2}\\;=\\;\\sum \\limits _{j=1}^{N}E_{j}}\n, pak\nΔ\nw\n=\n−\nα\n∂\nE\nj\n∂\nw\n{\\displaystyle \\Delta w\\;=\\;-\\alpha {\\partial E_{j} \\over \\partial w}}\nE\n{\\displaystyle E}\n– chyba\nN\n{\\displaystyle N}\n– počet vzorů předložených síti\nn\n{\\displaystyle n}\n– počet neuronů výstupní vrstvy\nz\ni\nj\n{\\displaystyle z_{ij}}\n– požadovaný výstup daného neuronu a daného vzorku\ny\ni\nj\n{\\displaystyle y_{ij}}\n– vypočítaný výstup daného neuronu a daného vzorku\nΔ\nw\n{\\displaystyle \\Delta w}\n– vektor přírůstků vah gradientního kroku\nα\n{\\displaystyle \\alpha }\n– velikost gradientního kroku\nZpětné šíření chyby\nJeden sestupný gradientní krok pak může vypadat následovně:\n[\n27\n]\nw\ni\nj\n(\nT\n)\n=\nw\ni\nj\n(\nT\n−\n1\n)\n+\nα\ny\ni\n(\nT\n)\ng\nj\n(\nx\nj\n(\nT\n)\n)\n+\nμ\nΔ\nw\ni\nj\n(\nT\n−\n1\n)\n{\\displaystyle w_{ij}\\left(T\\right)=w_{ij}\\left(T-1\\right)+\\alpha \\ y_{i}\\left(T\\right)\\ g_{j}(x_{j}(T))+\\mu \\ \\Delta w_{ij}\\left(T-1\\right)}\nϑ\ni\n(\nT\n)\n=\nϑ\ni\n(\nT\n−\n1\n)\n+\nα\ng\ni\n(\nx\ni\n(\nT\n)\n)\n+\nμ\nΔ\nϑ\ni\n(\nT\n−\n1\n)\n{\\displaystyle {\\vartheta }_{i}\\left(T\\right)={\\vartheta }_{i}\\left(T-1\\right)+\\alpha \\ g_{i}(x_{i}(T))+\\mu \\ \\Delta {\\vartheta }_{i}\\left(T-1\\right)}\np\ni\n(\nT\n)\n=\np\ni\n(\nT\n−\n1\n)\n+\nα\nx\ni\n(\nT\n)\ng\ni\n(\nx\ni\n(\nT\n)\n)\n+\nμ\nΔ\np\ni\n(\nT\n−\n1\n)\n{\\displaystyle p_{i}\\left(T\\right)=p_{i}\\left(T-1\\right)+\\alpha \\ x_{i}\\left(T\\right)\\ g_{i}(x_{i}(T))+\\mu \\ \\Delta p_{i}\\left(T-1\\right)}\ng\nk\n(\nx\nk\n)\n=\np\nk\ny\nk\n(\n1\n−\ny\nk\n)\n(\nz\nk\n−\ny\nk\n)\ng\ni\n(\nx\ni\n)\n=\np\ni\ny\ni\n(\n1\n−\ny\ni\n)\n∑\nj\ng\nj\n(\nx\nj\n)\nw\ni\nj\n{\\displaystyle g_{k}(x_{k})=p_{k}y_{k}(1-y_{k})(z_{k}-y_{k})\\ \\ \\ \\ \\ g_{i}(x_{i})=p_{i}y_{i}\\left(1-y_{i}\\right)\\sum _{j}{g_{j}(x_{j})\\ w_{ij}}}\nk\n∈\nV\nM\n,\nj\n∈\nV\nL\n,\ni\n∈\nV\nL\n−\n1\n,\nL\n∈\n{\n2\n,\n…\n,\nM\n}\n,\nT\n∈\n{\n1\n,\n…\n,\nN\n}\n{\\displaystyle k\\in V_{M},j\\in V_{L},i\\in V_{L-1},L\\in \\left\\{2,\\dots ,M\\right\\},T\\in \\left\\{1,\\dots ,N\\right\\}}\nx\ni\n{\\displaystyle x_{i}}\n– potenciál i-tého neuronu\ny\ni\n{\\displaystyle y_{i}}\n– skutečný stav i-tého neuronu\nz\ni\n{\\displaystyle z_{i}}\n– požadovaný stav i-tého neuronu\ng\ni\n{\\displaystyle g_{i}}\n– adaptační funkce i-tého neuronu\np\ni\n{\\displaystyle p_{i}}\n– strmost aktivační funkce i-tého neuronu\nϑ\ni\n{\\displaystyle \\vartheta _{i}}\n– práh i-tého neuronu\nw\ni\nj\n{\\displaystyle w_{ij}}\n– váha vazby i-tého neuronu s j-tým neuronem\nα\n{\\displaystyle \\alpha }\n– velikost gradientního sestupného kroku\nμ\n{\\displaystyle \\mu }\n– míra setrvačnosti gradientního sestupu\nV\nL\n{\\displaystyle V_{L}}\n– populace neuronů L-té vrstvy\nM\n{\\displaystyle M}\n– počet vrstev sítě\nΔ\n{\\displaystyle \\Delta }\n– předcházející přírůstek příslušné proměnné\nCílem učení je minimalizovat\nchybovou funkci\nzávislou na vstupních vahách neuronů, přičemž\ngradientní sestup\nobecně najde pouze\nlokální minimum\n, proto se do gradientního sestupu zavádí jistá jeho setrvačnost, spočívající v míře respektování směru jeho minulého sestupného kroku, tj. k aktuálnímu gradientu se připočte minulý gradient a aktuální sestupný krok se provede ve směru jejich součtu. Tato deformace gradientního sestupu pak umožní vyklouznutí z mělkého lokálního minima. Učení neuronové sítě spočívá ve změně vah vstupů neuronů. Algoritmus zpětného šíření chyby v každém kroku postupuje v následujících třech fázích:\nAplikují se učící vzory a pro každý vzor se postupně směrem vpřed napočítají výstupy (vstupní signál se sítí šíří směrem dopředu).\nNapočítané výstupy se porovnají s požadovanými výstupy, tj. spočte se chyba, jak byla popsána výše.\nNa základě spočtené chyby se počítají hodnoty adaptačních funkcí ve směru od poslední vrstvy k první vrstvě (pro výpočet hodnoty adaptačních funkcí podřazené vrstvy již musí být vypočteny hodnoty adaptačních funkcí nadřazené vrstvy), tj. spočítá se gradient chybové funkce, na základě kterého se provede sestupný gradientní krok, tj. upraví se vstupní váhy neuronů tak, že klesne hodnota chyby. Výpočet tedy postupuje zpětně od výstupní vrstvy až po vstupní vrstvu (odtud zpětné šíření chyby), váhy se mění podle jejich vlivu na chybu.\nOdkazy\nReference\n↑\nHOŘEJŠ, J.; KUFUDAKI, O.\nPočítače a mozek (neuropočítače)\n. [s.l.]: SOFSEM, 1988. 38 s.\n↑\nVENKATESAN, Ragav; LI, Baoxin.\nConvolutional Neural Networks in Visual Computing: A Concise Guide\n. [s.l.]: CRC Press, 2017-10-23.\nDostupné online\n.\nISBN\n978-1-351-65032-8\n. (anglicky)\nJe zde použita šablona\n{{\nCite book\n}}\noznačená jako k „pouze dočasnému použití“.\n↑\nZHA, Xiong; PENG, Hua; QIN, Xin; LI, Guang.\nA Deep Learning Framework for Signal Detection and Modulation Classification\n. [s.l.]: MDPI, 2019-9-19.\nDostupné online\n. (anglicky)\nJe zde použita šablona\n{{\nCite book\n}}\noznačená jako k „pouze dočasnému použití“.\n↑\nKOHONEN, Teuvo.\nThe self-organizing map\n. [s.l.]: Proceedings of the IEEE 78 (9), 1990. 17 s. (anglicky)\n↑\nA Beginner's Guide to Word2Vec and Neural Word Embeddings.\nPathmind\n[online]. [cit. 2022-10-29].\nDostupné online\n. (anglicky)\n↑\nGROSSBERG, Stephen.\nRecurrent neural networks\n. [s.l.]: Scholarpedia, 2013.\nDostupné online\n. (anglicky)\n↑\na\nb\nMCCULLOCH, W. S. T.; PITTS, W.\nA logical calculus of the ideas immanent in nervous activity. Bulletin of Mathematical Biophysics 5\n. [s.l.]: [s.n.], 1943. 19 s. (anglicky)\n↑\nROSENBLATT, F.\nThe Perceptron - a perceiving and recognizing automaton, Report 85–460–1, Cornell Aeronautical Laboratory\n. [s.l.]: [s.n.], 1957. (anglicky)\n↑\nHAGAN, Martin T.\nNeural network design\n. druhé. vyd. [s.l.]: [s.n.], 2014. 800 s.\nDostupné online\n. (anglicky)\n↑\nStuart Dreyfus:\nArtificial Neural Networks, Back Propagation and the Kelley-Bryson Gradient Procedure.\nIn:\nJ. Guidance, Control and Dynamics.\n1990.\n↑\nJürgen Schmidhuber\n:\nDeep learning in neural networks: An overview.\nIn:\nNeural Networks.\n61, 2015, S. 85–117.\nArXiv\n↑\nJürgen Schmidhuber:\nDeep Learning.\nIn:\nScholarpedia.\n10(11), 2015, S. 328–332.\nSection on Backpropagation\n↑\nHenry J. Kelley:\nGradient theory of optimal flight paths.\nIn:\nArs Journal.\n30(10), 1960, S. 947–954.\n(online)\n↑\nArthur E. Bryson:\nA gradient method for optimizing multi-stage allocation processes.\nIn:\nProceedings of the Harvard Univ. Symposium on digital computers and their applications.\nApril 1961.\n↑\nStuart Dreyfus:\nThe numerical solution of variational problems.\nIn:\nJournal of Mathematical Analysis and Applications.\n5(1), 1962, S. 30–45.\n(online)\n↑\nA. E. Bryson, W. F. Denham, S. E. Dreyfus:\nOptimal programming problems with inequality constraints. I: Necessary conditions for extremal solutions.\nIn:\nAIAA J.\n1, 11, 1963, S. 2544–2550.\n↑\nSeppo Linnainmaa\n:\nThe representation of the cumulative rounding error of an algorithm as a Taylor expansion of the local rounding errors.\nMaster’s Thesis (in Finnish), Univ. Helsinki, 1970, S. 6–7.\n↑\nSeppo Linnainmaa\n:\nTaylor expansion of the accumulated rounding error.\nIn:\nBIT Numerical Mathematics.\n16(2), 1976, S. 146–160.\n↑\nAndreas Griewank:\nWho Invented the Reverse Mode of Differentiation?\nOptimization Stories. In:\nDocumenta Matematica.\nExtra Volume ISMP, 2012, S. 389–400.\n↑\nAndreas Griewank, Andrea Walther:\nPrinciples and Techniques of Algorithmic Differentiation.\n2. Auflage. SIAM, 2008.\n↑\nStuart Dreyfus:\nThe computational solution of optimal control problems with time lag.\nIn:\nIEEE Transactions on Automatic Control.\n18(4), 1973, S. 383–385.\n↑\nPaul Werbos\n:\nBeyond regression: New tools for prediction and analysis in the behavioral sciences.\nPhD thesis. Harvard University 1974.\n↑\nPaul Werbos:\nApplications of advances in nonlinear sensitivity analysis.\nIn:\nSystem modeling and optimization.\nSpringer, Berlin/ Heidelberg 1982, S. 762–770.\n(online)\n↑\nDavid E. Rumelhart\n,\nGeoffrey E. Hinton\n,\nRonald J. Williams\n:\nLearning representations by back-propagating errors.\nIn:\nNature\n.\nBand 323, 1986, S. 533–536.\n↑\nEric A. Wan:\nTime series prediction by using a connectionist network with internal delay lines.\nIn:\nSanta Fe Institute Studies in the Sciences of Complexity-Proceedings.\nVol. 15, Addison-Wesley Publishing Co., 1993, S. 195–195.\n↑\nHINDMARSH, J. L.; ROSE, R. M.\nA model of neuronal bursting using three coupled first order differential equations. Biological Sciences 221 (1222)\n. London: The Royal Society, 1984. 16 s. (anglicky)\n↑\na\nb\nc\nd\ne\nf\nKŘIVAN, Miloš.\nUmělé neuronové sítě\n. první. vyd. Praha: Oeconomica, 2021. 76 s.\nDostupné online\n.\nISBN\n978-80-245-2420-7\n.\n↑\nGENTLEMAN, R.; CAREY, V. J.\nSupervised Machine Learning. Bioconductor Case Studies\n. New York: Springer, 2008. 16 s.\nDostupné online\n.\nISBN\n978-0-387-77239-4\n. (anglicky)\n↑\nHINTON, Geoffrey; SEJNOWSKI, Terrence.\nUnsupervised Learning: Foundations of Neural Computation\n. [s.l.]: MIT Press, 1999.\nISBN\n978-0262581684\n.\nJe zde použita šablona\n{{\nCite book\n}}\noznačená jako k „pouze dočasnému použití“.\n↑\nGENTLEMAN, R.; CAREY, V. J.\nUnsupervised Machine Learning. Bioconductor Case Studies\n. New York: Springer, 2008. 21 s.\nDostupné online\n.\nISBN\n978-0-387-77239-4\n. (anglicky)\n↑\nGARLÍK, B.; KŘIVAN, M.\nIdentification of type daily diagrams of electric consumption based on cluster analysis of multi-dimensional data by neural network\n. [s.l.]: Neural Network World 3/13, 2013.\nDostupné online\n. S. 271-283. (EN)\n↑\nGOODFELLOW, Ian; BENGIO, Yoshua; COURVILLE, Aaron.\nDeep Learning\n. [s.l.]: MIT Press, 2016. 767 s.\nDostupné online\n. (anglicky)\n↑\nHEBB, D.O.\nThe Organization of Behavior\n. New York: Wiley & Sons, 1949.\nDostupné online\n. (anglicky)\nSouvisející články\nModulární neuronová síť\nElmanova Jordanova neuronová síť\nPolynomiální neuronová síť\nExterní odkazy\nObrázky, zvuky či videa k tématu\numělá neuronová síť\nna Wikimedia Commons\nUmělá neuronová síť\nv\nČeské terminologické databázi knihovnictví a informační vědy (TDKIV)\nPředpovídání pomocí neuronové sítě\n– včetně Java appletu pro experimenty s předpovídáním funkce\nPortály\n:\nInformační věda a knihovnictví\nCitováno z „\nhttps://cs.wikipedia.org/w/index.php?title=Umělá_neuronová_síť&oldid=25469332\n“"}
{"docID": 11, "source": "https://cs.wikipedia.org/wiki/Skryt%C3%BD_Markov%C5%AFv_model", "text": "title: skrytý markovův model\nurl: https://cs.wikipedia.org/wiki/Skryt%C3%BD_Markov%C5%AFv_model\ntext: Skrytý Markovův model\n(\nanglicky\nhidden Markov model\n– zkráceně\nHMM\n) je statistický\nMarkovův model\n, který modeluje systém za předpokladu, že jde o Markovův proces se skrytými (nepozorovanými) stavy. HMM může být znázorněn pomocí nejjednodušší dynamické\nbayesovské sítě\n. Matematické základy modelu vyvinul\nLeonard E. Baum\n(1931–2017) spolu se svým týmem spolupracovníků.\n[\n1\n]\n[\n2\n]\n[\n3\n]\nProblematika velmi úzce souvisí s dřívější prací\nRuslana L. Stratonoviche\n(1930–1997), který pracoval na lineárním\nproblému filtrování\n[\n4\n]\na jako první popsal\ndopředně zpětný algoritmus\n.\nV jednodušších Markovových modelech (jako je\nMarkovův řetězec\n) je stav systému viditelný pozorovateli, tudíž pravděpodobnost změny stavu je jediný parametr modelu. Naopak ve\nskrytých\nMarkovových modelech stav není pozorovateli viditelný, ale výstup, který je na stavu závislý, viditelný je. Každý stav má pravděpodobnostní vliv na výstup systému. Tedy posloupnost výstupů skrytého Markovova modelu vypovídá o posloupnosti vnitřních stavů, která tuto posloupnost vygenerovala. Přívlastek\nskrytý\nse tedy vztahuje na posloupnost vnitřních stavů, kterými model prošel, nikoliv na parametry modelu (model se nazývá\nskrytý\n, ačkoliv jsou jeho parametry dány přesně a jsou známé).\nSkryté Markovovy modely jsou známé zejména na poli rozpoznávání časových vzorů. Mezi ně spadá například\nrozpoznávání řeči\n, rukou psaného písma, gest\n[\n5\n]\nnebo označování slovních druhů (part of speech tagging). Využití nalézá také v\nbioinformatice\n.\nSkryté Markovovy modely lze považovat za zobecnění\nsmíšených modelů\n, ve kterých nejsou skryté proměnné (nebo\nlatentní proměnné\n) nezávislé jedna na druhé, ale naopak jsou navzájem spojené Markovovým procesem. V poslední době byly skryté Markovovy modely zobecněny na párové Markovovy modely a tripletové Markovovy modely, které umožňují využití modelu i na komplexnější datové struktury\n[\n6\n]\n[\n7\n]\na modelování nestacionárních dat.\n[\n8\n]\n[\n9\n]\nPopis pomocí problému uren\nPravděpodobnostní parametry skrytého Markovova modelu (příklad):\nX\n— stavy modelu\ny\n— možná pozorování modelu\na\n— pravděpodobnost přechodu mezi stavy\nb\n— pravděpodobnosti výstupů\nV jeho diskrétní formě lze skrytý Markovův proces znázornit zobecněním tzv.\nproblému uren\n, ve kterém je každý objekt před dalším krokem navrácen do své původní urny.\n[\n10\n]\nUvažujeme následující příklad: v místnosti, do které pozorovatel nevidí, je duch. Místnost obsahuje urny X1, X2, X3… Každá z uren obsahuje známý počet různých míčků. Míčky jsou označené y1, y2, y3… Duch náhodně vybere jednu z uren a vytáhne z ní náhodný míček. Míček následně položí na přepravní pás, který jej vyveze ven. Pozorovatel tedy vidí posloupnost vytažených míčků, ale není mu známa posloupnost uren, ze kterých bylo taženo. Duch k výběru urny využívá následující postup: výběr urny pro vytažení\nn\n-tého míčku závisí pouze na náhodném čísle a na výběru urny pro vytažení (\nn\n−1)-ho míčku. Výběr míčku tedy přímo nezávisí na sekvenci předešlých uren ze kterých bylo taženo, ale pouze na urně, ze které byl vytažen n-1 míček. A proto se jedná o\nMarkovův proces\n. Tento proces popisuje horní část obrázku.\nSamotný Markovův proces nemůže být pozorován (lze pozorovat pouze sekvenci výstupů), a proto se tomuto procesu říká skrytý Markovův proces. Znázorňuje to spodní část obrázku, ze kterého je patrné, že v každém stavu může být tažen míček y1, y2, y3 nebo y4. Tedy ačkoliv pozorovatel zná rozmístění uren a právě viděl posloupnost tří vytažených míčků, nemůže si být jistý, ze které urny duch vytáhl třetí míček. Lze pouze určit pravděpodobnosti, s jakými byl třetí míček z jednotlivých uren vytažen.\nReference\n↑\nBAUM, L. E.; PETRIE, T. Statistical Inference for Probabilistic Functions of Finite State Markov Chains.\nThe Annals of Mathematical Statistics\n. 1966, s. 1554–1563.\nDostupné online\n[cit. 28 November 2011].\ndoi\n:\n10.1214/aoms/1177699147\n.\nJe zde použita šablona\n{{\nCite journal\n}}\noznačená jako k „pouze dočasnému použití“.\n↑\nBAUM, L. E.; SELL, G. R. Growth transformations for functions on manifolds.\nPacific Journal of Mathematics\n. 1968, s. 211–227.\nDostupné online\n[cit. 28 November 2011].\ndoi\n:\n10.2140/pjm.1968.27.211\n.\nJe zde použita šablona\n{{\nCite journal\n}}\noznačená jako k „pouze dočasnému použití“.\n↑\nBAUM, L.E. An Inequality and Associated Maximization Technique in Statistical Estimation of Probabilistic Functions of a Markov Process.\nInequalities\n. 1972, s. 1–8.\nJe zde použita šablona\n{{\nCite journal\n}}\noznačená jako k „pouze dočasnému použití“.\n↑\nSTRATONOVICH, R. L. Conditional Markov Processes. S. 156–178.\nTheory of Probability & Its Applications\n[online]. 1960-01 [cit. 2020-12-10]. Roč. 5, čís. 2, s. 156–178.\ndoi\n:\n10.1137/1105015\n. (anglicky)\n↑\nSTARNER, Thad; PENTLAND, Alex. Real-time American Sign Language recognition from video using hidden Markov models. S. 265–270.\nProceedings of International Symposium on Computer Vision – ISCV\n[online]. 1995-11 [cit. 2020-12-10]. S. 265–270.\nDostupné online\n.\ndoi\n:\n10.1109/ISCV.1995.477012\n. (anglicky)\n↑\nPIECZYNSKI, Wojciech. Multisensor triplet Markov chains and theory of evidence. S. 1–16.\nInternational Journal of Approximate Reasoning\n[online]. 2007-05 [cit. 2020-12-10]. Roč. 45, čís. 1, s. 1–16.\nDostupné online\n.\ndoi\n:\n10.1016/j.ijar.2006.05.001\n. (anglicky)\n↑\nBOUDAREN, Mohamed El Yazid; MONFRINI, Emmanuel; PIECZYNSKI, Wojciech; AÏSSANI, Amar. Dempster–Shafer fusion of multisensor signals in nonstationary Markovian context. S. 134.\nEURASIP Journal on Advances in Signal Processing\n[online]. 2012-12 [cit. 2020-12-10]. Roč. 2012, čís. 1, s. 134.\nDostupné online\n.\ndoi\n:\n10.1186/1687-6180-2012-134\n. (anglicky)\n↑\nLANCHANTIN, P.; PIECZYNSKI, W. Unsupervised restoration of hidden nonstationary Markov chains using evidential priors. S. 3091–3098.\nIEEE Transactions on Signal Processing\n[online]. 2005-08 [cit. 2020-12-10]. Roč. 53, čís. 8, s. 3091–3098.\nDostupné online\n.\ndoi\n:\n10.1109/TSP.2005.851131\n. (anglicky)\n↑\nBOUDAREN, M. E. Y.; MONFRINI, E.; PIECZYNSKI, W. Unsupervised Segmentation of Random Discrete Data Hidden With Switching Noise Distributions. S. 619–622.\nIEEE Signal Processing Letters\n[online]. 2012-10 [cit. 2020-12-10]. Roč. 19, čís. 10, s. 619–622.\nDostupné online\n.\ndoi\n:\n10.1109/LSP.2012.2209639\n. (anglicky)\n↑\nRABINER, Lawrence R. A tutorial on hidden Markov models and selected applications in speech recognition. S. 257–286.\nProceedings of the IEEE\n[online]. 1989-02 [cit. 2020-12-10]. Roč. 77, čís. 2, s. 257–286.\nDostupné online\n.\ndoi\n:\n10.1109/5.18626\n. (anglicky)\nExterní odkazy\nObrázky, zvuky či videa k tématu\nSkrytý Markovův model\nna Wikimedia Commons\nPahýl\nTento článek je příliš stručný nebo\npostrádá důležité informace\n.\nPomozte Wikipedii tím, že jej vhodně\nrozšíříte\n. Nevkládejte však\nbez oprávnění\ncizí texty.\nCitováno z „\nhttps://cs.wikipedia.org/w/index.php?title=Skrytý_Markovův_model&oldid=25421475\n“"}
{"docID": 12, "source": "https://cs.wikipedia.org/wiki/Z%C3%ADsk%C3%A1v%C3%A1n%C3%AD_informac%C3%AD", "text": "title: získávání informací\nurl: https://cs.wikipedia.org/wiki/Z%C3%ADsk%C3%A1v%C3%A1n%C3%AD_informac%C3%AD\ntext: Tento článek potřebuje úpravy.\nMůžete Wikipedii pomoci tím, že ho\nvylepšíte\n. Jak by měly články vypadat, popisují stránky\nVzhled a styl\n,\nEncyklopedický styl\na\nOdkazy\n.\nKonkrétní problémy:\ncelková\nwikifikace\n, formát dle\nWikipedie:ES\nZískávání informací\n(\nanglicky\ninformation retrieval\n; IR) je činnost, během které člověk získává ze sbírky\ninformačních zdrojů\nrelevantní informace. Vyhledávání mohou být založena na\nfulltextových\nnebo na dalších obsahových parametrech. Získávání informací je vědecká disciplína zaobírající se hledáním informací v dokumentu, vyhledáváním samotných dokumentů a také vyhledáváním metadat, která popisují data, a databází textů, obrázků nebo zvuků.\nAutomatické systémy získávání informací pomáhají snižovat „informační zahlcení”. Mnoho univerzit a veřejných knihoven využívá takové systémy k zajištění přístupu k různým knihám, časopisům a jiným dokumentům. Nejviditelnější službou získávání informací jsou webové vyhledávače.\nPřehled\nProces získávání informací začíná momentem, kdy uživatel zadá dotaz do systému. Dotazy jsou formálními zápisy požadavku na informace, příkladem mohou být textové řetězce ve webových vyhledávačích. V procesu získávání informace nemusí dotaz jednoznačně identifikovat právě jeden objekt v souboru. Namísto toho může dotazu odpovídat vícero objektů více či méně relevantních.\nObjekt je entita, která je reprezentovaná informací v souboru obsahů nebo databáze. Uživatelské dotazy jsou porovnávány s informacemi v databázi. Na rozdíl od klasických SQL dotazů z databází mohou i nemusí výsledky získávání informací přesně odpovídat dotazu, proto jsem většinou ohodnoceny. Toto hodnocení výsledků vytváří klíčový rozdíl mezi hledáním získávání informace a databázovým hledáním.\n[\n1\n]\nDatovými objekty mohou být například textové dokumenty, obrázky, audio,\nmyšlenkové mapy\nnebo videa. Často nejsou dokumenty uchovávány nebo ukládány přímo do systému získávání informací, ale jsou zde reprezentovány zástupci či metadaty.\nVětšina systémů získávání informací vypočítá ke každému objektu skóre podle toho, jak se shoduje s hledaným dotazem, a seřadí je podle těchto hodnot. Objekty s nejvyšším skóre jsou pak zobrazeny uživateli. Celý proces může být zopakován, pokud si to uživatel přeje.\nHistorie\nVyužívat počítače ke hledání relevantních informací bylo myšlenkou, kterou zpopularizoval článek\nAs We May Think\nod\nVannevar Bush\nv roce 1945. Zdá se, že byl Bush inspirován patenty na statistický stroj, se kterým přišel ve 20. a 30. letech Emanuel Goldberg. Statistický stroj hledal dokumenty uložené na filmovém pásu. První popis počítačového hledání informací představil Holmstrom v roce 1948 a informoval rovněž počítači Univac. Automatizovaný systém získávání informací byl představen v 50. letech: jeden se dokonce objevil v romantické komedii Desk Set z roku 1957. V 60. letech byla založena první velká výzkumná skupina zaměřující se na získávání informací, iniciátorem jejího vzniku byl Gerard Salton na\nCornellově univerzitě\n. Do 70. let se objevilo několik různých technik získávání informací, které měly velmi slušné výsledky na menších korpusech textů, jakými byla například Cranfield collection (čítající několik tisíc dokumentů). Velké systémy (jako například Lockheed Dialog system) se začaly používat na začátku 70. let.\n[\n2\n]\nV roce 1992 spolusponzoroval US Department of Defense společně s National Institute of Standards and Technology (NIST) setkání Text Retrieval Conference (TREC), které bylo součástí TIPSTER text program. Cílem tohoto setkání bylo nahlédnout komunitu vzniklou okolo problematiky získávání informací. To vyvolalo výzkum metod, které se zaměřovaly na obrovské korpusy. Příchod webových vyhledávačů ještě více posílil potřebu po rozsáhlých vyhledávacích systémech.\nTypy modelů\nPro efektivní získávání relevantních dokumentů pomocí strategií získávání informací jsou dokumenty většinou transformovány do vhodné reprezentace. Každá „získávací” strategie obsahuje konkrétní model pro reprezentaci dokumentů.\nPrvní dimenze: matematický základ\nMnožinové modely reprezentují dokumenty jako množiny slov či frází. Podobnosti jsou obvykle odvozeny z množinových operací těchto struktur. Běžné modely jsou:\nStandardní booleovský model\nRozšířený booleovský model\nFuzzy retrieval\nAlgebraické modely reprezentují dokumenty a dotazy jako vektory, matice nebo n–tice. Skalární hodnoty potom odpovídají podobnosti vektoru dotazu a vektoru dokumentu.\nVektorový model\nZobecněný vektorový model\n(Rozšířený) tematický vektorový model\nRozšířený booleovský model\nLatentní sématincká analýza\nPravděpodobnostní modely přistupují k procesu výběru dokumentu jako k pravděpodobnostnímu odvozování. Podobnost je vypočítána z pravděpodobnosti, že dokument odpovídá danému dotazu. V těchto modelech se často využívají tvrzení z teorie pravděpodobnosti.\nBinárně nezávislý model\nPravděpodobnostní modely relevantnosti na kterých je založena např. funkce BM25.\nOdvozování nejistoty\nLingvistická analýza\nModel divergence-from-randomness\nLatentní Dirichletova alokace\nModely typu feature-based retrieval\nDruhá dimenze: vlastnosti modelu\nModely bez termínové provázanosti přistupují k různým termínům/slovům nezávisle. Ve vektorových modelech to znamená předpoklad ortogonality termínových vektorů, v pravděpodobnostních modelech předpoklad nezávislosti termínových proměnných. Modely s provázaností neoddělitelných termínů umožňují reprezentovat provázanost mezi termíny. Ovšem model sám definuje míru provázanosti dvou termínů. To je obvykle přímo či nepřímo odvozeno z toho, jak se objevují spolu v dokumentech v korpusu. Modely s transcendentní provázaností termínů také umožňují reprezentovat provázanost mezi termíny, ale nepředepisují provázanost mezi dvěma termíny. Míru provázanosti určují externí zdroje (např. lidé nebo specializované algoritmy).\nČasová osa\n19. století\n1801: Joseph Marie Jacquard vynalézá ruční tkalcovský stav s žakárovým ústrojím, což je první přístroj, který využívá děrné štítky. Díky nim se dají kontrolovat a ovládat jednotlivé nitě a jednoduše tak vytvářet složité vzory.\n80. léta 19. století: John Shaw Billings a Herman Hollerith vynalezli počítačový stroj pracující s děrnými štítky, který umožňoval rychle zpracovávat mnoho dat.\n1890: Shawovy a Hollerithovy děrné štítky a děrnoštítkový stroj jsou využity pro sčítání lidu ve Spojených státech\n20. – 30. léta 20. století\nEmanuel Goldberg předkládá patenty na \"Statistical Machine” (tj. statistický stroj), což je vyhledávač dokumentů, který využívá fotoelektrické buňky a rozpoznávací paterny k vyhledávání na rolích mikrofilmových dokumentů.\n40. – 50. léta\nkonec 40. let: Americká armáda čelí problému, jak indexovat The US military confronted problems of indexing and retrieval of wartime scientific research documents captured from Germans.\n1945: Článek As We May Think Vannevara Bushe vychází v Atlantic Monthly.\n1947: Hans Peter Luhn (výzkumný inženýr v\nIBM\nod roku 1941) začíná pracovat na mechanizovaném systému děrných štítků, který pomáhá vyhledávat chemické sloučeniny.\n50. léta: Rostoucí obavy o technologické zaostávání USA se SSSR podporují financování vědy, což napomáhá vyvíjet například mechanizované vyhledávací systémy literatury (Allen Kent a skupina okolo něj) či indexování citací (Eugene Garfield).\n1950: Termín \"information retrieval” (tj. získávání informací) byl poprvé použit Calvin Mooers.\n1951: Philip Bagley provedl v magisterské práci na MIT první experiment v oblasti počítačového vyhledávání dokumentů.\n1955: Allen Kent nastoupil na Case Western Reserve University a stal se poté zástupcem ředitele Center for Documentation and Communications Research.\n1958: International Conference on Scientific Information Washington DC included consideration of IR systems as a solution to problems identified.\n1959: Hans Peter Luhn publikovat text Auto-encoding of documents for information retrieval.\n60. léta\npočátek 60. let: Gerard Salton začal na Harvardu pracovat v oblasti získávání informací, později pokračoval na Cornell\n1960: Melvin Earl Maron and John Lary Kuhns zveřejnili text \"On relevance, probabilistic indexing, and information retrieval\" v časopise Journal of the ACM; Cyril W. Cleverdon zveřejnil své první poznatky z Cranfield studies, které rozvíjejí model pro hodnocení systémů na získávání informací; Kent zveřejnil text Information Analysis and Retrieval.\n1963: Weinbergova zpráva \"Science, Government and Information\" vyjádřila myšlenku „krize vědecké informace.” Zpráva je pojmenována po Alvinovi Weinbergovi; Joseph Becker a Robert M. Hayes zveřejnili text týkající se získávání informací.\n1964: Karen Spärck Jones dokončila svou doktorskou práci na Cambridge s názvem Synonymy and Semantic Classification a pokračovala s prací v oblasti matematické lingvistiky; National Bureau of Standards sponzoroval symposium s názvem \"Statistical Association Methods for Mechanized Documentation.\" Ze sympozia vzešlo několik důležitých textů, včetně první zmínky o SMART systému G. Saltona.\npolovina 60. let:\nNational Library of Medicine\nvyvinula MEDLARS Medical Literature Analysis and Retrieval System, první velkou strojově čitelnou databázi a batch-retrieval systém; projekt Intrex na MIT.\n1965: J. C. R. Licklider publikuje Libraries of the Future.\n1966: Don Swanson se zapojil do studia požadavků na budoucí katalogy na\nUniversity of Chicago\nkonec 60. let: F. Wilfrid Lancaster dokončil hodnotící studie systému Medlars a publikoval první verzi svého textu týkajícího se získávání informací.\n1968 : Gerard Salton zveřejnil Automatic Information Organization and Retrieval; John W. Sammon, Jr. nastínil ve své zprávě \"Some Mathematics of Information Storage and Retrieval...\"\nvektorový model\n1969: Sammonův text \"A nonlinear mapping for data structure analysis\" (IEEE Transactions on Computers) byl prvním návrhem vizuálního rozhraní pro systém získávání informací.\n70. léta\npočátek 70. let: První online systémy—NLM's AIM-TWX, MEDLINE; Lockheed's Dialog; SDC's ORBIT; Theodor Nelson představuje koncept hypertextu, je publikována jeho kniha Computer Lib/Dream Machines.\n1971: Nicholas Jardine a Cornelis J. van Rijsbergen zveřejňují text \"The use of hierarchic clustering in information retrieval\", ve kterém vyslovují myšlenku \"cluster hypothesis.\"\n1978: První ročník ACM SIGIR konference.\n1979: C. J. van Rijsbergen publikoval text Information Retrieval. Silný důraz na modely pravděpodobnosti.\n1979: Tamas Doszkocs implementoval uživatelské rozhraní jazyka CITE pro systém MEDLINE v National Library of Medicine. CITE podporoval zadání volného formuláře, hodnocení výstupu a relevantní zpětnou vazbu.\n80. léta\n1980: První ročník mezinárodní ACM SIGIR konference, pořádanou společně s British Computer Society IR group v Cambridge.\n1982: Nicholas J. Belkin, Robert N. Oddy, and Helen M. Brooks navrhli ASK (Anomalous State of Knowledge). To byla zásadní myšlenka, ačkoliv se jejich automatický analytický nástroj ukázal jako nedostačující.\n1983: Salton (a Michael J. McGill) vydali Introduction to Modern Information Retrieval, se silným důrazem na vektorové modely.\n1985: David Blair a Bill Maron vydávají: An Evaluation of Retrieval Effectiveness for a Full-Text Document-Retrieval System\npolovina 80. let: Snahy vyvinout komerční systémy získávání informací přímo pro koncové uživatele.\n1985–1993: Zásadní testy týkající se vizuálních rozhraní a experimentálních systémů téhož. Práce Donalda B. Crouche, Roberta R. Korfhageho, Matthewa Chalmerse, Anselma Spoerriho a dalších.\n1989: První návrhy Tima Bernerse-Lee k World Wide Web v CERN.\n90. léta\n1992: První TREC konference.\n1997: Vydání knihy Information Storage and Retrieval Roberta F. Korfhageho s důrazem na vizualizaci a systémy multirefenčních bodů.\nkonec 90. let: Webové vyhledávače obsahují mnoho funkcí, které se dříve využívaly jen v experimentálních verzích systémů získávání dat. Vyhledávače se stali nejběžnějším a možná nejlepším využitím modelů získávání informací.\nReference\nV tomto článku byl použit\npřeklad\ntextu z článku\nInformation retrieval\nna anglické Wikipedii.\n↑\nJANSEN, B. J.; RIEH, S. The Seventeen Theoretical Constructs of Information Searching and Information Retrieval.\nJournal of the American Society for Information Sciences and Technology\n. 2010, roč. 61, čís. 8, s. 1517–1534.\nDostupné v archivu\npořízeném dne 2016-03-04. (angličtina)\n↑\nSANDERSON, Mark; CROFT, Bruce W.\nThe History of Information Retrieval Research\n[online]. 2012.\nDostupné online\n. (angličtina)\nExterní odkazy\nObrázky, zvuky či videa k tématu\nzískávání informací\nna Wikimedia Commons\nCitováno z „\nhttps://cs.wikipedia.org/w/index.php?title=Získávání_informací&oldid=25444197\n“"}
{"docID": 13, "source": "https://cs.wikipedia.org/wiki/Dolov%C3%A1n%C3%AD_z_textu", "text": "title: dolování z textů\nurl: https://cs.wikipedia.org/wiki/Dolov%C3%A1n%C3%AD_z_textu\ntext: Dolování z textu\n(anglicky\ntext mining\n) je vědecká disciplína na pomezí\ndolování z dat\n,\nstrojového učení\na\npočítačové lingvistiky\n. Vyvíjí se především s potřebou automatického zpracování ohromného množství informací dostupných v podobě volného textu. Klasické metody dolování z dat totiž pracují pouze se strukturovanými daty (obsahujícími\nmetadata\ndůležitá pro zpracování) a většina informací jim tak zůstává nepřístupná.\n[\n1\n]\nTypické úlohy\nUrčování druhu textů\nCílem určování druhu textů, anglicky\ntext categorization,\nje přiřadit k danému textu jednu, či více kategorií z předem daného výčtu (např. sport, politika, krimi…). Typicky je prováděno na základě četností slov vyskytujících se v textech jednotlivých kategorií některou z technik strojového učení.\nShlukování textů/dokumentů\nShlukování textů/dokumentů\n, anglicky\ndocument clustering,\n[\n2\n]\nje úloha principiálně podobná určování druhu textů. Místo zařazování do předem daných kategorií jsou však jednotlivé texty dávány do skupin na základě jejich vzájemných podobností. Každý dokument je tak obvykle zařazen právě do jedné skupiny. Vytvořené skupiny mohou, ale nemusí odpovídat očekávaným kategoriím (burzovní zprávy a sportovní výsledky mohou například spadnout do jedné kategorie na základě faktu, že obsahují větší množství čísel).\nShrnutí textu\nShrnutí textu, anglicky\ntext summary.\nK vytvoření krátkého shrnutí textu se dá přistupovat dvěma způsoby, buď z textu vybrat nejdůležitější pasáže (např. věty) a ty vhodně seřadit (\nsummary extraction\n) anebo je možné text hlouběji analyzovat a na základě jeho sémantické reprezentace parafrázovat jeho obsah (\nsummary abstraction\n). Druhý z obou přístupů by měl poskytovat lepší výsledky, ve skutečnosti však\nsémantická analýza\nani následné generování souvislého textu dosud není na takové úrovni, aby překonala výsledky prvně zmíněného přístupu.\nAnalýza sentimentu\nPodrobnější informace naleznete v článku\nAnalýza sentimentu\n.\nAnalýza sentimentu, anglicky\nsentiment analysis.\nNa základě výskytu\ncitově zabarvených slov\nlze usuzovat na autorův pozitivní či negativní postoj k předmětu zprávy. To může být užitečná informace obzvláště ve spojení s tematicky zaměřenými diskusními fóry.\nExtrakce konceptů; rozpoznání pojmenovaných entit\nV angličtině\nconcept extraction\nči konkrétněji\nnamed-entity recognition\n(NRE).\nJde o určení entit, které jsou v textu zmíněny. Nástroj pro NRE by je měl identifikovat a zároveň klasifikovat. do předem definovaných kategorií.\n[\n3\n]\nNapříklad v článku o V. Klausovi by tedy výrazy „Václav Klaus“ a „prezident“ měly být přiřazeny stejné entitě. Problém úzce souvisí s\ndesambiguací slovních významů\na tudíž patří k těm základním problémům zpracování přirozeného jazyka.\nUrčení vztahu mezi entitami\nDokážeme-li v textu určit pojmenované entity, můžeme na základě analýzy vět (např. pomocí rámců –\nFrameNet\n) určit jejich vztahy (např. z výrazu \"Sarkozy se oženil s Bruinovou\" je možné získat vztah, že Bruinová je manželkou Sarkozyho).\nOdkazy\nReference\n↑\nUnstructured Data and the 80 Percent Rule.\nwww.clarabridge.com\n[online]. [cit. 2010-06-10].\nDostupné v archivu\npořízeném dne 2010-07-02.\n↑\nWayback Machine.\nweb.archive.org\n[online]. [cit. 2023-07-08].\nDostupné v archivu\npořízeném z\noriginálu\ndne 2023-07-08.\n↑\nROZPOZNÁVÁNÍ POJMENOVANÝCH ENTIT | Nový encyklopedický slovník češtiny.\nwww.czechency.org\n[online]. [cit. 2022-04-10].\nDostupné online\n.\nExterní odkazy\nObrázky, zvuky či videa k tématu\ndolování z textu\nna Wikimedia Commons\nCitováno z „\nhttps://cs.wikipedia.org/w/index.php?title=Dolování_z_textu&oldid=25375429\n“"}
{"docID": 14, "source": "https://cs.wikipedia.org/wiki/Viterbiho_algoritmus", "text": "title: viterbiho algoritmus\nurl: https://cs.wikipedia.org/wiki/Viterbiho_algoritmus\ntext: Viterbiho algoritmus\nje\nalgoritmus\ndynamického programování\npro hledání/nalezení nejpravděpodobnější posloupnosti skrytých stavů – nazývané\nViterbiho cesta\n– jehož výsledkem je posloupnost pozorovaných událostí, především v kontextu\nMarkovových informačních zdrojů\na\nskrytých Markovových modelů\n.\nPojmy „Viterbiho cesta“ a „Viterbiho algoritmus“ se používají i pro další podobné algoritmy dynamického programování, které hledají nejpravděpodobnější vysvětlení určitého pozorování. Například algoritmus dynamického programování pro\nstatistické parsování\nlze použít na hledání nejpravděpodobnějšího bezkontextového odvození (parse) řetězce, který se někdy nazývá „Viterbiho odvození“.\nAlgoritmus navrhl\nAndrew Viterbi\nv roce 1967 pro dekódování\nkonvolučních kódů\nna digitálních komunikačních linkách se šumem\n[\n1\n]\n. Od té doby se používá při dekódování\nkonvolučních kódů\npoužívaných v mobilních sítích\nCDMA\na\nGSM\ni v běžných\ntelefonních modemech\n, pro komunikaci se satelity a kosmickými sondami do vzdáleného vesmíru, i v bezdrátových sítích podle standardu\n802.11\n. Často se používá i při\nrozpoznávání\na\nsyntéze řeči\n, v\npočítačové lingvistice\n, pro\nvyhledávání klíčových slov\na v\nbioinformatice\n. Například při\nrozpoznávání řeči\nse zvukový signál považuje za pozorovanou posloupnost událostí, a\ntextový řetězec\nza „skrytou příčinu“ zvukového signálu. Viterbiho algoritmus hledá nejpravděpodobnější řetězec textu k danému zvukovému signálu.\nAlgoritmus\nPředpokládejme, že je dán\nskrytý Markovův model\n(HMM) se stavovým prostorem\nS\n{\\displaystyle S}\n, pravděpodobnostmi\nπ\ni\n{\\displaystyle \\pi _{i}}\nzačátku ve stavu\ni\n{\\displaystyle i}\n(počáteční pravděpodobnosti), pravděpodobnostmi\na\ni\n,\nj\n{\\displaystyle a_{i,j}}\npro přechod ze stavu\ni\n{\\displaystyle i}\ndo stavu\nj\n{\\displaystyle j}\n(přechodové pravděpodobnosti). Pokud pozorujeme výstupní posloupnost\ny\n1\n,\n…\n,\ny\nT\n{\\displaystyle y_{1},\\dots ,y_{T}}\n, pak nejpravděpodobnější posloupnost stavů\nx\n1\n,\n…\n,\nx\nT\n{\\displaystyle x_{1},\\dots ,x_{T}}\n, která produkuje pozorovaný výstup, je dána rekurentními vztahy:\n[\n2\n]\nV\n1\n,\nk\n=\nP\n(\ny\n1\n|\nk\n)\n⋅\nπ\nk\nV\nt\n,\nk\n=\nP\n(\ny\nt\n|\nk\n)\n⋅\nmax\nx\n∈\nS\n(\na\nx\n,\nk\n⋅\nV\nt\n−\n1\n,\nx\n)\n{\\displaystyle {\\begin{array}{rcl}V_{1,k}&=&\\mathrm {P} {\\big (}y_{1}\\ |\\ k{\\big )}\\cdot \\pi _{k}\\\\V_{t,k}&=&\\mathrm {P} {\\big (}y_{t}\\ |\\ k{\\big )}\\cdot \\max _{x\\in S}\\left(a_{x,k}\\cdot V_{t-1,x}\\right)\\end{array}}}\nkde\nV\nt\n,\nk\n{\\displaystyle V_{t,k}}\nje pravděpodobnost nejpravděpodobnější posloupnosti stavů odpovědné za prvních\nt\n{\\displaystyle t}\npozorování, jejíž koncový stav je\nk\n{\\displaystyle k}\n. Pro získání Viterbiho cesty lze používat zpětné ukazatele, které zachycují, jaký stav\nx\n{\\displaystyle x}\nbyl použit ve druhé rovnici. Nechť\nP\nt\nr\n(\nk\n,\nt\n)\n{\\displaystyle \\mathrm {Ptr} (k,t)}\nje funkce, která vrací hodnotu\nx\n{\\displaystyle x}\npoužitou pro výpočet\nV\nt\n,\nk\n{\\displaystyle V_{t,k}}\npokud\nt\n>\n1\n{\\displaystyle t>1}\n, nebo\nk\n{\\displaystyle k}\npokud\nt\n=\n1\n{\\displaystyle t=1}\n. Pak:\nx\nT\n=\narg\n⁡\nmax\nx\n∈\nS\n(\nV\nT\n,\nx\n)\nx\nt\n−\n1\n=\nP\nt\nr\n(\nx\nt\n,\nt\n)\n{\\displaystyle {\\begin{array}{rcl}x_{T}&=&\\arg \\max _{x\\in S}(V_{T,x})\\\\x_{t-1}&=&\\mathrm {Ptr} (x_{t},t)\\end{array}}}\n(používáme standardní definici\narg max\n).\nSložitost tohoto algoritmu je\nO\n(\nT\n×\n|\nS\n|\n2\n)\n{\\displaystyle O(T\\times \\left|{S}\\right|^{2})}\n.\nPseudokód\nPokud je dán prostor pozorování\nO\n=\n{\no\n1\n,\no\n2\n,\n…\n,\no\nN\n}\n{\\displaystyle O=\\{o_{1},o_{2},\\dots ,o_{N}\\}}\n, stavový prostor\nS\n=\n{\ns\n1\n,\ns\n2\n,\n…\n,\ns\nK\n}\n{\\displaystyle S=\\{s_{1},s_{2},\\dots ,s_{K}\\}}\n, posloupnost pozorování\nY\n=\n{\ny\n1\n,\ny\n2\n,\n…\n,\ny\nT\n}\n{\\displaystyle Y=\\{y_{1},y_{2},\\ldots ,y_{T}\\}}\n, matice přechodů\nA\n{\\displaystyle A}\nvelikosti\nK\n×\nK\n{\\displaystyle K\\times K}\ntak, že\nA\ni\nj\n{\\displaystyle A_{ij}}\nobsahuje přechodovou pravděpodobnost přechodu ze stavu\ns\ni\n{\\displaystyle s_{i}}\ndo stavu\ns\nj\n{\\displaystyle s_{j}}\n, výstupní matice\nB\n{\\displaystyle B}\nvelikosti\nK\n×\nN\n{\\displaystyle K\\times N}\ntaková, že\nB\ni\nj\n{\\displaystyle B_{ij}}\nobsahuje pravděpodobnosti pozorování\no\nj\n{\\displaystyle o_{j}}\nze stavu\ns\ni\n{\\displaystyle s_{i}}\n, pole počátečních pravděpodobností\nπ\n{\\displaystyle \\pi }\nvelikosti\nK\n{\\displaystyle K}\ntakové, že\nπ\ni\n{\\displaystyle \\pi _{i}}\nobsahuje pravděpodobnost, že\nx\n1\n==\ns\ni\n{\\displaystyle x_{1}==s_{i}}\n. Nechť posloupnost\nX\n=\n{\nx\n1\n,\nx\n2\n,\n…\n,\nx\nT\n}\n{\\displaystyle X=\\{x_{1},x_{2},\\ldots ,x_{T}\\}}\nje cestou, která generuje pozorování\nY\n=\n{\ny\n1\n,\ny\n2\n,\n…\n,\ny\nT\n}\n{\\displaystyle Y=\\{y_{1},y_{2},\\ldots ,y_{T}\\}}\n.\nV tomto problému dynamického programování vytváříme dvě dvourozměrné tabulky\nT\n1\n,\nT\n2\n{\\displaystyle T_{1},T_{2}}\nvelikosti\nK\n×\nT\n{\\displaystyle K\\times T}\n. Každý prvek\nT\n1\n{\\displaystyle T_{1}}\n,\nT\n1\n[\ni\n,\nj\n]\n{\\displaystyle T_{1}[i,j]}\n, obsahuje pravděpodobnost zatím nejpravděpodobnější cesty\nX\n^\n=\n{\nx\n^\n1\n,\nx\n^\n2\n,\n…\n,\nx\n^\nj\n}\n{\\displaystyle {\\hat {X}}=\\{{\\hat {x}}_{1},{\\hat {x}}_{2},\\ldots ,{\\hat {x}}_{j}\\}}\ns\nx\n^\nj\n=\ns\ni\n{\\displaystyle {\\hat {x}}_{j}=s_{i}}\n, která generuje\nY\n=\n{\ny\n1\n,\ny\n2\n,\n…\n,\ny\nj\n}\n{\\displaystyle Y=\\{y_{1},y_{2},\\ldots ,y_{j}\\}}\n. Každý prvek\nT\n2\n{\\displaystyle T_{2}}\n,\nT\n2\n[\ni\n,\nj\n]\n{\\displaystyle T_{2}[i,j]}\n, obsahuje\nx\n^\nj\n−\n1\n{\\displaystyle {\\hat {x}}_{j-1}}\nzatím nejpravděpodobnější cesty\nX\n^\n=\n{\nx\n^\n1\n,\nx\n^\n2\n,\n…\n,\nx\n^\nj\n−\n1\n,\nx\n^\nj\n}\n{\\displaystyle {\\hat {X}}=\\{{\\hat {x}}_{1},{\\hat {x}}_{2},\\ldots ,{\\hat {x}}_{j-1},{\\hat {x}}_{j}\\}}\npro každé\nj\n,\n2\n≤\nj\n≤\nT\n{\\displaystyle j,2\\leq j\\leq T}\nNaplníme položky dvou tabulek\nT\n1\n[\ni\n,\nj\n]\n,\nT\n2\n[\ni\n,\nj\n]\n{\\displaystyle T_{1}[i,j],T_{2}[i,j]}\nrostoucí posloupností\nK\n⋅\nj\n+\ni\n{\\displaystyle K\\cdot j+i}\n.\nT\n1\n[\ni\n,\nj\n]\n=\nmax\nk\n(\nT\n1\n[\nk\n,\nj\n−\n1\n]\n⋅\nA\nk\ni\n⋅\nB\ni\ny\nj\n)\n{\\displaystyle T_{1}[i,j]=\\max _{k}{(T_{1}[k,j-1]\\cdot A_{ki}\\cdot B_{iy_{j}})}}\n, a\nT\n2\n[\ni\n,\nj\n]\n=\narg\n⁡\nmax\nk\n(\nT\n1\n[\nk\n,\nj\n−\n1\n]\n⋅\nA\nk\ni\n⋅\nB\ni\ny\nj\n)\n{\\displaystyle T_{2}[i,j]=\\arg \\max _{k}{(T_{1}[k,j-1]\\cdot A_{ki}\\cdot B_{iy_{j}})}}\nVSTUP:  Prostor pozorování\nO\n=\n{\no\n1\n,\no\n2\n,\n…\n,\no\nN\n}\n{\\displaystyle O=\\{o_{1},o_{2},\\dots ,o_{N}\\}}\n,\nstavový prostor\nS\n=\n{\ns\n1\n,\ns\n2\n,\n…\n,\ns\nK\n}\n{\\displaystyle S=\\{s_{1},s_{2},\\dots ,s_{K}\\}}\n,\nposloupnost pozorování\nY\n=\n{\ny\n1\n,\ny\n2\n,\n…\n,\ny\nT\n}\n{\\displaystyle Y=\\{y_{1},y_{2},\\ldots ,y_{T}\\}}\ntaková, že\ny\nt\n==\ni\n{\\displaystyle y_{t}==i}\npokud\npozorování v čase\nt\n{\\displaystyle t}\nje\no\ni\n{\\displaystyle o_{i}}\n,\nmatice přechodů\nA\n{\\displaystyle A}\nvelikosti\nK\n⋅\nK\n{\\displaystyle K\\cdot K}\ntak, že\nA\ni\nj\n{\\displaystyle A_{ij}}\nobsahuje přechodovou\npravděpodobnost přechodu ze stavu\ns\ni\n{\\displaystyle s_{i}}\ndo stavu\ns\nj\n{\\displaystyle s_{j}}\n,\nemission matrix\nB\n{\\displaystyle B}\nvelikosti\nK\n⋅\nN\n{\\displaystyle K\\cdot N}\ntak, že\nB\ni\nj\n{\\displaystyle B_{ij}}\nobsahuje pravděpodobnost\npozorování\no\nj\n{\\displaystyle o_{j}}\nze stavu\ns\ni\n{\\displaystyle s_{i}}\n,\npole počátečních pravděpodobností\nπ\n{\\displaystyle \\pi }\nvelikosti\nK\n{\\displaystyle K}\ntakové, že\nπ\ni\n{\\displaystyle \\pi _{i}}\nobsahuje pravděpodobnost, že\nx\n1\n==\ns\ni\n{\\displaystyle x_{1}==s_{i}}\nVÝSTUP: Nejpravděpodobnější skrytá posloupnost stavů\nX\n=\n{\nx\n1\n,\nx\n2\n,\n…\n,\nx\nT\n}\n{\\displaystyle X=\\{x_{1},x_{2},\\ldots ,x_{T}\\}}\nA01\nfunction\nVITERBI\n(O, S, π, Y, A, B): X\nA02\nfor\neach state\ns\ni\ndo\nA03\nT\n1\n[i,1]\n←\nπ\ni\n⋅\n{\\displaystyle \\cdot }\nB\ni\ny\n1\n{\\displaystyle y_{1}}\nA04\nT\n2\n[i,1]\n←0\nA05\nend for\nA06\nfor\ni\n←\n2\n,\n3\n…,\nT\ndo\nA07\nfor\neach state\ns\nj\ndo\nA08\nT\n1\n[j,i]\n←\nmax\nk\n(\nT\n1\n[\nk\n,\ni\n−\n1\n]\n⋅\nA\nk\nj\n⋅\nB\nj\ny\ni\n)\n{\\displaystyle \\max _{k}{(T_{1}[k,i-1]\\cdot A_{kj}\\cdot B_{jy_{i}})}}\nA09\nT\n2\n[j,i]\n←\narg\n⁡\nmax\nk\n(\nT\n1\n[\nk\n,\ni\n−\n1\n]\n⋅\nA\nk\nj\n⋅\nB\nj\ny\ni\n)\n{\\displaystyle \\arg \\max _{k}{(T_{1}[k,i-1]\\cdot A_{kj}\\cdot B_{jy_{i}})}}\nA10\nend for\nA11\nend for\nA12\nz\nT\n←\narg\n⁡\nmax\nk\n(\nT\n1\n[\nk\n,\nT\n]\n)\n{\\displaystyle \\arg \\max _{k}{(T_{1}[k,T])}}\nA13\nx\nT\n←s\nz\nT\nA14\nfor\ni\n←\nT\n,\nT-1\n…,\n2\ndo\nA15\nz\ni-1\n←T\n2\n[z\ni\n,i]\nA16\nx\ni-1\n←\ns\nz\ni-1\nA17\nend for\nA18\nreturn\nX\nA19\nend function\nPříklad\nPředstavte si lékaře, který má pečovat o ženu císaře trpící neustále se vracející nemocí. Projevy nemoci lze léčit; tato léčba je nepříjemná, ale nemocné uleví. Problém je, že lékař císařovnu nemůže sám vyšetřit, dostává pouze každý třetí den lísteček s informací, jak se císařovna cítí (výborně, slabě, na umření). Na základě těchto informací má lékař posoudit, zda je císařovna zdravá nebo nemocná a má být podrobena léčbě.\nLékař se domnívá, že zdravotní stav císařovny se chová jako diskrétní\nMarkovův řetězec\n. Situaci, kdy lékař nemůže přímo zkoumat zdravotní stav císařovny, lze popsat jako\nskrytý Markovův model\n(HMM).\nLékař ví, jaká je pravděpodobnost nemoci císařovny a jak pravděpodobně se cítí, když je zdravá nebo nemocná. Jinak řečeno parametry HMM jsou známé. Mohou být reprezentovány následujícím programem v jazyce\nPython\n:\nstates\n=\n(\n'Zdravá'\n,\n'Nemocná'\n)\nobservations\n=\n(\n'výborně'\n,\n'slabě'\n,\n'na umření'\n)\nstart_probability\n=\n{\n'Zdravá'\n:\n0.6\n,\n'Nemocná'\n:\n0.4\n}\ntransition_probability\n=\n{\n'Zdravá'\n:\n{\n'Zdravá'\n:\n0.7\n,\n'Nemocná'\n:\n0.3\n},\n'Nemocná'\n:\n{\n'Zdravá'\n:\n0.4\n,\n'Nemocná'\n:\n0.6\n},\n}\nemission_probability\n=\n{\n'Zdravá'\n:\n{\n'výborně'\n:\n0.5\n,\n'slabě'\n:\n0.4\n,\n'na umření'\n:\n0.1\n},\n'Nemocná'\n:\n{\n'výborně'\n:\n0.1\n,\n'slabě'\n:\n0.3\n,\n'na umření'\n:\n0.6\n},\n}\nV tomto kusu kódu\nstart_probability\nreprezentuje lékařovo přesvědčení, v jakém stavu je HMM, když dostal první zprávu o tom, jak se císařovna cítí (jediné, co ví, je, že je častěji zdravá). Zde použité rozložení pravděpodobnosti není vyvážené; podle přechodové pravděpodobnosti by bylo přibližně\n{'Zdravá': 0.57, 'Nemocná': 0.43}\n.\ntransition_probability\nreprezentuje změnu zdravotního stavu ve skrytém Markovově řetězci. V tomto příkladě je jenom 30% pravděpodobnost, že za tři dny bude císařovna nemocná, když je dnes zdravá.\nemission_probability\nreprezentuje pravděpodobnosti jednotlivých informací. Pokud je císařovna zdravá, je 50% pravděpodobnost, že se cítí výborně; pokud je nemocná, je 60% pravděpodobnost, že se cítí na umření.\nNa obrázcích jsou použity názvy z původního anglického příkladu (skryté zdravotní stavy jsou Healthy = Zdravá, Fever = Nemocná; oznámené pocity jsou Dizzy = na umření, Cold = slabě, Normal = výborně)\nGrafická reprezentace zadaného HMM\nLékař dostal s postupně tři zprávy o tom, jak se císařovna cítí, první zpráva byla výborně, druhá slabě, třetí na umření a chce zjistit, jaká je nejpravděpodobnější posloupnost zdravotních stavů císařovny, která by vysvětlila tato pozorování? Odpověď poskytne Viterbiho algoritmus:\n# Vizualizace Viterbiho algoritmu.\ndef\nprint_dptable\n(\nV\n):\nprint\n(\n\"    \"\n),\nfor\ni\nin\nrange\n(\nlen\n(\nV\n)):\nprint\n(\n\"\n%7d\n\"\n%\ni\n),\nprint\n()\nfor\ny\nin\nV\n[\n0\n]\n.\nkeys\n():\nprint\n(\n\"\n%.5s\n: \"\n%\ny\n),\nfor\nt\nin\nrange\n(\nlen\n(\nV\n)):\nprint\n(\n\"\n%.7s\n\"\n%\n(\n\"\n%f\n\"\n%\nV\n[\nt\n][\ny\n])),\nprint\n()\ndef\nviterbi\n(\nobs\n,\nstates\n,\nstart_p\n,\ntrans_p\n,\nemit_p\n):\nV\n=\n[{}]\npath\n=\n{}\n# Initialize base cases (t == 0)\nfor\ny\nin\nstates\n:\nV\n[\n0\n][\ny\n]\n=\nstart_p\n[\ny\n]\n*\nemit_p\n[\ny\n][\nobs\n[\n0\n]]\npath\n[\ny\n]\n=\n[\ny\n]\n# Run Viterbi for t > 0\nfor\nt\nin\nrange\n(\n1\n,\nlen\n(\nobs\n)):\nV\n.\nappend\n({})\nnewpath\n=\n{}\nfor\ny\nin\nstates\n:\n(\nprob\n,\nstate\n)\n=\nmax\n([(\nV\n[\nt\n-\n1\n][\ny0\n]\n*\ntrans_p\n[\ny0\n][\ny\n]\n*\nemit_p\n[\ny\n][\nobs\n[\nt\n]],\ny0\n)\nfor\ny0\nin\nstates\n])\nV\n[\nt\n][\ny\n]\n=\nprob\nnewpath\n[\ny\n]\n=\npath\n[\nstate\n]\n+\n[\ny\n]\n# Don't need to remember the old paths\npath\n=\nnewpath\nprint_dptable\n(\nV\n)\n(\nprob\n,\nstate\n)\n=\nmax\n([(\nV\n[\nlen\n(\nobs\n)\n-\n1\n][\ny\n],\ny\n)\nfor\ny\nin\nstates\n])\nreturn\n(\nprob\n,\npath\n[\nstate\n])\nArgumenty funkce\nviterbi\njsou:\nobs\nje posloupnost pozorování, např.\n['výborně', 'slabě', 'na umření']\n;\nstates\nje množina skrytých stavů;\nstart_p\nje start pravděpodobnost;\ntrans_p\njsou přechodové pravděpodobnosti; a\nemit_p\njsou výstupní pravděpodobnosti. Pro jednoduchost kódu předpokládáme, že posloupnost pozorování\nobs\nje neprázdná a že\ntrans_p[i][j]\na\nemit_p[i][j]\njsou definované pro všechny stavy i,j.\nV našem příkladě se dopředný Viterbiho algoritmus používá takto:\ndef\nexample\n():\nreturn\nviterbi\n(\nobservations\n,\nstates\n,\nstart_probability\n,\ntransition_probability\n,\nemission_probability\n)\nprint\n(\nexample\n())\nTo ukazuje, že pozorování\n['výborně', 'slabě', 'na umření']\nbyla s největší pravděpodobností generována posloupností stavů\n['Zdravá', 'Zdravá', 'Nemocná']\n. Jinými slovy, na základě pozorovaných dat byla císařovna s největší pravděpodobností při odeslání první a druhé zprávy zdravá (poprvé se cítila výborně, podruhé slabě), a při odeslání třetí byla nemocná.\nFunkci Viterbiho algoritmu lze vizualizovat pomocí\ntrellis diagramu\n. Viterbiho cesta je v zásadě nejkratší cesta tímto trellisem. Trellis pro příklad s císařovnou je níže; odpovídající Viterbiho cesta je tučně:\nAnimace trellis diagramu Viterbiho algoritmu. Po třetí informaci o stavu je nejpravděpodobnější cesta\n['Zdravá', 'Zdravá', 'Nemocná']\nPři implementaci Viterbiho algoritmu je nutné zmínit, že mnoho jazyků používá aritmetiku s\npohyblivou řádovou čárkou\n– pokud jsou hodnoty pravděpodobností malé, může dojít k\npodtečení\nvýsledku. Obvyklá technika, jak se tomu vyhnout, je používat během celého výpočtu\nlogaritmus pravděpodobnosti\n, tatáž technika použitá v\nLogarithmic Number System\n. Po skončení algoritmu lze získat správnou hodnotu pomocí\nexponenciální funkce\n.\nRozšíření\nZobecnění Viterbiho algoritmu nazývané\nmax-sum algoritmus\n(nebo\nmax-product algoritmus\n) lze použít pro nalezení nejpravděpodobnějšího přiřazení všech nebo určitých podmnožinách\nskrytých proměnných\nve velkém množství\ngrafických modelů\n, např.\nbayesovské sítě\n,\nMarkov náhodná pole\na\npodmíněná náhodná pole\n. Skryté proměnné musí být obecně propojeny nějakým způsobem na HMM, s omezeným počtem spojení mezi proměnnými a určitým typem lineární struktury mezi proměnnými. Obecný algoritmus využívá mechanismus\npředávání zpráv\na v zásadě se podobá algoritmu\nbelief propagation\n(který je zobecněním\nforward-backward algoritmu\n).\nPomocí algoritmu nazývaného\niterativní Viterbiho dekódování\nlze najít podposloupnost pozorování, která vyhovuje nejlépe (v průměru) dané HMM. Tento algoritmus navrhl Qi Wang, etc.\n[\n3\n]\npro zpracování\nturbo kódů\n. Iterativní Viterbi dekódování pracuje iterativně vyvoláním modifikovaného Viterbiho algoritmu, znovu odhadnutím skóre pro výplňku při konvergenci.\nNedávno byl navržen alternativní algoritmus,\nlíný Viterbiho algoritmus\n[\n4\n]\n. Pro mnoho kódů používaných v praxi, při rozumném šumu, je\ndekodér\npoužívající líný Viterbiho algoritmus mnohem rychlejší než tradiční Viterbiho dekodér\n[\n5\n]\n. Líný Viterbiho algoritmus neexpanduje uzly, dokud to není opravdu nutné, a obvykle vyžaduje mnohem méně výpočtů, aby došel ke stejnému výsledku jako normální Viterbiho algoritmus – není ho však snadné hardwarově\nparalelizovat\n.\nExistuje rozšíření Viterbiho algoritmu, aby pracoval s deterministickým konečným automatem pro zlepšení rychlosti při stochastické konverzi písmen na fonémy\n[\n6\n]\n.\nSouvisející články\nBaum–Welchův algoritmus\nForward-backward algoritmus\nForward algoritmus\nSamoopravný kód\nViterbiho algoritmus s měkkým výstupem\nViterbiho dekodér\nMarkovův model\ni\nSkrytý Markovův model\nPart-of-speech tagging\nLiteratura\nViterbi AJ. Error bounds for convolutional codes a an asymptotically optimum decoding algorithm.\nIEEE Transactions on Information Theory\n. 1967, s. 260–269.\nDostupné online\n.\ndoi\n:\n10.1109/TIT.1967.1054010\n.\nJe zde použita šablona\n{{\nCite journal\n}}\noznačená jako k „pouze dočasnému použití“.\n(note: the Viterbi decoding algoritmus je described in section IV.) Subscription required.\nFeldman J, Abou-Faycal I, Frigo M. A Fast Maximum-Likelihood Decoder for Convolutional Codes.\nVehicular Technology Conference\n. 2002, s. 371–375.\ndoi\n:\n10.1109/VETECF.2002.1040367\n.\nJe zde použita šablona\n{{\nCite journal\n}}\noznačená jako k „pouze dočasnému použití“.\nForney GD. The Viterbi algorithm.\nProceedings of the IEEE\n. 1973, s. 268–278.\nDostupné online\n.\ndoi\n:\n10.1109/PROC.1973.9030\n.\nJe zde použita šablona\n{{\nCite journal\n}}\noznačená jako k „pouze dočasnému použití“.\nSubscription required.\nPRESS, WH; TEUKOLSKY, SA; VETTERLING, WT; FLANNERY, BP.\nNumerical Recipes: The Art of Scientific Computing\n. 3rd. vyd. [s.l.]: Cambridge University Press, 2007.\nISBN\n978-0-521-88068-8\n. Kapitola\nSection 16.2. Viterbi Decoding\n.\nJe zde použita šablona\n{{\nCite book\n}}\noznačená jako k „pouze dočasnému použití“.\nRabiner LR. A tutorial on hidden Markov models and selected applications in speech recognition.\nProceedings of the IEEE\n. 1989, s. 257–286.\ndoi\n:\n10.1109/5.18626\n.\nJe zde použita šablona\n{{\nCite journal\n}}\noznačená jako k „pouze dočasnému použití“.\n(Describes the forward algoritmus and Viterbi algorithm for HMMs).\nShinghal, R. a\nGodfried T. Toussaint\n, \"Experiments in text recognition with the modified Viterbi algoritmus,\"\nIEEE Transactions on Pattern Analysis a Machine Intelligence\n, Vol. PAMI-l, April 1979, pp. 184–193.\nShinghal, R. a\nGodfried T. Toussaint\n, \"The sensitivity of the modified Viterbi algoritmus to the source statistics,\"\nIEEE Transactions on Pattern Analysis a Machine Intelligence\n, vol. PAMI-2, March 1980, pp. 181–185.\nReference\nV tomto článku byl použit\npřeklad\ntextu z článku\nViterbi algorithm\nna anglické Wikipedii.\n↑\n29 Apr 2005, G. David Forney Jr: The Viterbi Algorithm: A Personal History\n↑\nXing E, slide 11\n↑\nQi Wang, Lei Wei; Rodney A. Kennedy. Iterative Viterbi Decoding, Trellis Shaping,a Multilevel Structure for High-Rate Parity-Concatenated TCM.\nIEEE TRANSACTIONS ON COMMUNICATIONS\n. 2002, s. 48–55.\nJe zde použita šablona\n{{\nCite journal\n}}\noznačená jako k „pouze dočasnému použití“.\n↑\n(December 2002) \"\nA fast maximum-likelihood decoder for convolutional codes\n\" (PDF) in\nVehicular Technology Conference\n.: 371–375.\ndoi\n:\n10.1109/VETECF.2002.1040367\n.\nJe zde použita šablona\n{{\nCite conference\n}}\noznačená jako k „pouze dočasnému použití“.\n↑\n(December 2002) \"\nA fast maximum-likelihood decoder for convolutional codes\n\" (PDF) in\nVehicular Technology Conference\n..\ndoi\n:\n10.1109/VETECF.2002.1040367\n.\nJe zde použita šablona\n{{\nCite conference\n}}\noznačená jako k „pouze dočasnému použití“.\n↑\nLuk, R.W.P., R.I. Damper. Computational complexity of a fast Viterbi decoding algoritmus for stochastic letter-phoneme transduction.\nIEEE Trans. Speech a Audio Processing\n. 1998, s. 217–225.\ndoi\n:\n10.1109/89.668816\n.\nJe zde použita šablona\n{{\nCite journal\n}}\noznačená jako k „pouze dočasnému použití“.\nImplementace\nC a Jazyk symbolických adres\nC\nC++\nC++ a Boost\nautor: Antonio Gulli\nC#\nF#\nJava\nPerl\nProlog\nVHDL\nExterní odkazy\nObrázky, zvuky či videa k tématu\nViterbiho algoritmus\nna Wikimedia Commons\nImplementace v jazyce Java, F#, Clojure, C# na Wikibooks\nUčební text\n[\nnedostupný zdroj\n]\no konvolučním kódování s Viterbiho dekódováním, autor: Chip Fleming\nHistorie Viterbiho algoritmu\n, autor: David Forney\nJemný úvod do dynamického programování a Viterbiho algoritmu\nUčební text o sadě nástrojů pro modelování skrytého Markovova modelu (implementovaná v jazyce C), který obsahuje popis Viterbiho algoritmu\nCitováno z „\nhttps://cs.wikipedia.org/w/index.php?title=Viterbiho_algoritmus&oldid=25431057\n“"}
{"docID": 15, "source": "https://cs.wikipedia.org/wiki/U%C4%8Den%C3%AD_bez_u%C4%8Ditele", "text": "title: učení bez učitele\nurl: https://cs.wikipedia.org/wiki/U%C4%8Den%C3%AD_bez_u%C4%8Ditele\ntext: Učení bez učitele\nje třída metod\nstrojové učení\n. Na rozdíl od\nučení s učitelem\ntrénovací data\nnemají vstupní data provázaná s cílovými proměnnými (ohodnocením, závisle proměnnou…), tj. schází výrok učitele a učení bez učitele tedy vykazuje samoorganizaci, která zachycuje vzory jako\nhustotu pravděpodobnosti\n.\n[\n1\n]\nUčení bez učitele si tedy lze představit jako kompresi vstupních dat, např. například snížení jejich dimense (v\nanalýze hlavních komponent\n) nebo jejich redukci na diskrétní body (jako je tomu ve\nshlukové analýze\n, kde vstupní data reprezentujeme označenými shluky), či jejich vyhlazení (odhad\ndistribučních funkcí\n).\n[\n2\n]\nU\nneuronových sítí\nse učení bez učitele užívá typicky u\nkompetičních\nsítí. (Porovnejte s\nučením s učitelem\n).\nPraktické aplikace\nsegmentace:\nObchodník tak může rozdělit svoje zákazníky podle jejich podobnosti je zařadit do tržních segmentů anebo archeolog může podle charakteristik nalezených střepů keramiky definovat různé kulturní okruhy, k nimž patřili lidé, kteří kdysi keramiku vyráběli\nhledání anomálií\n: Netypické datové body mohou signalizovat poruchy nebo jiné situace, na které je potřeba se zaměřit, například při detekci podvodů ve finančních a telekomunikačních firmách\nodhad latentních proměnných\n: Psycholog může z řady výsledků jednotlivých testů stanovit inteligenci zkoumané osoby, politolog může na základě dotazníkového šetření rekonstruovat základní dimenze politického systému v zemi\nzpravodajské sekce\n: Zprávy Google používají učení bez učitele ke kategorizaci článků o stejném příběhu z různých online zpravodajství. Například výsledky prezidentských voleb by mohly být zařazeny pod jejich štítek \"US news\".\npočítačové vidění\n:\nAlgoritmy\nučení bez učitele se používají pro některé úlohy počítačového vidění, například rozpoznávání objektů.\nlékařské zobrazovací metody\n: Poskytuje základní funkce lékařským zobrazovacím zařízením, jako je detekce, klasifikace a\nsegmentace obrazu\n, které se používají v radiologii a patologii k rychlé a přesné diagnostice pacientů.\ndoporučování\n: Pomocí údajů o minulém nákupním chování může neřízené učení pomoci odhalit datové trendy, které lze využít k vytvoření efektivnějších strategií následného prodeje. Toho se u internetových prodejců využívá k tomu, aby zákazníkům během procesu placení doporučovali relevantní doplňky.\n[\n3\n]\nTypické algoritmy\nshluková analýza\n(\nhierarchické shlukování\n,\nk-means\na jiné)\nmetody identifikující struktury kovariančních vazeb (\nanalýza hlavních komponent\n,\nfaktorová analýza\n,\nstrukturní modelování\na další)\nvyhlazování a odhadování hustot pravděpodobnosti (kernel density estimation)\nReference\n↑\nHINTON, Geoffrey; SEJNOWSKI, Terrence.\nUnsupervised Learning: Foundations of Neural Computation\n. [s.l.]: MIT Press, 1999.\nISBN\n978-0262581684\n.\nJe zde použita šablona\n{{\nCite book\n}}\noznačená jako k „pouze dočasnému použití“.\n↑\nGENTLEMAN, R.; CAREY, V. J.\nUnsupervised Machine Learning. Bioconductor Case Studies\n. New York: Springer, 2008. 21 s.\nDostupné online\n.\nISBN\n978-0-387-77239-4\n. (anglicky)\n↑\nWhat is Unsupervised Learning?.\nwww.ibm.com\n[online]. [cit. 2022-10-26].\nDostupné online\n. (anglicky)\nCitováno z „\nhttps://cs.wikipedia.org/w/index.php?title=Učení_bez_učitele&oldid=25374143\n“"}
{"docID": 16, "source": "https://cs.wikipedia.org/wiki/Shlukov%C3%A1_anal%C3%BDza", "text": "title: shluková analýza\nurl: https://cs.wikipedia.org/wiki/Shlukov%C3%A1_anal%C3%BDza\ntext: Tento článek potřebuje úpravy.\nMůžete Wikipedii pomoci tím, že ho\nvylepšíte\n. Jak by měly články vypadat, popisují stránky\nVzhled a styl\n,\nEncyklopedický styl\na\nOdkazy\n.\nKonkrétní problémy:\nsjednotit formátování vzorců\nShluková analýza\n(též\nclusterová analýza\n,\nanglicky\ncluster analysis) je\nvícerozměrná\nstatistická\nmetoda, která se používá ke\nklasifikaci\nobjektů.\nSlouží k třídění jednotek do skupin (shluků) tak, aby si jednotky náležící do stejné skupiny byly podobnější než objekty z ostatních skupin. Shlukovou analýzu je možné provádět jak na\nmnožině\nobjektů, z nichž každý musí být popsán prostřednictvím stejného souboru\nznaků\n, které má smysl v dané množině sledovat, tak na množině znaků, které jsou charakterizovány prostřednictvím určitého souboru objektů, nositelů těchto znaků.\nKlasifikace shlukovacích metod\nZákladní členění shlukovacích metod podle cíle je na hierarchické a nehierarchické metody.\nHierarchické shlukování\nvytváří systém\npodmnožin\n, kde\nprůnikem\ndvou podmnožin – shluků je buď\nprázdná množina\n, nebo jeden z nich. Pokud nastane alespoň jednou druhý případ, je systém hierarchický. Tedy je to jakési větvení, zjemňování klasifikace. K hierarchickému shlukování lze přistupovat ze dvou stran – rozlišujeme přístup\ndivizní\n(vycházíme z celku, jednoho shluku, a ten dělíme) a\naglomerativní\n(vycházíme z jednotlivých objektů, shluků o jednom členu, a ty spojujeme). Hierarchické shlukování nabízí více alternativních řešení, výsledek shlukování je pak možné vyjádřit\ndendrogramem\n. Tato metoda však není vhodná pro velké datové soubory.\nNehierarchické shlukování\nvytváří takový systém, kde jsou shluky\ndisjunktní\nmnožiny. Používá se nejčastěji algoritmus\nk\n-means\n.\nMěření podobnosti objektů\nShluková analýza vychází z podobnosti, resp. vzdálenosti objektů. Její kvantitativní vyjádření je jedním ze základních problémů clusterové analýzy. Existuje mnoho způsobů konstrukce tohoto ukazatele. Výběr vhodné metriky vzdálenosti je zásadní, protože přímo ovlivňuje výsledky analýzy a strukturu nalezených shluků. Mezi nejčastěji používané metody měření vzdáleností patří Eukleidovská vzdálenost, Manhattanská vzdálenost, Minkowského vzdálenost, Kosinová vzdálenost a další. Každá z těchto metrik má své výhody a omezení v závislosti na povaze a dimenzi dat.\n[\n1\n]\n[\n2\n]\nVýběr správné metriky závisí na charakteru analyzovaných dat. U numerických hodnot se obvykle preferuje eukleidovská nebo Minkowského vzdálenost, zatímco u kategoriálních dat může být efektivnější Jaccardova vzdálenost. Pro textová nebo vysokodimenzionální data je často nejlepší volbou kosinová vzdálenost.\n[\n1\n]\n[\n3\n]\nVlastnosti vzdálenosti\nStandardními požadavky pro vhodný předpis míry vzdálenosti (metriky)\nd\n{\\displaystyle d}\ndvou objektů\nO\ni\n{\\displaystyle O_{i}}\na\nO\nj\n{\\displaystyle O_{j}}\njsou:\nnezápornost:\nd\n(\nO\ni\n,\nO\nj\n)\n≥\n0\n{\\displaystyle d(O_{i},O_{j})\\geq 0}\n;\nsymetrie:\nd\n(\nO\ni\n,\nO\nj\n)\n=\nd\n(\nO\nj\n,\nO\ni\n)\n{\\displaystyle d(O_{i},O_{j})=d(O_{j},O_{i})}\n;\nshodné objekty by měly mít ukazatel vzdálenosti roven 0:\nd\n(\nO\ni\n,\nO\ni\n)\n=\n0\n{\\displaystyle d(O_{i},O_{i})=0}\n(zároveň míra podobnosti bude rovna maximální hodnotě, obvykle 1).\ntrojúhelníková nerovnost:\nd\n(\nO\ni\n,\nO\nj\n)\n≤\nd\n(\nO\ni\n,\nO\nh\n)\n+\nd\n(\nO\nh\n,\nO\nj\n)\n{\\displaystyle d(O_{i},O_{j})\\leq d(O_{i},O_{h})+d(O_{h},O_{j})}\n.\nTypy vzdáleností\nmetriky\n– základní je\neukleidovská vzdálenost\na od ní jsou odvozeny další ukazatele (např. čtverec euklidovské vzdálenosti), další metriky jsou\nManhattanská\n, Čebyševova ad.)\nkoeficienty asociace\n– určeny pro hodnocení podobnosti pro objekty vyjádřené\ndichotomickými\nznaky, ukazatele založeny na počtu shod a počtu znaků. Konkrétních ukazatelů je celá řada, některé operují jen s pozitivními shodami (např.\nkoeficient Jaccardův\n, Russel & Rao,\nDiceův\nad.), některé i s negativními (např.\nSokalův\n,\nHamannův\n). Mohou se vztahovat k celkovému počtu znaků, k počtu rozdílných případů nebo k různým kombinacím předchozích.\nkorelační koeficient\n– hodí se především pro shlukování proměnných.\nExistuje řada dalších způsobů měření vzdálenosti či podobnosti (\nmíry asymetrie\n, Lambda,\nkosinus\nvektorů\n,\nchí-kvadrát\n). Někdy je způsob hodnocení podobnosti/vzdálenosti přímo dán shlukovací metodou. I pokud tomu tak není, je třeba při výběru ukazatele brát v úvahu metodu shlukování a charakter souboru.\nKonkrétní příklady\nEukleidovská vzdálenost\nEukleidovská vzdálenost\n, známá také jako L2\nnorma\n, je nejběžnější metrika používaná v shlukové analýze, a to především díky své jednoduchosti a intuitivní interpretaci jako „přímé čáry“ mezi dvěma body v n-rozměrném prostoru. Eukleidovská vzdálenost, pojmenovaná po starořeckém matematikovi\nEukleidovi\n, byla jednou z prvních formálně popsaných\nmetrik\n. Její aplikace v moderních statistických metodách však začala až s rozvojem analýzy dat v polovině 20. století.\n[\n4\n]\n[\n5\n]\nMatematicky je definována jako:\nd(x, y) = √(∑(xᵢ – yᵢ)²)\nTato metrika je vhodná pro metrická data, ale citlivá na extrémy (outliery), což může ovlivnit výsledky analýzy.\n[\n2\n]\n[\n5\n]\nEuklidovská a Manhattanská vzdálenost\nManhattanská vzdálenost\nManhattanská vzdálenost\n, známá také jako L1 norma, měří vzdálenost jako součet absolutních rozdílů mezi souřadnicemi. Používá se v případech, kdy se předpokládá pohyb pouze ve vertikálním nebo horizontálním směru:\n[\n6\n]\nd(x, y) = ∑|xᵢ – yᵢ|\nTato vzdálenost je vhodná pro data s kategoriemi nebo mřížkovou strukturou, například ve městských prostorových analýzách.\n[\n2\n]\nMinkowského vzdálenost\nMinkowského vzdálenost\nje zobecněním jak eukleidovské, tak manhattanské vzdálenosti, řízeným parametrem p:\nd(x, y) = (∑|xᵢ – yᵢ|ᵖ)¹/ᵖ\nNapříklad pro p = 2 získáme eukleidovskou vzdálenost a pro p = 1 manhattanskou vzdálenost. Tento flexibilní přístup je výhodný pro analýzu různorodých dat.\n[\n2\n]\n[\n4\n]\nKosinová vzdálenost\nKosinová vzdálenost měří úhel mezi dvěma vektory, což je užitečné při práci s vysokodimenzionálními daty, jako jsou textové dokumenty nebo datové matice. Je definována jako:\nd(x, y) = 1 – (x · y) / (||x|| ||y||)\nKosinová vzdálenost nezohledňuje absolutní hodnoty vektorů, ale zaměřuje se na jejich orientaci.\n[\n5\n]\n[\n3\n]\nJaccardova vzdálenost\nPoužívá se především pro binární data, například při analýze přítomnosti či nepřítomnosti určitých vlastností. Definice je následující:\nd(x, y) = 1 – (|x ∩ y|) / (|x ∪ y|)\nJaccardova vzdálenost je běžná při analýze genetických dat nebo dat sociálních sítí.\n[\n3\n]\n[\n6\n]\nMetody hierarchického shlukování\nExistují různé přístupy, jak shlukovat objekty na základě jejich vzdálenosti či podobnosti. Mezi základní metody patří:\nmetoda nejbližšího souseda\n(\nsingle linkage\n,\nnearest neighbor\n) – vzdálenost shluků je určována vzdáleností dvou nejbližších objektů z různých shluků. Při použití této metody jsou objekty taženy k sobě, výsledkem jsou dlouhé řetězy.\nmetoda nejvzdálenějšího souseda\n(\ncomplete linkage\n,\nfurthest neighbor\n) – vzdálenost shluků je určována naopak vzdáleností dvou nejvzdálenějších objektů z různých shluků. Funguje dobře především v případě, že objekty tvoří přirozeně oddělené shluky, nehodí se, pokud je tendence k řetězení.\ncentroidní metoda\n– vzdálenost shluků je určována vzdáleností jejich center (hypotetická jednotka s průměrnými hodnotami znaků). Může být nevážená nebo vážená. Ta zohledňuje velikosti shluků a je vhodná pokud očekáváme jejich rozdílnost. Užívá se vyjádření vzdálenosti objektů čtvercovou euklidovskou vzdáleností.\npárová vzdálenost\n(pair-group average) – vzdálenost shluků je určována jako průměr vzdáleností všech párů objektů z různých shluků. Opět může být ve vážené i nevážené podobě.\nWardova metoda\n– vychází z\nanalýzy rozptylu\n. Slučuje takové shluky, kde je minimální součet čtverců. Obecně lze říci, že je tato metoda velmi účinná, nicméně má tendenci vytvářet poměrně malé shluky. Vzdálenosti objektů se měří čtvercovou euklidovskou vzdáleností.\nPříklady využití\nZdravotnictví\nShluková analýza je užitečným nástrojem ve zdravotnictví pro porozumění rozdílům a podobnostem mezi pacienty s Parkinsonovou chorobou (PD), což umožňuje definovat specifické podskupiny. Tyto podskupiny mohou sloužit k přesnější diagnostice, sledování průběhu nemoci a plánování léčby. Výzkumy v této oblasti často využívají klinické škály, jako je například UPDRS, k seskupování pacientů na základě různých symptomů a jejich závažnosti, přičemž výsledky typicky odhalují dvě až pět klastrů. Identifikace těchto podskupin je důležitá pro vývoj personalizované péče, která lépe odpovídá individuálním potřebám pacientů a umožňuje efektivnější léčebné strategie.\n[\n7\n]\nFinanční sektor\nBanka může pomocí shlukové analýzy rozdělit své klienty do rizikových skupin na základě jejich demografických a socioekonomických charakteristik, včetně kombinace numerických údajů (např. příjem, výše úvěru) a kategoriálních dat (např. zaměstnání, rodinný stav). Tento přístup umožňuje lépe identifikovat klienty s vysokým rizikem nesplacení úvěru. Například pomocí sjednoceného podobnostního metru mohou být klienti rozděleni do podskupin, kde jedna z nich vykazuje vyšší pravděpodobnost problémů s placením. Na základě těchto výsledků může banka upravit úvěrové limity, přizpůsobit podmínky nebo nabídnout preventivní opatření, jako je finanční poradenství. Tento přístup podporuje efektivnější řízení rizik a minimalizuje potenciální ztráty.\n[\n8\n]\nLesnictví\nLesní správa může pomocí shlukové analýzy efektivně rozdělit lesní stanoviště do skupin na základě jejich ekologických a ekonomických charakteristik, jako jsou náklady na pěstební opatření, typ půdy nebo druhové složení porostu. Tento přístup umožňuje lépe pochopit, jak se jednotlivá stanoviště liší z hlediska nákladové náročnosti a potřebné péče. Například pomocí matice nepodobnosti a její vizualizace lze stanoviště seskupit tak, že některé z nich vykazují vyšší náklady na specifické pěstební zásahy. Na základě těchto výsledků může lesní správa optimalizovat plánování zásahů, přizpůsobit metody péče nebo efektivněji alokovat zdroje. Tento přístup podporuje udržitelnější hospodaření v lesích a snižuje celkové náklady na péči.\n[\n9\n]\nOdkazy\nReference\n↑\na\nb\nŘEZANKOVÁ, Hana; HÚSEK, Dušan a SNÁŠEL, Václav.\nShluková analýza dat\n. 2., rozš. vyd. Praha: Professional Publishing, 2009.\nISBN 978-80-86946-81-8\n↑\na\nb\nc\nd\nMELOUN, Milan; MILITKÝ, Jiří a HILL, Martin.\nStatistická analýza vícerozměrných dat v příkladech\n. Vydání druhé, v Nakladatelství Karolinum první. Praha: Univerzita Karlova v Praze, nakladatelství Karolinum, 2017.\nISBN 978-80-246-3618-4\n↑\na\nb\nc\nHASTIE, Trevor; TIBSHIRANI, Robert a FRIEDMAN, J. H.\nThe elements of statistical learning: data mining, inference, and predition\n. 2nd ed. Springer series in statistics. New York: Springer Science+Business Media, c2009.\nISBN 978-0-387-84857-0\n↑\na\nb\nHEBÁK, Petr; HUSTOPECKÝ, Jiří a MALÁ, Ivana.\nVícerozměrné statistické metody\n. [2]. Praha: Informatorium, 2005.\nISBN 80-7333-036-9\n↑\na\nb\nc\nKAUFMAN, Leonard a ROUSSEEUW, Peter J. Finding Groups in Data: An Introduction to Cluster Analysis. 2. vyd. New York: Wiley, 1990.\nISBN 0-471-87876-6\n↑\na\nb\nRENCHER, Alvin C. a CHRISTENSEN, William F.\nMethods of multivariate analysis\n. 3rd ed. Wiley series in probability and statistics. Hoboken: John Wiley, c2012.\nISBN\n978-0-470-17896-6\n.\n↑\nHENDRICKS, Renee M.; KHASAWNEH, Mohammad T. A systematic review of Parkinson’s disease cluster analysis research.\nAging and disease\n, 2021, 12.7: 1567.\n↑\nCARUSO, Giulia, et al. Cluster Analysis for mixed data: An application to credit risk evaluation.\nSocio-Economic Planning Sciences\n, 2021, 73: 100850.\n↑\nEconomic aspects of silvicultural treatments in oak Stands.\n\n(2023)\nSylwan\n, 167 (12), pp. 828-837.\nLiteratura\nA. Lukasová, J. Šarmanová: Metody shlukové analýzy. SNTL, Praha 1985.\nExterní odkazy\nObrázky, zvuky či videa k tématu\nshluková analýza\nna Wikimedia Commons\nShluková analýza\nv\nČeské terminologické databázi knihovnictví a informační vědy (TDKIV)\nDetailnější rozbor včetně matematického aparátu\n[1]\nKapitola z české online učebnice prostorových analýz\n[2]\nKapitola z anglické online učebnice statistiky (anglicky)\n[3]\nArchivováno\n4. 2. 2007 na\nWayback Machine\n.\nPopis a ukázka aplikace některých shlukovacích\nalgoritmů\n– fuzzy shluková analýza, shlukování kolem medoidů (PAM) a CLARA – a prostředků k hodnocení klasifikačního modelu (silhouette plot)\n[4]\nArchivováno\n15. 2. 2010 na\nWayback Machine\n.\nCitováno z „\nhttps://cs.wikipedia.org/w/index.php?title=Shluková_analýza&oldid=25323799\n“"}
{"docID": 17, "source": "https://cs.wikipedia.org/wiki/Lemmatizace", "text": "title: lemmatizace\nurl: https://cs.wikipedia.org/wiki/Lemmatizace\ntext: Lemmatizace\nje určení lemmatu (základního slovního tvaru) k ohýbanému slovnímu tvaru.\nLemmatizátor\nje nástroj (např.\npočítačový program\n), který vytvoří (vyhledá v databázi) k určitému\ntvaru\nslova\nzákladní tvar, tzv.\nlemma\n.\n[\n1\n]\nDoplňkovou funkcí lemmatizátoru jsou informace o\nmluvnických kategoriích\n(např.\njmenných\na\nslovesných\n) k danému tvaru.\n[\npozn. 1\n]\nNapř. pro tvar „barvě“ lemmatizátor vrátí tvar „barva“, případně doplňkovou informaci\npodstatné jméno, ženský rod, jednotné číslo, 3./6. pád\n.\nLemmatizace se např. využívá se pro vyhledávání ve fulltextových databázích. Pro fulltextové vyhledávání se ovšem využívají i podobně strukturovaná data sloužící k automatické\nkontrole pravopisu\n(např. slovníky pro\nhunspell\n).\n[\n3\n]\nVyužití lemmatizace\nFulltextové vyhledávání\n: např. pro zadanou frázi „sběrný dvůr“ se vyhledají i dokumenty obsahující tato slova v jiných pádech a číslech (\nsběrné dvory\n,\numístění sběrných dvorů\n).\n[\n4\n]\nKorpusová lingvistika\n: informace z morfologického analyzátoru se využívá při\nznačkování\nkorpusů\n.\n[\n5\n]\nLemmatizaci využívá software QUITA (Quantitative Index Text Analyzer), který dokáže posuzovat a analyzovat rozsáhlé texty, např. bohatost slovní zásoby a další lingvistické ukazatele.\n[\n6\n]\nDalším nástrojem využívající lemmatizaci je\nlatentní sémantická analýza\n(LSA). „Latentní sémantická analýza je technika, která zobrazuje dokumenty a dotazy do prostoru latentních sémantických dimenzí, přičemž slova, která jsou sémanticky podobná (měřeno mírou souvýskytů v dokumentech) jsou zobrazována do stejných dimenzí a slova sémanticky odlišná do různých dimenzí.“\n[\n7\n]\nLSA pro každé slovo vytváří další dimenzi, dokumenty se tak mohou nacházet až v několika statisících dimenzí. Lemmatizace je zde vhodná z toho důvodu, aby počet slov zredukovala na minimum a to pomocí převedení všech slov na základní tvar. Tím se nevytváří různé dimenze pro stejná slova v jiném slovním tvaru. „Díky tomu mohou mít velkou sémantickou podobnost i dokumenty (případně dotaz a dokument), které spolu nesdílejí žádná slova.“\n[\n7\n]\nÚskalí lemmatizátoru\nNěkterá slova jsou\nmnohoznačná\n(v\nčeštině\nnapř. ženu, stát, tancích) a pokud lemmatizátor neposoudí nebo nemůže posoudit kontext, není schopen zvolit zamýšlený význam. Např. „Jeden z nejhodnotnějších zdrojů o maďarských tancích“ zpracuje takto: „Jeden/jíst z hodnotný zdroj o maďarský tank/tanec“.\nObtížným specifikem jsou taktéž\nvíceslovná spojení\n, tj. vytváření lemmat i tam, kde to není možné, např. zdvořilá prosba\nDovolíte?\nse nenachází v žádném z registrovaných významů slova dovolit, dále se může jednat o frazémy, např. nechat na holičkách, popř. se jedná o idiomy např. z někoho si vystřelit.\n[\n1\n]\nDostupné lemmatizátory pro češtinu\nNeúplný výčet podle bakalářské práce\nLemmatizace češtiny\n:\n[\n6\n]\nČeské lemmatizátory\nAjka\n[\n8\n]\nMajka\n[\n9\n]\nMorče\n[\n10\n]\nMorphoDiTa\n[\n11\n]\nCzech HMM tagger\n[\n12\n]\nCzech \"Free\" Morphology\n[\n13\n]\nMorfo\n[\n14\n]\nZahraniční lemmatizátory\nCistern\n[\n15\n]\n(Lemming\n[\n16\n]\n+ Marmot\n[\n17\n]\n)\nLemmaGen\n[\n18\n]\nOstatní nástroje\nQUITA\n[\n19\n]\n(Quantitative Indicator Text Analyzer)\nRDRPOSTagger\n[\n20\n]\n(Ripple Down Rules Part-Of-Speech Tagger) – Tagger založený na Ripple Down Rules\nPoznámky\n↑\nTento proces (přiřazení morfologických kategorií) se – v technickém smyslu – nazývá\nmorfologická analýza\n.\n[\n2\n]\nReference\n↑\na\nb\nCVRČEK, Václav; RICHTEROVÁ, Olga.\nSlovníček pojmů\n[online]. Český národní korpus [cit. 2016-06-21]. Kapitola Lemma.\nDostupné online\n.\n↑\nRUSÍNOVÁ, Zdenka\n;\nPETKEVIČ, Vladimír\n.\nNový encyklopedický slovník češtiny\n. Příprava vydání Petr Karlík, Marek Nekula, Jana Pleskalová. Praha:\nNLN\n, 2017.\nISBN\n978-80-7422-480-5\n. Heslo\nMorfologická analýza\n.\n↑\nVLČEK, Lukáš. Elasticsearch: Vyhledáváme hezky česky (a taky slovensky).\nwww.zdrojak.cz\n[online]. Zdroják.cz, 2013-09-04 [cit. 2018-06-19].\nDostupné online\n.\n↑\nSTROSSA, Petr. Český lemmatizátor Proč a hlavně jak? [online]. [cit. 2016-06-21].\nDostupné online\n.\n↑\nSEDLÁČEK, Radek.\nMorfologický analyzátor češtiny\n. Brno, 1999. 78 s. diplomová práce. Masarykova univerzita, Fakulta informatiky. Vedoucí práce Pavel Rychlý. s. 2.\nDostupné online.\n↑\na\nb\nBYDŽOVSKÝ, Dominik.\nLemmatizace češtiny\n. 2017. Bakalářská práce. Fakulta informatiky a managementu Univerzity Hradec Králové. Vedoucí práce Mgr. Jiří Haviger, Ph.D.\n↑\na\nb\nMATERNA, Jiří. Sémantická analýza textů [online]. 2011, ({3,4}) [cit. 2016-06-21].\nDostupné online\na\ntéž zde\n.\n↑\nAjka\n↑\nMajka\n↑\nMorče\n↑\nMorphoDiTa\n↑\nCzech HMM tagger\n↑\nCzech \"Free\" Morphology\n↑\nMorfo\n↑\nCistern\n↑\nLemming\n↑\nMarmot\n↑\nLemmaGen.\nlemmatise.ijs.si\n[online]. [cit. 2017-05-11].\nDostupné v archivu\npořízeném z\noriginálu\ndne 2017-06-06.\n↑\nQUITA\n↑\nRDRPOSTagger\nCitováno z „\nhttps://cs.wikipedia.org/w/index.php?title=Lemmatizace&oldid=24775281\n“"}
{"docID": 18, "source": "https://cs.wikipedia.org/wiki/Jazykov%C3%BD_korpus", "text": "title: jazykový korpus\nurl: https://cs.wikipedia.org/wiki/Jazykov%C3%BD_korpus\ntext: Jazykový korpus\nje (většinou rozsáhlý) soubor\ntextů\nurčitého jazyka. Jedná se o „vnitřně strukturovaný, unifikovaný a obvykle i o indexovaný a ucelený rozsáhlý soubor elektronicky uložených a zpracovaných jazykových dat většinou v textové podobě, organizovaný se zřetelem k využití pro určitý cíl.”\n[\n1\n]\nKorpus slouží jednak pro\nlingvistický\nvýzkum jazykové praxe, jednak jako datová základna pro tvorbu slovníků, korektorů, překladačů apod. Tvorbou korpusů se zabývá obor\nkorpusová lingvistika\n.\n[\n2\n]\nV současnosti mají korpusy digitální podobu, což výrazně usnadňuje sběr dat i jejich zpracování: speciální programy umožňují vyhledávání slov a slovních spojení v kontextu, zjištění frekvence výskytu v korpusu i zjištění původního zdroje textu.\n[\n3\n]\nPopis\nKorpusy slouží zejména jako\nlexikologický\na\nlexikografický\nnástroj a stávají se mj. zdrojem pro zpracování jednojazyčných výkladových slovníků a automatických korektorů nebo vícejazyčných překladových slovníků a automatických překladačů. Kromě lingvistů korpusy stále častěji využívají i redaktoři,\npřekladatelé\na další tvůrci textů, učitelé a studenti cizích jazyků.\nTexty jsou v různé míře opatřeny metajazykovými značkami vypovídajícími o samotném textu (autor, rok vydání, žánr apod.), o zařazení jednotlivých\nslov\ndo kategorie\nslovních druhů\n, o frekvenci slova v korpusu, případně dalších\nlingvistických\na frekvenčních aspektech. Pro formátování textů a vkládání značek se používá zejména standardizovaného jazyka\nXML\n, případně staršího\nSGML\n.\nRozdělení korpusů\nReferenční\nkorpus je stálý, takže opakované dotazy dávají vždy stejné výsledky. Naproti tomu\nnereferenční\nkorpus je průběžně aktualizován, obvykle jednou ročně.\nNěkteré korpusy jsou budovány jako\nvyvážené\n, což znamená, že by měly obsahovat vyvážený podíl textů tříděných podle\nžánrovosti\n, doby vzniku, případně dalších hledisek (mluvenost, psanost, regionálnost, užívanost apod.).\nSynchronní\nkorpusy jsou budované jako reprezentativní a vyvážené otisky\njazyka\nv určitém relativně krátkém časovém období, během něhož lze považovat jazyk za neměnný systém. Většinou se jedná o korpusy současného jazyka.\nDiachronní\nkorpusy zachycují jazyk v různých vývojových fázích a obsahují tudíž texty z rozsáhlejších období.\nPodle dalšího kritéria rozlišujeme také korpusy jednojazyčné a vícejazyčné. Vícejazyčný korpus se také nazývá\nparalelní\nkorpus a obsahuje stejné texty v různých jazycích zobrazené vedle sebe.\nKorpusy češtiny\nBudováním korpusů českého jazyka se v České republice zabývá od roku 1994\n[\n4\n]\nÚstav Českého národního korpusu\n(ÚČNK) při\nFilozofické fakultě UK\n[\n5\n]\n, který založil lingvista\nFrantišek Čermák\n. Od ledna 2014 je možné vyhledávat v korpusech ÚČNK pomocí korpusového manažeru\nKonText\n.\n[\n6\n]\nZ českých korpusů mezi ně patří jak synchronní korpusy psané češtiny, tak synchronní mluvené korpusy a diachronní korpusy:\nKorpusy řady SYN\n– všechny synchronní psané korpusy této řady jsou spojeny ve stejnojmenný korpus SYN. Dohromady obsahují přes dva tisíce testových slov (tokenů). Korpus není reprezentativní – sice jsou v něm spojeny reprezentativní korpusy, ale po sloučení převažují texty publicistické (SYN2006PUB, SYN2009PUB a SYN2013PUB). Publicistická část zahrnuje texty nejznámějších celostátních deníků a nespecializovaných časopisů. Ostatní korpusy (SYN2000, SYN2010, SYN2005) jsou žánrově vyvážené, obsahují tedy jak texty z publicistického prostředí, tak z beletrie nebo odborné literatury.\nKorpus soukromé korespondence (KSK-dopisy)\nobsahuje 2000 elektronických přepisů ručně psané korespondence z let 1990–2004. Pisatelé pocházejí z různých částí České republiky, a tak jsou v dopisech dobře zachovány idiolekty. Všechny shromážděné texty obsahují sociologické charakteristiky pisatelů. Korpus byl vytvořen v Ústavu českého jazyka na\nFilozofické fakultě\nMasarykovy univerzity\nv\nBrně\npod vedením Zdeňky Hladké.\nPražský mluvený korpus (PMK)\nje první korpus mluvené češtiny. Zachycuje autentickou mluvenou češtinu z oblasti Prahy a okolí. Anonymních 304 nahrávek pochází z let 1988–1996.\nBrněnský mluvený korpus (BMK)\nje v rámci ČNK prvním korpusem mluvené češtiny z oblasti Moravy. Zaznamenává autentickou tematicky nespecializovanou mluvu města\nBrna\n. BMK je elektronickým přepisem 250 anonymních magnetofonových nahrávek (tj. 596 009 pozic) z let 1994-1999 zachycujících 294 mluvčích.\nřada ORAL\nzachycuje spontánní konverzaci výhradně v neformálních komunikačních situacích. Korpus ORAL2013 již pokrývá celé území České republiky a přepis je propojen se zvukovou stopou.\nSCHOLA2010\nobsahuje mluvu učitelů i žáků zaznamenanou ve vyučovacích hodinách o velikosti kolem milionu pozic. Je to proto sociolingvisticky nevyjádřený korpus formální i poloformální mluvené češtiny. Díky své interdisciplinárnosti může být využit nejen pro lingvistické, ale i pro psychologické, sociologické a další bádání.\nCzeSL-plain\n(Czech as a Second Language) – neanotovaný žákovský korpus, který obsahuje tři subkorpusy –\nciz\n(písemné práce nerodilých mluvčích různé úrovně),\nkval\n(odborné práce nerodilých mluvčích) a\nrom\n(písemné práce romských žáků z oblastí ohrožených sociálním vyloučením).\nDIAKORP\nje diachronní korpus obsahující\ntexty\nod 13. století, nejmladší pak pocházejí z roku 1989. Kvůli velkému časovému rozpětí musel být korpus vytvořen trochu odlišně od výše zmíněných. Texty jsou transkribovány a značkování zachycuje i podstatnou část lingvistických informací, která může transkripcí zaniknout.\nTaké další univerzitní pracoviště budují vlastní korpusy:\nKorpus českého verše\nÚstavu pro českou literaturu AV ČR. Je lemmatizovaný, foneticky, morfologicky, metricky a stroficky anotovaný. Jeho obsah je čerpán z české poezie 19. a počátku 20. století. Na webových stránkách je k dispozici velká řada\non-line nástrojů\nArchivováno\n16. 6. 2016 na\nWayback Machine\n., které umožňují s texty pracovat či si procvičovat rozpoznávání meter.\nczTenTen12\n– stejně jako to platí u ostatních korpusů řady\nTenTen\n, i zde jsou texty postahovány z internetu (pomocí nástroje Spiderling a Heritrix). Obsahuje přes 5,4 miliard tokenů, což z něj dělá největší český textový korpus. Spolu s korpusem\nCzechParl\n(Korpus stenografických záznamů českého parlamentu) a\nDesam\n(morfologicky označkovaný korpus českých textů) je dostupný přes korpusový manažer\nSketch Engine\n, který vyvíjí společnost\nLexical Computing Ltd\n. ve spolupráci s Centrem zpracování přirozeného jazyka při\nFakultě informatiky Masarykovy univerzity\n.\nOlomoucký mluvený korpus\nOd roku 2002 vzniká na\nUniverzitě Palackého v Olomouci\npod vedením dr. P. Pořízky. Jeho základem jsou foneticky přepsané nahrávky.\nKorpusy angličtiny\nBrown Corpus\nBrown University Standard Corpus of Present-Day American English\nneboli zkráceně\nBrown Corpus\nje dílem dvou autorů –\nHenryho Kučery\n(původem Čech, studoval na Univerzitě Karlově) a W. N. Francise, kteří tou dobou působili na\nBrownově univerzitě\n. Jedná se o korpus, který vznikal v letech 1963–1964, přičemž obsahuje texty z roku 1961 ve snaze zachytit jazyk v určitém období (trend, který se u tvorby korpusů volí i dnes). Cílem zkoumání je psaná americká angličtina rodilých mluvčích. V korpusu se neuchovávají celé texty, ale pouze vzorky, a to z toho důvodu, aby byl korpus vyvážený. Celkově je v něm využito 15 kategorií, mezi které patří časopisy, noviny, odborná literatura i beletrie. Z každého textu je vybrán vzorek 2 000 slov a celkový počet vzorků se rovnal 500. Celkový rozsah byl kolem jednoho milionu slov. Korpus Brown je morfologicky označkován, využito je 80 kategorií a značkovala se například interpunkce i speciální znaky.\nKorpus Brown velice ovlivnil další generace lingvistů a je svým rozvržením vzorem mnoha dalších korpusů. Zajímavostí je, že v 80. letech vznikl\nThe Freiburg-LOB corpus of American English (Frown)\n, který byl obdobou korpusu Brown. Vznikl na\nFreiburské univerzitě\nv Německu. Měl úplně stejnou strukturu a snažil se zachytit britskou angličtinu z roku 1991. O značkování byl doplněn v roce 2007.\nNa korpusu Brown je založeno několik publikací. Nejznámější z děl založených na korpusu vůbec je\nComputional Analysis of Present-Day American English\nod autorů korpusu (Kučera, Francis). Jedná se o statistickou studii, ve které se kombinuje lingvistika, psychologie a statistika.\nLancaster-Oslo/Bergen Corpus (LOB)\nTento korpus, který vznikal v letech 1970–1978, je britským protějškem ke korpusu Brown. Má stejnou strukturu (1 milion slov, 500 vzorků po 2 000 slovech, 15 žánrů) a snaží se taktéž zachytit jazyk v roce 1961, tentokrát se však jedná o britskou angličtinu. Jedním ze spoluautorů je i\nGeoffrey Neil Leech\n.\nI k tomuto korpusu vznikla v Německu obdoba označená jako\nThe Freiburg-LOB Corpus of British English (FLOB)\n. Zveřejněn byl v roce 1999 a zachycuje britskou angličtinu v roce 1991.\nBritish National Corpus\nBritish National Corpus\n(zkráceně\nBNC\n) je korpus, který vznikal ve spolupráci tří nakladatelů (\nOxford University Press\n, Longman a W. & R. Chambers), dvou univerzit (\nOxfordské univerzity\na\nuniverzity v Lancasteru\n) a britské národní knihovny v letech 1991–1994, přičemž zveřejněn byl v roce 1994. Jedná se o korpus se 100 miliony slov a rozvětvenou strukturou. Tento korpus je vyvážený, zahrnuje jak časopisy, noviny, tak odbornou literaturu i beletrii. V korpusu nalezneme vzorky jednotlivých textů, od jednoho autora maximálně 45 tisíc slov. Zachycuje britskou angličtinu (z let, ve kterých vznikal, tedy 1991–1994) a kromě psaných textů v něm nalezneme i mluvenou angličtinu v poměru 9 : 1 (psaná : mluvená). Mluvená angličtina byla do korpusu převedena pomocí ortografické transkripce. BNC je zafixovaný a nic se do něj nepřidává; jediné, co se mění, je značkování.\nV rámci BNC jsou dva menší subkorpusy, které jsou určeny pro zkoumání jazyka. Prvním z nich je\nBNC Sampler\n, který obsahuje jeden milion mluvené angličtiny a jeden milion psaných textů. Druhým je\nBNC Baby\n, do nějž jsou zahrnuty čtyři milionové vzorky ze čtyř různých žánrů.\nNa korpusu je založeno několik publikací, například článek\n100 Million Words of English\n, který napsal G. N. Leech, článek\nCorpus Design Criteria\n(1992), jehož autory jsou S. Atkins, J. Clear a N. Ostler a který popisuje strukturu BNC, a také kniha\nCorpus: An Introduction\n(2001), kterou napsali T. McEnery a A. Wilson.\nOdkazy\nReference\n↑\nČERMÁK, František. 1995. Jazykový korpus : Prostředek a zdroj poznání.\nSlovo a slovenost\n. 1995, roč. 56, č. 2, s. 119 - 140. ISSN 0037-7031\n↑\nhttps://www.ikaros.cz/jazykove-korpusy\n↑\nCo je korpus? | Ústav Českého národního korpusu.\nucnk.ff.cuni.cz\n[online]. [cit. 2022-01-13].\nDostupné online\n.\n↑\nstart - Příručka ČNK.\nwiki.korpus.cz\n[online]. [cit. 2022-01-13].\nDostupné online\n.\n↑\nPortál | Český národní korpus.\nwww.korpus.cz\n[online]. [cit. 2022-01-13].\nDostupné online\n.\n↑\nKonText - query form.\nwww.korpus.cz\n[online]. [cit. 2022-01-13].\nDostupné online\n.\nSouvisející články\nKorpusová lingvistika\nParalelní korpus\nExterní odkazy\nObrázky, zvuky či videa k tématu\njazykový korpus\nna Wikimedia Commons\nJazykový korpus\nv\nČeské terminologické databázi knihovnictví a informační vědy (TDKIV)\nÚstav Českého národního korpusu\nÚstav formální a aplikované lingvistiky\nCentrum zpracování přirozeného jazyka\nKorpusový manažer Sketch Engine\nOPUS, mnohojazyčný paralelní korpus\nArchivováno\n14. 12. 2013 na\nWayback Machine\n.\nBritský národní korpus\nCosmas II,\nDeutsches Referenzkorpus\n, DeReKo pro němčinu\nHrvatski nacionalni korpus\nKonkordanční nástroj Korp pro vyhledávání ve švédských korpusech\nNarodowy Korpus Języka Polskiego\nRussian National Corpus (Национальный корпус русского языка)\nčlánek 100 Million Words of English od G. N. Leeche\nPortály\n:\nJazyk\nCitováno z „\nhttps://cs.wikipedia.org/w/index.php?title=Jazykový_korpus&oldid=25430360\n“"}
{"docID": 19, "source": "https://cs.wikipedia.org/wiki/Line%C3%A1rn%C3%AD_regrese", "text": "title: lineární regrese\nurl: https://cs.wikipedia.org/wiki/Line%C3%A1rn%C3%AD_regrese\ntext: Tento článek není dostatečně\nozdrojován\n, a může tedy obsahovat informace, které je třeba\nověřit\n.\nJste-li s popisovaným předmětem seznámeni, pomozte doložit uvedená tvrzení doplněním\nreferencí\nna\nvěrohodné zdroje\n.\nIlustrace lineární regrese\nLineární regrese\nje matematická metoda používaná pro proložení souboru bodů v grafu\npřímkou\n. O bodech reprezentujících měřená data se předpokládá, že jejich x-ové souřadnice jsou přesné, zatímco ypsilonové souřadnice mohou být zatíženy náhodnou chybou, přičemž předpokládáme, že závislost y na x lze graficky vyjádřit přímkou. Pokud měřené body proložíme přímkou, tak při odečítání z grafu bude mezi ypsilonovou hodnotou měřeného bodu a ypsilonovou hodnotou ležící na přímce odchylka. Podstatou lineární regrese je nalezení takové přímky, aby součet druhých mocnin těchto odchylek byl co nejmenší. Lineární regresi lze zobecnit i pro prokládání jinou funkcí než přímkou. Termín\nlineární regrese\nproto může označovat dvě částečně odlišné věci:\nLineární regrese\npředstavuje\naproximaci\ndaných hodnot přímkou\nmetodou nejmenších čtverců\n. Pokud tuto přímku vyjádříme rovnicí\ny\n=\nb\n1\n+\nb\n2\nx\n{\\displaystyle y=b_{1}+b_{2}x}\n, jedná se o nalezení optimálních hodnot koeficientů\nb\n1\n{\\displaystyle b_{1}}\na\nb\n2\n{\\displaystyle b_{2}}\n.\nV obecnějším případě může\nlineární regrese\nznamenat aproximaci daných hodnot\n[\nx\ni\n,\ny\ni\n]\n{\\displaystyle [x_{i},y_{i}]}\ntakovou\nfunkcí\ny\n=\nf\n(\nx\n,\nb\n1\n,\n…\n,\nb\nk\n)\n{\\displaystyle y=f(x,b_{1},\\ldots ,b_{k})}\n, kterou lze vyjádřit jako\nlineární kombinaci\nfunkcí f\n1\naž f\nk\n:\ny\n=\nb\n1\nf\n1\n(\nx\n)\n+\n…\n+\nb\nk\nf\nk\n(\nx\n)\n{\\displaystyle y=b_{1}f_{1}(x)+\\ldots +b_{k}f_{k}(x)}\n. Koeficienty\nb\n1\n,\n…\n,\nb\nk\n{\\displaystyle b_{1},\\ldots ,b_{k}}\nse opět určují metodou nejmenších čtverců.\nHomoskedasticita\n(homogenita ve varianci) dat je běžným jevem. Avšak její předpoklad může vést k přecenění\n[\nchybí zdroj\n]\nkorelačního koeficientu. V jistých případech je tedy nutné uvážit\nheteroskedasticitu\na použít váženou regresi.\nAproximace přímkou\nUvažujme funkční závislost:\nf\n(\nx\n)\n=\na\nx\n+\nb\n{\\displaystyle f(x)=ax+b}\nSoučet čtverců pak bude vypadat takto:\nS\n(\na\n,\nb\n)\n=\n∑\ni\n=\n1\nn\n[\nf\n(\nx\ni\n)\n−\ny\ni\n]\n2\n=\n∑\ni\n=\n1\nn\n(\na\nx\ni\n+\nb\n−\ny\ni\n)\n2\n{\\displaystyle S(a,b)=\\sum _{i=1}^{n}{[f(x_{i})-y_{i}]^{2}}=\\sum _{i=1}^{n}{(ax_{i}+b-y_{i})^{2}}}\nkde\n[\nx\ni\n,\ny\ni\n]\n{\\displaystyle [x_{i},y_{i}]}\njsou souřadnice aproximovaných bodů.\nAbychom našli minimum součtu (našli koeficienty\na\n{\\displaystyle a}\n,\nb\n{\\displaystyle b}\ntak, aby nalezená závislost vhodně aproximovala daná data), položíme obě\nparciální derivace\nsoučtu čtverců rovny nule:\n0\n=\n∂\nS\n∂\na\n=\n2\n∑\ni\n=\n1\nn\n(\na\nx\ni\n+\nb\n−\ny\ni\n)\nx\ni\n{\\displaystyle 0={\\partial S \\over \\partial a}=2\\sum _{i=1}^{n}(ax_{i}+b-y_{i})x_{i}}\n0\n=\n∂\nS\n∂\nb\n=\n2\n∑\ni\n=\n1\nn\n(\na\nx\ni\n+\nb\n−\ny\ni\n)\n{\\displaystyle 0={\\partial S \\over \\partial b}=2\\sum _{i=1}^{n}(ax_{i}+b-y_{i})}\nÚpravami obdržíme soustavu:\na\n∑\ni\n=\n1\nn\nx\ni\n2\n+\nb\n∑\ni\n=\n1\nn\nx\ni\n=\n∑\ni\n=\n1\nn\nx\ni\ny\ni\n{\\displaystyle a\\sum _{i=1}^{n}{x_{i}^{2}}+b\\sum _{i=1}^{n}{x_{i}}=\\sum _{i=1}^{n}x_{i}y_{i}}\na\n∑\ni\n=\n1\nn\nx\ni\n+\nb\nn\n=\n∑\ni\n=\n1\nn\ny\ni\n{\\displaystyle a\\sum _{i=1}^{n}{x_{i}}+bn=\\sum _{i=1}^{n}y_{i}}\nLze ukázat, že\nmatice\ntéto soustavy je\nregulární\npro všechna\nn\n≥\n2\n{\\displaystyle n\\geq 2}\n, a má tedy právě jedno řešení. Obecně lze také ukázat, že v tomto bodě má součet čtverců minimum.\nJejím řešením pro konkrétní hodnoty\nx\ni\n{\\displaystyle x_{i}}\na\ny\ni\n{\\displaystyle y_{i}}\ndostaneme konečně hledané hodnoty parametrů\na\n{\\displaystyle a}\na\nb\n{\\displaystyle b}\n.\na\n=\nn\n∑\nx\ni\ny\ni\n−\n∑\nx\ni\n∑\ny\ni\nn\n∑\nx\ni\n2\n−\n(\n∑\nx\ni\n)\n2\n{\\displaystyle a={\\frac {n\\sum {x_{i}y_{i}}-\\sum {x_{i}}\\sum {y_{i}}}{n\\sum {x_{i}^{2}}-\\left(\\sum {x_{i}}\\right)^{2}}}}\nb\n=\n∑\nx\ni\n2\n∑\ny\ni\n−\n∑\nx\ni\n∑\nx\ni\ny\ni\nn\n∑\nx\ni\n2\n−\n(\n∑\nx\ni\n)\n2\n{\\displaystyle b={\\frac {\\sum {x_{i}^{2}}\\sum {y_{i}}-\\sum {x_{i}}\\sum {x_{i}y_{i}}}{n\\sum {x_{i}^{2}}-\\left(\\sum {x_{i}}\\right)^{2}}}}\nPodobný postup lze aplikovat na jakýkoliv druh závislosti i více proměnných.\nPokud je každá hodnota zatížena jinou chybou\nσ\ni\n{\\displaystyle \\sigma _{i}}\n(např. měříme několika různými přístroji), je výhodné zahrnout i toto do aproximace. Označíme-li\n⟨\nx\n⟩\n=\n∑\ni\n=\n1\nn\nx\ni\nσ\ni\n2\n{\\displaystyle \\langle x\\rangle =\\sum _{i=1}^{n}{\\frac {x_{i}}{\\sigma _{i}^{2}}}}\n, potom dostáváme\na\n=\n⟨\n1\n⟩\n⟨\nx\ny\n⟩\n−\n⟨\nx\n⟩\n⟨\ny\n⟩\n⟨\n1\n⟩\n⟨\nx\n2\n⟩\n−\n⟨\nx\n⟩\n2\n{\\displaystyle a={\\frac {\\langle 1\\rangle \\langle xy\\rangle -\\langle x\\rangle \\langle y\\rangle }{\\langle 1\\rangle \\langle x^{2}\\rangle -\\langle x\\rangle ^{2}}}}\nb\n=\n⟨\ny\n⟩\n⟨\nx\n2\n⟩\n−\n⟨\nx\ny\n⟩\n⟨\nx\n⟩\n⟨\n1\n⟩\n⟨\nx\n2\n⟩\n−\n⟨\nx\n⟩\n2\n{\\displaystyle b={\\frac {\\langle y\\rangle \\langle x^{2}\\rangle -\\langle xy\\rangle \\langle x\\rangle }{\\langle 1\\rangle \\langle x^{2}\\rangle -\\langle x\\rangle ^{2}}}}\nPřímka procházející počátkem\nPokud je požadováno, aby přímka procházela počátkem, hledá se aproximace\ny\n=\na\nx\n{\\displaystyle y=ax}\n. Pro konstantu\na\n{\\displaystyle a}\nlze odvodit následující vztah:\na\n=\n∑\nx\ni\ny\ni\n∑\nx\ni\n2\n{\\displaystyle a={\\frac {\\sum {x_{i}y_{i}}}{\\sum {x_{i}^{2}}}}}\nMáme-li závislost\ny\n=\na\nx\n{\\displaystyle y=ax}\na hodnoty jsou zatíženy chybami\nσ\ni\n{\\displaystyle \\sigma _{i}}\n, pak pro odhad parametru\na\n{\\displaystyle a}\nplatí\na\n=\n⟨\nx\ny\n⟩\n⟨\nx\n2\n⟩\n{\\displaystyle a={\\frac {\\langle xy\\rangle }{\\langle x^{2}\\rangle }}}\n(je užito označení\n⟨\nx\n⟩\n=\n∑\ni\n=\n1\nn\nx\nσ\ni\n2\n{\\displaystyle \\langle x\\rangle =\\sum _{i=1}^{n}{\\frac {x}{\\sigma _{i}^{2}}}}\na\nσ\ni\n{\\displaystyle \\sigma _{i}}\nznačí chybu (\nsměrodatnou odchylku\n)\ni\n{\\displaystyle i}\n-tého měření).\nDále pro\nrozptyl\nparametru\na\n{\\displaystyle a}\nplatí\nV\n[\na\n]\n=\n1\n⟨\nx\n2\n⟩\n{\\displaystyle V[a]={\\frac {1}{\\langle x^{2}\\rangle }}}\n.\nVýpočet na počítači\nMatlab\numožňuje použít funkci\nP = POLYFIT(X, Y, 1)\n, kde poslední parametr\n1\nudává, že hledáme koeficienty polynomu prvního řádu.\n[1]\n[2]\n[\nnedostupný zdroj\n]\nV\nExcelu\na Calcu (\nLibreOffice\na\nOpenOffice.org\n) lze koeficient\na\nzjistit funkcí\nSLOPE(Y; X)\n[3]\n[4]\na konstantu\nb\nfunkcí\nINTERCEPT(Y; X)\n[5]\n[6]\n. Případně lze oba koeficienty zjistit maticově zadanou funkcí\n{=LINEST(Y;X)}\n.\n[7]\n[8]\nV českém Excelu se tato funkce nazývá\nLINREGRESE\n.\n[9]\nObecná lineární regrese\nIlustrace hledání optimální lineární kombinace. Zelená plocha col\nX\npředstavuje prostor, ve kterém se nachází všechny možné lineární kombinace\nf(X,β)=β\n1\nX\n1\n+β\n2\nX\n2\n. Vektor\ny\n, představuje vektor hodnot, ke kterým se aproximace\nβX\nsnaží přiblížit s nejmenší možnou chybou\nε=y−βX\n, respektive druhou mocninou této chyby. Další popis viz kapitola\nOdvození: Kolmé vektory\nv článku\nMetoda nejmenších čtverců\n.\nV obecnějším případě je možné danými hodnotami\n[\nx\ni\n;\ny\ni\n]\n{\\displaystyle [x_{i};y_{i}]}\n,\ni\n=\n1\n,\n…\n,\nn\n{\\displaystyle i=1,\\ldots ,n}\nproložit funkci\ny\n=\nf\n(\nx\n,\nb\n1\n,\n…\n,\nb\nk\n)\n{\\displaystyle y=f(x,b_{1},\\ldots ,b_{k})}\nsestavenou jako\nlineární kombinaci\nk\n{\\displaystyle k}\nfunkcí\ny\n=\nb\n1\nf\n1\n(\nx\n)\n+\n…\n+\nb\nk\nf\nk\n(\nx\n)\n{\\displaystyle y=b_{1}f_{1}(x)+\\ldots +b_{k}f_{k}(x)}\n, kde\nf\n1\n(\nx\n)\n,\n…\n,\nf\nk\n(\nx\n)\n{\\displaystyle f_{1}(x),\\ldots ,f_{k}(x)}\njsou libovolné (zpravidla\nlineárně nezávislé\n) funkce. Regrese se nazývá lineární, neboť funkční předpis\ny\n=\nf\n(\nx\n,\nb\n1\n,\n…\n,\nb\nk\n)\n{\\displaystyle y=f(x,b_{1},\\ldots ,b_{k})}\nje lineární v proměnných\nb\n1\n,\n…\n,\nb\nk\n{\\displaystyle b_{1},\\ldots ,b_{k}}\n, tedy v koeficientech, které podrobujeme regresi. Jinými slovy, úlohu lze formulovat algebraicky jako (lineární)\nmetoda nejmenších čtverců\n.\nLineární regresí je tedy i výše popsané proložení bodů přímkou (\nf\n1\n(\nx\n)\n=\nx\n{\\displaystyle f_{1}(x)=x}\n,\nf\n2\n(\nx\n)\n=\n1\n{\\displaystyle f_{2}(x)=1}\n,\nf\n(\nx\n)\n=\nb\n1\nx\n+\nb\n2\n{\\displaystyle f(x)=b_{1}x+b_{2}}\n), ale také\nparabolou\n(\nf\n1\n(\nx\n)\n=\nx\n2\n{\\displaystyle f_{1}(x)=x^{2}}\n,\nf\n2\n(\nx\n)\n=\nx\n{\\displaystyle f_{2}(x)=x}\n,\nf\n3\n(\nx\n)\n=\n1\n{\\displaystyle f_{3}(x)=1}\n,\nf\n(\nx\n)\n=\nb\n1\nx\n2\n+\nb\n2\nx\n+\nb\n3\n{\\displaystyle f(x)=b_{1}x^{2}+b_{2}x+b_{3}}\n) nebo obecným\npolynomem\n. Poznamenejme, že s proložením množiny bodů parabolou, resp. obecným polynomem se můžeme v literatuře setkat pod pojmem kvadratická, resp. polynomická (či polynomiální) regrese.\n[\n1\n]\nKoeficienty\nb\n1\n,\n…\n,\nb\nk\n{\\displaystyle b_{1},\\ldots ,b_{k}}\njsou vypočteny metodou nejmenších čtverců, tedy tak, aby součet druhých mocnin odchylek modelu od daných dat, tj.\nS\n=\n∑\ni\n=\n1\nn\n(\ny\ni\n−\nf\n(\nx\ni\n,\nb\n1\n,\n…\n,\nb\nk\n)\n)\n2\n=\n∑\ni\n=\n1\nn\n(\nb\n1\nf\n1\n(\nx\ni\n)\n+\n…\n+\nb\nk\nf\nk\n(\nx\ni\n)\n−\ny\ni\n)\n2\n,\n{\\displaystyle S=\\sum _{i=1}^{n}(y_{i}-f(x_{i},b_{1},\\ldots ,b_{k}))^{2}=\\sum _{i=1}^{n}(b_{1}f_{1}(x_{i})+\\ldots +b_{k}f_{k}(x_{i})-y_{i})^{2},}\nbyl minimální.\n1. způsob výpočtu: parciální derivace\nPro koeficienty, které minimalizují výše uvedené kritérium\nS\n{\\displaystyle S}\n, musí platit, že všechny první parciální derivace kritéria podle těchto koeficientů musí být rovny nule.\n∂\nS\n∂\nb\n1\n=\n…\n=\n∂\nS\n∂\nb\nk\n=\n0\n{\\displaystyle {\\frac {\\partial S}{\\partial b_{1}}}=\\ldots ={\\frac {\\partial S}{\\partial b_{k}}}=0}\nDalšími úpravami se lze dostat k\nsoustavě lineárních rovnic\n:\na\n11\nb\n1\n+\n…\n+\na\n1\nk\nb\nk\n=\na\n1\n⋮\n⋱\n⋮\n=\n⋮\na\nk\n1\nb\n1\n+\n…\n+\na\nk\nk\nb\nk\n=\na\nk\n{\\displaystyle {\\begin{matrix}a_{11}b_{1}&+&\\ldots &+&a_{1k}b_{k}&=&a_{1}\\\\\\vdots &&\\ddots &&\\vdots &=&\\vdots \\\\a_{k1}b_{1}&+&\\ldots &+&a_{kk}b_{k}&=&a_{k}\\\\\\end{matrix}}}\nKde jednotlivé prvky\na\nj\nk\n{\\displaystyle a_{jk}}\na\na\nj\n{\\displaystyle a_{j}}\nznamenají:\na\nj\nk\n=\n∑\ni\n=\n1\nn\nf\nj\n(\nx\ni\n)\nf\nk\n(\nx\ni\n)\n{\\displaystyle a_{jk}=\\sum _{i=1}^{n}{f_{j}(x_{i})f_{k}(x_{i})}}\na\nj\n=\n∑\ni\n=\n1\nn\nf\nj\n(\nx\ni\n)\ny\ni\n{\\displaystyle a_{j}=\\sum _{i=1}^{n}{f_{j}(x_{i})y_{i}}}\nVýše uvedenou\nsoustavu rovnic\nlze řešit některou z metod uvedených v článku\nSoustava lineárních rovnic\n.\n2. způsob výpočtu: přeurčená soustava rovnic\nJiným způsobem, jak vypočítat hledané koeficienty, je sestavení\npřeurčené soustavy rovnic\na její vyřešení, opět metodou nejmenších čtverců, ale poněkud odlišným postupem. Přeurčená soustava rovnic může vypadat následovně:\nA\nx\n=\nb\n{\\displaystyle \\mathbf {A} \\mathbf {x} =\\mathbf {b} }\nA\n=\n[\nf\n1\n(\nx\n1\n)\n…\nf\nk\n(\nx\n1\n)\n⋮\n⋮\nf\n1\n(\nx\nn\n)\n⋯\nf\nk\n(\nx\nn\n)\n]\n,\nx\n=\n[\nb\n1\n⋮\nb\nk\n]\n,\nb\n=\n[\ny\n1\n⋮\ny\nn\n]\n,\nk\n≤\nn\n.\n{\\displaystyle \\mathbf {A} =\\left[{\\begin{matrix}f_{1}(x_{1})&\\ldots &f_{k}(x_{1})\\\\\\vdots &&\\vdots \\\\f_{1}(x_{n})&\\cdots &f_{k}(x_{n})\\end{matrix}}\\right],\\quad \\mathbf {x} =\\left[{\\begin{matrix}b_{1}\\\\\\vdots \\\\b_{k}\\end{matrix}}\\right],\\quad \\mathbf {b} =\\left[{\\begin{matrix}y_{1}\\\\\\vdots \\\\y_{n}\\end{matrix}}\\right],\\quad k\\leq n.}\nHledané koeficienty, umístěné ve vektoru\nx\n{\\displaystyle \\mathbf {x} }\n, lze, za předpokladu lineární nezávislosti sloupců matice\nA\n{\\displaystyle \\mathbf {A} }\n, vyjádřit vztahem:\nx\n=\n(\nA\nT\nA\n)\n−\n1\nA\nT\nb\n{\\displaystyle \\mathbf {x} =\\left(\\mathbf {A} ^{T}\\mathbf {A} \\right)^{-1}\\mathbf {A} ^{T}\\mathbf {b} }\nVýpočet na počítači\nMatlab\numožňuje soustavu rovnic\nAx\n=\nb\nřešit velmi snadno pomocí operátoru\n\\\n(\nzpětné lomítko\n), tedy\nx = A \\ b\n. Ekvivalentní je funkce\nMLDIVIDE\n, tedy\nx = mldivide(A, b)\n.\n[10]\nV\nExcelu\na Calcu (\nLibreOffice\na\nOpenOffice.org\n) lze výše sestavenou přeurčenou soustavu rovnic řešit použitím maticové funkce\n{=LINEST(known_y's; known_x's; const)}\n[11]\n[12]\n(v českém Excelu\nLINREGRESE(pole_y; pole_x; b)\n[13]\n), kde první parametr\nknown_y's\n(česky\npole_y\n) je svislá oblast buněk obsahující složky vektoru\nb\na druhý parametr\nknown_x's\n(česky\npole_x\n) je oblast obsahující prvky matice\nA\n. Výsledný vektor\nx\nse nachází ve vodorovné oblasti, přičemž jeho složky jsou umístěny v buňkách v opačném pořadí, tedy\nb\nk\nje v buňce nejvíce vlevo a\nb\n1\nje nejvíce vpravo. Třetí parametr\nconst\n(česky\nb\n) musí být v tomto příkladu roven nule, správné použití tedy je:\n{=LINEST(b; A; 0)}\n.\nOvšem nejjednodušším způsobem odhadu parametrů metodou nejmenších čtverců je použití ekonometrického softwaru jako např. STATA, Gretl, Eviews nebo R, kde existují obecné příkazy pro jejich výpočet. Zároveň i tyto programy umožňují jednoduše testovat předpoklady daného modelu.\nPřevod mocninné a exponenciální regrese na lineární\nNa lineární problém lze transformovat i aproximaci\nmocninnou funkcí\nf\n(\nx\n)\n=\na\n⋅\nx\nb\n{\\displaystyle f(x)=a\\cdot x^{b}}\nnebo aproximaci\nfunkcí exponenciální\nf\n(\nx\n)\n=\na\n⋅\nb\nx\n{\\displaystyle f(x)=a\\cdot b^{x}}\n.\nMocninná funkce\nProblém, jak aproximovat původní data\n[\nx\ni\n,\ny\ni\n]\n{\\displaystyle [x_{i},y_{i}]}\nkřivkou\ny\n=\na\n⋅\nx\nb\n{\\displaystyle y=a\\cdot x^{b}}\nlze převést na podobný problém\nzlogaritmováním\nrovnice křivky.\nln\n⁡\n(\ny\n)\n=\nln\n⁡\n(\na\n)\n+\nb\n⋅\nln\n⁡\n(\nx\n)\n{\\displaystyle \\ln(y)=\\ln(a)+b\\cdot \\ln(x)}\n,\npřičemž místo\nln\n⁡\n(\na\n)\n{\\displaystyle \\ln(a)}\nlze psát\nc\n{\\displaystyle c}\n.\nln\n⁡\n(\ny\n)\n=\nc\n+\nb\n⋅\nln\n⁡\n(\nx\n)\n{\\displaystyle \\ln(y)=c+b\\cdot \\ln(x)}\nVznikl tak problém, jak aproximovat logaritmovaná původní data\n[\nln\n⁡\n(\nx\ni\n)\n,\nln\n⁡\n(\ny\ni\n)\n]\n{\\displaystyle [\\ln(x_{i}),\\ln(y_{i})]}\npřímkou\ny\n=\nc\n+\nb\n⋅\nx\n{\\displaystyle y=c+b\\cdot x}\n, který již problémem není. Koeficient\na\n{\\displaystyle a}\nv mocninné funkci lze z koeficientu\nc\n{\\displaystyle c}\nvypočítat jako\na\n=\ne\nc\n{\\displaystyle a=e^{c}}\n.\nExponenciální funkce\nProblém, jak aproximovat původní data\n[\nx\ni\n,\ny\ni\n]\n{\\displaystyle [x_{i},y_{i}]}\nkřivkou\ny\n=\na\n⋅\nb\nx\n{\\displaystyle y=a\\cdot b^{x}}\nlze převést na podobný problém zlogaritmováním rovnice křivky.\nln\n⁡\n(\ny\n)\n=\nln\n⁡\n(\na\n)\n+\nx\n⋅\nln\n⁡\n(\nb\n)\n{\\displaystyle \\ln(y)=\\ln(a)+x\\cdot \\ln(b)}\n,\npřičemž místo konstant\nln\n⁡\n(\na\n)\n{\\displaystyle \\ln(a)}\na\nln\n⁡\n(\nb\n)\n{\\displaystyle \\ln(b)}\nlze psát\nc\n{\\displaystyle c}\na\nd\n{\\displaystyle d}\n.\nln\n⁡\n(\ny\n)\n=\nc\n+\nx\n⋅\nd\n{\\displaystyle \\ln(y)=c+x\\cdot d}\nNa rozdíl od aproximace mocninnou funkcí, stačí z původních dat logaritmovat pouze hodnoty\ny\ni\n{\\displaystyle y_{i}}\na řešit problém, jak aproximovat data\n[\nx\ni\n,\nln\n⁡\n(\ny\ni\n)\n]\n{\\displaystyle [x_{i},\\ln(y_{i})]}\npřímkou\ny\n=\nc\n+\nd\n⋅\nx\n{\\displaystyle y=c+d\\cdot x}\n. Koeficienty\na\n{\\displaystyle a}\na\nb\n{\\displaystyle b}\nv exponenciální funkci lze z koeficientů\nc\n{\\displaystyle c}\na\nd\n{\\displaystyle d}\nvypočítat jako\na\n=\ne\nc\n{\\displaystyle a=e^{c}}\n,\nb\n=\ne\nd\n{\\displaystyle b=e^{d}}\n.\nReference\n↑\nJiří Likeš, Josef Machek,\nMatematická statistika\n, SNTL Praha 1988, s. 165-169\nSouvisející články\nAproximace\nLineární funkce\nKvadratická regrese\nKoeficient determinace\nMetoda nejmenších čtverců\nPolynomická regrese\nRegresní analýza\nExterní odkazy\nObrázky, zvuky či videa k tématu\nlineární regrese\nna Wikimedia Commons\nLineární regrese tak nebo jinak:\nhttps://web.archive.org/web/20061002153201/http://www.kolej.mff.cuni.cz/%7Elmotm275/skripta/sbirka/html/node49.html\nLineární regrese v\nMicrosoft Excel\n:\nhttp://praktika.kvalitne.cz/index.php?clanek=text_navod&text=22\nArchivováno\n29. 6. 2020 na\nWayback Machine\n.\nAproximace obecnou funkcí, přímkou, polynomem, statistika:\nhttp://amper.ped.muni.cz/…\nCitováno z „\nhttps://cs.wikipedia.org/w/index.php?title=Lineární_regrese&oldid=24250762\n“"}
